---
title: ParameterTypeId
classe: Autodesk.Revit.DB.ParameterTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3627
---

# ParameterTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId ActualMaxRidgeHeightParam { get; }` | `ParameterTypeId.ActualMaxRidgeHeightParam` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelDistance { get; }` | `ParameterTypeId.AlignmentStationLabelDistance` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelIncludeStation { get; }` | `ParameterTypeId.AlignmentStationLabelIncludeStation` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelIndStation { get; }` | `ParameterTypeId.AlignmentStationLabelIndStation` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelSetEndStation { get; }` | `ParameterTypeId.AlignmentStationLabelSetEndStation` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelSetInterval { get; }` | `ParameterTypeId.AlignmentStationLabelSetInterval` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelSetOffset { get; }` | `ParameterTypeId.AlignmentStationLabelSetOffset` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelSetStartStation { get; }` | `ParameterTypeId.AlignmentStationLabelSetStartStation` | ForgeTypeId |
| `ForgeTypeId AlignmentStationLabelStationValue { get; }` | `ParameterTypeId.AlignmentStationLabelStationValue` | ForgeTypeId |
| `ForgeTypeId AlignmentStationPrefix { get; }` | `ParameterTypeId.AlignmentStationPrefix` | ForgeTypeId |
| `ForgeTypeId AlignmentStationSuffix { get; }` | `ParameterTypeId.AlignmentStationSuffix` | ForgeTypeId |
| `ForgeTypeId AllGridRotationForDivisionRule { get; }` | `ParameterTypeId.AllGridRotationForDivisionRule` | ForgeTypeId |
| `ForgeTypeId AllModelDescription { get; }` | `ParameterTypeId.AllModelDescription` | ForgeTypeId |
| `ForgeTypeId AllModelImage { get; }` | `ParameterTypeId.AllModelImage` | ForgeTypeId |
| `ForgeTypeId AllModelInstanceComments { get; }` | `ParameterTypeId.AllModelInstanceComments` | ForgeTypeId |
| `ForgeTypeId AllModelManufacturer { get; }` | `ParameterTypeId.AllModelManufacturer` | ForgeTypeId |
| `ForgeTypeId AllModelModel { get; }` | `ParameterTypeId.AllModelModel` | ForgeTypeId |
| `ForgeTypeId AllModelTypeComments { get; }` | `ParameterTypeId.AllModelTypeComments` | ForgeTypeId |
| `ForgeTypeId AllModelTypeImage { get; }` | `ParameterTypeId.AllModelTypeImage` | ForgeTypeId |
| `ForgeTypeId AllModelUrl { get; }` | `ParameterTypeId.AllModelUrl` | ForgeTypeId |
| `ForgeTypeId AllowAutoEmbed { get; }` | `ParameterTypeId.AllowAutoEmbed` | ForgeTypeId |
| `ForgeTypeId AllowMultipleSelection { get; }` | `ParameterTypeId.AllowMultipleSelection` | ForgeTypeId |
| `ForgeTypeId AlternateUnits { get; }` | `ParameterTypeId.AlternateUnits` | ForgeTypeId |
| `ForgeTypeId AlternateUnitsPrefix { get; }` | `ParameterTypeId.AlternateUnitsPrefix` | ForgeTypeId |
| `ForgeTypeId AlternateUnitsSuffix { get; }` | `ParameterTypeId.AlternateUnitsSuffix` | ForgeTypeId |
| `ForgeTypeId AlwaysZeroLength { get; }` | `ParameterTypeId.AlwaysZeroLength` | ForgeTypeId |
| `ForgeTypeId AnalyticalAbsorptance { get; }` | `ParameterTypeId.AnalyticalAbsorptance` | ForgeTypeId |
| `ForgeTypeId AnalyticalAdjacentSpace { get; }` | `ParameterTypeId.AnalyticalAdjacentSpace` | ForgeTypeId |
| `ForgeTypeId AnalyticalDefineThermalPropertiesBy { get; }` | `ParameterTypeId.AnalyticalDefineThermalPropertiesBy` | ForgeTypeId |
| `ForgeTypeId AnalyticalElementHasAssociation { get; }` | `ParameterTypeId.AnalyticalElementHasAssociation` | ForgeTypeId |
| `ForgeTypeId AnalyticalElementPhysicalAsset { get; }` | `ParameterTypeId.AnalyticalElementPhysicalAsset` | ForgeTypeId |
| `ForgeTypeId AnalyticalElementStructuralRole { get; }` | `ParameterTypeId.AnalyticalElementStructuralRole` | ForgeTypeId |
| `ForgeTypeId AnalyticalGeometryIsValid { get; }` | `ParameterTypeId.AnalyticalGeometryIsValid` | ForgeTypeId |
| `ForgeTypeId AnalyticalHeatTransferCoefficient { get; }` | `ParameterTypeId.AnalyticalHeatTransferCoefficient` | ForgeTypeId |
| `ForgeTypeId AnalyticalLinkReleaseRotationX { get; }` | `ParameterTypeId.AnalyticalLinkReleaseRotationX` | ForgeTypeId |
| `ForgeTypeId AnalyticalLinkReleaseRotationY { get; }` | `ParameterTypeId.AnalyticalLinkReleaseRotationY` | ForgeTypeId |
| `ForgeTypeId AnalyticalLinkReleaseRotationZ { get; }` | `ParameterTypeId.AnalyticalLinkReleaseRotationZ` | ForgeTypeId |
| `ForgeTypeId AnalyticalLinkReleaseTranslationX { get; }` | `ParameterTypeId.AnalyticalLinkReleaseTranslationX` | ForgeTypeId |
| `ForgeTypeId AnalyticalLinkReleaseTranslationY { get; }` | `ParameterTypeId.AnalyticalLinkReleaseTranslationY` | ForgeTypeId |
| `ForgeTypeId AnalyticalLinkReleaseTranslationZ { get; }` | `ParameterTypeId.AnalyticalLinkReleaseTranslationZ` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndAllNonZero { get; }` | `ParameterTypeId.AnalyticalMemberForceEndAllNonZero` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndFx { get; }` | `ParameterTypeId.AnalyticalMemberForceEndFx` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndFy { get; }` | `ParameterTypeId.AnalyticalMemberForceEndFy` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndFz { get; }` | `ParameterTypeId.AnalyticalMemberForceEndFz` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndMx { get; }` | `ParameterTypeId.AnalyticalMemberForceEndMx` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndMy { get; }` | `ParameterTypeId.AnalyticalMemberForceEndMy` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceEndMz { get; }` | `ParameterTypeId.AnalyticalMemberForceEndMz` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartAllNonZero { get; }` | `ParameterTypeId.AnalyticalMemberForceStartAllNonZero` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartFx { get; }` | `ParameterTypeId.AnalyticalMemberForceStartFx` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartFy { get; }` | `ParameterTypeId.AnalyticalMemberForceStartFy` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartFz { get; }` | `ParameterTypeId.AnalyticalMemberForceStartFz` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartMx { get; }` | `ParameterTypeId.AnalyticalMemberForceStartMx` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartMy { get; }` | `ParameterTypeId.AnalyticalMemberForceStartMy` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberForceStartMz { get; }` | `ParameterTypeId.AnalyticalMemberForceStartMz` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberRotation { get; }` | `ParameterTypeId.AnalyticalMemberRotation` | ForgeTypeId |
| `ForgeTypeId AnalyticalMemberSectionType { get; }` | `ParameterTypeId.AnalyticalMemberSectionType` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelArea { get; }` | `ParameterTypeId.AnalyticalModelArea` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelBaseAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelBaseAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelBaseExtensionMethod { get; }` | `ParameterTypeId.AnalyticalModelBaseExtensionMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelBaseYProjection { get; }` | `ParameterTypeId.AnalyticalModelBaseYProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelBaseZProjection { get; }` | `ParameterTypeId.AnalyticalModelBaseZProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelCodeChecking { get; }` | `ParameterTypeId.AnalyticalModelCodeChecking` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelColumnBaseExtension { get; }` | `ParameterTypeId.AnalyticalModelColumnBaseExtension` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelColumnTopExtension { get; }` | `ParameterTypeId.AnalyticalModelColumnTopExtension` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelEndAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelEndAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelEndProjectionOrthogonal { get; }` | `ParameterTypeId.AnalyticalModelEndProjectionOrthogonal` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelEndYProjection { get; }` | `ParameterTypeId.AnalyticalModelEndYProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelEndZProjection { get; }` | `ParameterTypeId.AnalyticalModelEndZProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelFloorAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelFloorAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelFloorProjection { get; }` | `ParameterTypeId.AnalyticalModelFloorProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelFoundationsMark { get; }` | `ParameterTypeId.AnalyticalModelFoundationsMark` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelLength { get; }` | `ParameterTypeId.AnalyticalModelLength` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelManuallyAdjusted { get; }` | `ParameterTypeId.AnalyticalModelManuallyAdjusted` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelNodesMark { get; }` | `ParameterTypeId.AnalyticalModelNodesMark` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelPerimeter { get; }` | `ParameterTypeId.AnalyticalModelPerimeter` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelPhysicalType { get; }` | `ParameterTypeId.AnalyticalModelPhysicalType` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelRotation { get; }` | `ParameterTypeId.AnalyticalModelRotation` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelSketchAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelSketchAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelSketchProjection { get; }` | `ParameterTypeId.AnalyticalModelSketchProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelStartAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelStartAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelStartProjectionOrthogonal { get; }` | `ParameterTypeId.AnalyticalModelStartProjectionOrthogonal` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelStartYProjection { get; }` | `ParameterTypeId.AnalyticalModelStartYProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelStartZProjection { get; }` | `ParameterTypeId.AnalyticalModelStartZProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelStickElementsMark { get; }` | `ParameterTypeId.AnalyticalModelStickElementsMark` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelSurfaceElementsMark { get; }` | `ParameterTypeId.AnalyticalModelSurfaceElementsMark` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelTopAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelTopAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelTopExtensionMethod { get; }` | `ParameterTypeId.AnalyticalModelTopExtensionMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelTopYProjection { get; }` | `ParameterTypeId.AnalyticalModelTopYProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelTopZProjection { get; }` | `ParameterTypeId.AnalyticalModelTopZProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelWallAlignmentMethod { get; }` | `ParameterTypeId.AnalyticalModelWallAlignmentMethod` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelWallBaseProjection { get; }` | `ParameterTypeId.AnalyticalModelWallBaseProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelWallProjection { get; }` | `ParameterTypeId.AnalyticalModelWallProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalModelWallTopProjection { get; }` | `ParameterTypeId.AnalyticalModelWallTopProjection` | ForgeTypeId |
| `ForgeTypeId AnalyticalNodeCanBeHosted { get; }` | `ParameterTypeId.AnalyticalNodeCanBeHosted` | ForgeTypeId |
| `ForgeTypeId AnalyticalNodeConnectionStatus { get; }` | `ParameterTypeId.AnalyticalNodeConnectionStatus` | ForgeTypeId |
| `ForgeTypeId AnalyticalNodeType { get; }` | `ParameterTypeId.AnalyticalNodeType` | ForgeTypeId |
| `ForgeTypeId AnalyticalPanelThickness { get; }` | `ParameterTypeId.AnalyticalPanelThickness` | ForgeTypeId |
| `ForgeTypeId AnalyticalRoughness { get; }` | `ParameterTypeId.AnalyticalRoughness` | ForgeTypeId |
| `ForgeTypeId AnalyticalSolarHeatGainCoefficient { get; }` | `ParameterTypeId.AnalyticalSolarHeatGainCoefficient` | ForgeTypeId |
| `ForgeTypeId AnalyticalSpace { get; }` | `ParameterTypeId.AnalyticalSpace` | ForgeTypeId |
| `ForgeTypeId AnalyticalSurface { get; }` | `ParameterTypeId.AnalyticalSurface` | ForgeTypeId |
| `ForgeTypeId AnalyticalThermalMass { get; }` | `ParameterTypeId.AnalyticalThermalMass` | ForgeTypeId |
| `ForgeTypeId AnalyticalThermalResistance { get; }` | `ParameterTypeId.AnalyticalThermalResistance` | ForgeTypeId |
| `ForgeTypeId AnalyticalVisualLightTransmittance { get; }` | `ParameterTypeId.AnalyticalVisualLightTransmittance` | ForgeTypeId |
| `ForgeTypeId AnalyticalZone { get; }` | `ParameterTypeId.AnalyticalZone` | ForgeTypeId |
| `ForgeTypeId AnalyticalZoneName { get; }` | `ParameterTypeId.AnalyticalZoneName` | ForgeTypeId |
| `ForgeTypeId AnalyticConstruction { get; }` | `ParameterTypeId.AnalyticConstruction` | ForgeTypeId |
| `ForgeTypeId AnalyticConstructionGbxmlTypeid { get; }` | `ParameterTypeId.AnalyticConstructionGbxmlTypeid` | ForgeTypeId |
| `ForgeTypeId AnalyticConstructionLookupTable { get; }` | `ParameterTypeId.AnalyticConstructionLookupTable` | ForgeTypeId |
| `ForgeTypeId AnyPatternIdParam { get; }` | `ParameterTypeId.AnyPatternIdParam` | ForgeTypeId |
| `ForgeTypeId AnyPatternIdParamNoNo { get; }` | `ParameterTypeId.AnyPatternIdParamNoNo` | ForgeTypeId |
| `ForgeTypeId ArcCenterMark { get; }` | `ParameterTypeId.ArcCenterMark` | ForgeTypeId |
| `ForgeTypeId ArcElemFixKeepConcentric { get; }` | `ParameterTypeId.ArcElemFixKeepConcentric` | ForgeTypeId |
| `ForgeTypeId ArcLeaderParam { get; }` | `ParameterTypeId.ArcLeaderParam` | ForgeTypeId |
| `ForgeTypeId ArcWallCntrMrkVisible { get; }` | `ParameterTypeId.ArcWallCntrMrkVisible` | ForgeTypeId |
| `ForgeTypeId AreaSchemeId { get; }` | `ParameterTypeId.AreaSchemeId` | ForgeTypeId |
| `ForgeTypeId AreaSchemeName { get; }` | `ParameterTypeId.AreaSchemeName` | ForgeTypeId |
| `ForgeTypeId AreaType { get; }` | `ParameterTypeId.AreaType` | ForgeTypeId |
| `ForgeTypeId AreaTypeText { get; }` | `ParameterTypeId.AreaTypeText` | ForgeTypeId |
| `ForgeTypeId ArrowCentered { get; }` | `ParameterTypeId.ArrowCentered` | ForgeTypeId |
| `ForgeTypeId ArrowClosed { get; }` | `ParameterTypeId.ArrowClosed` | ForgeTypeId |
| `ForgeTypeId ArrowFilled { get; }` | `ParameterTypeId.ArrowFilled` | ForgeTypeId |
| `ForgeTypeId ArrowheadEndAtRiser { get; }` | `ParameterTypeId.ArrowheadEndAtRiser` | ForgeTypeId |
| `ForgeTypeId ArrowheadType { get; }` | `ParameterTypeId.ArrowheadType` | ForgeTypeId |
| `ForgeTypeId ArrowSize { get; }` | `ParameterTypeId.ArrowSize` | ForgeTypeId |
| `ForgeTypeId ArrowType { get; }` | `ParameterTypeId.ArrowType` | ForgeTypeId |
| `ForgeTypeId AssemblyName { get; }` | `ParameterTypeId.AssemblyName` | ForgeTypeId |
| `ForgeTypeId AssemblyNamingCategory { get; }` | `ParameterTypeId.AssemblyNamingCategory` | ForgeTypeId |
| `ForgeTypeId AssemblyPrecastFreeze { get; }` | `ParameterTypeId.AssemblyPrecastFreeze` | ForgeTypeId |
| `ForgeTypeId AssignTemplateOnViewCreation { get; }` | `ParameterTypeId.AssignTemplateOnViewCreation` | ForgeTypeId |
| `ForgeTypeId AssociatedLevel { get; }` | `ParameterTypeId.AssociatedLevel` | ForgeTypeId |
| `ForgeTypeId AssociatedLevelOffset { get; }` | `ParameterTypeId.AssociatedLevelOffset` | ForgeTypeId |
| `ForgeTypeId AutoJoinCondition { get; }` | `ParameterTypeId.AutoJoinCondition` | ForgeTypeId |
| `ForgeTypeId AutoJoinConditionWall { get; }` | `ParameterTypeId.AutoJoinConditionWall` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder1Grid1 { get; }` | `ParameterTypeId.AutoMullionBorder1Grid1` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder1Grid2 { get; }` | `ParameterTypeId.AutoMullionBorder1Grid2` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder1Horiz { get; }` | `ParameterTypeId.AutoMullionBorder1Horiz` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder1Vert { get; }` | `ParameterTypeId.AutoMullionBorder1Vert` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder2Grid1 { get; }` | `ParameterTypeId.AutoMullionBorder2Grid1` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder2Grid2 { get; }` | `ParameterTypeId.AutoMullionBorder2Grid2` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder2Horiz { get; }` | `ParameterTypeId.AutoMullionBorder2Horiz` | ForgeTypeId |
| `ForgeTypeId AutoMullionBorder2Vert { get; }` | `ParameterTypeId.AutoMullionBorder2Vert` | ForgeTypeId |
| `ForgeTypeId AutoMullionInteriorGrid1 { get; }` | `ParameterTypeId.AutoMullionInteriorGrid1` | ForgeTypeId |
| `ForgeTypeId AutoMullionInteriorGrid2 { get; }` | `ParameterTypeId.AutoMullionInteriorGrid2` | ForgeTypeId |
| `ForgeTypeId AutoMullionInteriorHoriz { get; }` | `ParameterTypeId.AutoMullionInteriorHoriz` | ForgeTypeId |
| `ForgeTypeId AutoMullionInteriorVert { get; }` | `ParameterTypeId.AutoMullionInteriorVert` | ForgeTypeId |
| `ForgeTypeId AutoPanel { get; }` | `ParameterTypeId.AutoPanel` | ForgeTypeId |
| `ForgeTypeId AutoPanelWall { get; }` | `ParameterTypeId.AutoPanelWall` | ForgeTypeId |
| `ForgeTypeId Azimuth { get; }` | `ParameterTypeId.Azimuth` | ForgeTypeId |
| `ForgeTypeId BackgroundDraftPatternIdParam { get; }` | `ParameterTypeId.BackgroundDraftPatternIdParam` | ForgeTypeId |
| `ForgeTypeId BackgroundPatternColorParam { get; }` | `ParameterTypeId.BackgroundPatternColorParam` | ForgeTypeId |
| `ForgeTypeId BaselineDimOffset { get; }` | `ParameterTypeId.BaselineDimOffset` | ForgeTypeId |
| `ForgeTypeId BasepointAngletonParam { get; }` | `ParameterTypeId.BasepointAngletonParam` | ForgeTypeId |
| `ForgeTypeId BasepointEastwestParam { get; }` | `ParameterTypeId.BasepointEastwestParam` | ForgeTypeId |
| `ForgeTypeId BasepointElevationParam { get; }` | `ParameterTypeId.BasepointElevationParam` | ForgeTypeId |
| `ForgeTypeId BasepointLatitudeParam { get; }` | `ParameterTypeId.BasepointLatitudeParam` | ForgeTypeId |
| `ForgeTypeId BasepointLongitudeParam { get; }` | `ParameterTypeId.BasepointLongitudeParam` | ForgeTypeId |
| `ForgeTypeId BasepointNorthsouthParam { get; }` | `ParameterTypeId.BasepointNorthsouthParam` | ForgeTypeId |
| `ForgeTypeId BeamHJustification { get; }` | `ParameterTypeId.BeamHJustification` | ForgeTypeId |
| `ForgeTypeId BeamSystem3dParam { get; }` | `ParameterTypeId.BeamSystem3dParam` | ForgeTypeId |
| `ForgeTypeId BeamSystemTagInstParamAngle { get; }` | `ParameterTypeId.BeamSystemTagInstParamAngle` | ForgeTypeId |
| `ForgeTypeId BeamSystemTagParamLeft { get; }` | `ParameterTypeId.BeamSystemTagParamLeft` | ForgeTypeId |
| `ForgeTypeId BeamSystemTagParamRight { get; }` | `ParameterTypeId.BeamSystemTagParamRight` | ForgeTypeId |
| `ForgeTypeId BeamVJustification { get; }` | `ParameterTypeId.BeamVJustification` | ForgeTypeId |
| `ForgeTypeId BeamVJustificationOtherValue { get; }` | `ParameterTypeId.BeamVJustificationOtherValue` | ForgeTypeId |
| `ForgeTypeId BendingDetailAngularDimensionTextPosition { get; }` | `ParameterTypeId.BendingDetailAngularDimensionTextPosition` | ForgeTypeId |
| `ForgeTypeId BendingDetailDetailLevel { get; }` | `ParameterTypeId.BendingDetailDetailLevel` | ForgeTypeId |
| `ForgeTypeId BendingdetailPosition { get; }` | `ParameterTypeId.BendingdetailPosition` | ForgeTypeId |
| `ForgeTypeId BendingDetailRepresentationFor3dBars { get; }` | `ParameterTypeId.BendingDetailRepresentationFor3dBars` | ForgeTypeId |
| `ForgeTypeId BendingDetailSegmentLengthDimensionTextPosition { get; }` | `ParameterTypeId.BendingDetailSegmentLengthDimensionTextPosition` | ForgeTypeId |
| `ForgeTypeId BendingDetailSegmentRepresentation { get; }` | `ParameterTypeId.BendingDetailSegmentRepresentation` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeAngularDimensionOffset { get; }` | `ParameterTypeId.BendingDetailTypeAngularDimensionOffset` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeAngularDimensionsEnabled { get; }` | `ParameterTypeId.BendingDetailTypeAngularDimensionsEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeAngularDimensionsForHooksEnabled { get; }` | `ParameterTypeId.BendingDetailTypeAngularDimensionsForHooksEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeAngularDimensionsMeasurement { get; }` | `ParameterTypeId.BendingDetailTypeAngularDimensionsMeasurement` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeAngularDimensionTypeId { get; }` | `ParameterTypeId.BendingDetailTypeAngularDimensionTypeId` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeBendDiameterDimensionsEnabled { get; }` | `ParameterTypeId.BendingDetailTypeBendDiameterDimensionsEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeBendDiameterDimensionsForHooksEnabled { get; }` | `ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForHooksEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled { get; }` | `ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeDiameterDimensionTypeId { get; }` | `ParameterTypeId.BendingDetailTypeDiameterDimensionTypeId` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeOrthogonalAndOverallDimesionsEnabled { get; }` | `ParameterTypeId.BendingDetailTypeOrthogonalAndOverallDimesionsEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeRadialDimensionTypeId { get; }` | `ParameterTypeId.BendingDetailTypeRadialDimensionTypeId` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSchematicHeight { get; }` | `ParameterTypeId.BendingDetailTypeSchematicHeight` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSchematicWidth { get; }` | `ParameterTypeId.BendingDetailTypeSchematicWidth` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSegmentLengthDimensionsEnabled { get; }` | `ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSegmentLengthDimensionsForHooksEnabled { get; }` | `ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsForHooksEnabled` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSegmentLengthDimensionsOffset { get; }` | `ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsOffset` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSegmentLengthDimensionTypeId { get; }` | `ParameterTypeId.BendingDetailTypeSegmentLengthDimensionTypeId` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSegmentLengthsDisplayOption { get; }` | `ParameterTypeId.BendingDetailTypeSegmentLengthsDisplayOption` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeSegmentLengthsForArcsDisplayOption { get; }` | `ParameterTypeId.BendingDetailTypeSegmentLengthsForArcsDisplayOption` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeShowAngularDimensionsFor { get; }` | `ParameterTypeId.BendingDetailTypeShowAngularDimensionsFor` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeShowBarBendingUsing { get; }` | `ParameterTypeId.BendingDetailTypeShowBarBendingUsing` | ForgeTypeId |
| `ForgeTypeId BendingDetailTypeTagTypeId { get; }` | `ParameterTypeId.BendingDetailTypeTagTypeId` | ForgeTypeId |
| `ForgeTypeId BendingDetailVaryingRebarDimension { get; }` | `ParameterTypeId.BendingDetailVaryingRebarDimension` | ForgeTypeId |
| `ForgeTypeId BentFabricParamBendDirection { get; }` | `ParameterTypeId.BentFabricParamBendDirection` | ForgeTypeId |
| `ForgeTypeId BentFabricParamLongitudinalCutLength { get; }` | `ParameterTypeId.BentFabricParamLongitudinalCutLength` | ForgeTypeId |
| `ForgeTypeId BentFabricParamStraightWiresLocation { get; }` | `ParameterTypeId.BentFabricParamStraightWiresLocation` | ForgeTypeId |
| `ForgeTypeId BlendDepthParam { get; }` | `ParameterTypeId.BlendDepthParam` | ForgeTypeId |
| `ForgeTypeId BlendEndParam { get; }` | `ParameterTypeId.BlendEndParam` | ForgeTypeId |
| `ForgeTypeId BlendStartParam { get; }` | `ParameterTypeId.BlendStartParam` | ForgeTypeId |
| `ForgeTypeId BoundaryAreaRestraintX { get; }` | `ParameterTypeId.BoundaryAreaRestraintX` | ForgeTypeId |
| `ForgeTypeId BoundaryAreaRestraintY { get; }` | `ParameterTypeId.BoundaryAreaRestraintY` | ForgeTypeId |
| `ForgeTypeId BoundaryAreaRestraintZ { get; }` | `ParameterTypeId.BoundaryAreaRestraintZ` | ForgeTypeId |
| `ForgeTypeId BoundaryBearing { get; }` | `ParameterTypeId.BoundaryBearing` | ForgeTypeId |
| `ForgeTypeId BoundaryConditionsIsExt { get; }` | `ParameterTypeId.BoundaryConditionsIsExt` | ForgeTypeId |
| `ForgeTypeId BoundaryConditionsType { get; }` | `ParameterTypeId.BoundaryConditionsType` | ForgeTypeId |
| `ForgeTypeId BoundaryDirectionRotX { get; }` | `ParameterTypeId.BoundaryDirectionRotX` | ForgeTypeId |
| `ForgeTypeId BoundaryDirectionRotY { get; }` | `ParameterTypeId.BoundaryDirectionRotY` | ForgeTypeId |
| `ForgeTypeId BoundaryDirectionRotZ { get; }` | `ParameterTypeId.BoundaryDirectionRotZ` | ForgeTypeId |
| `ForgeTypeId BoundaryDirectionX { get; }` | `ParameterTypeId.BoundaryDirectionX` | ForgeTypeId |
| `ForgeTypeId BoundaryDirectionY { get; }` | `ParameterTypeId.BoundaryDirectionY` | ForgeTypeId |
| `ForgeTypeId BoundaryDirectionZ { get; }` | `ParameterTypeId.BoundaryDirectionZ` | ForgeTypeId |
| `ForgeTypeId BoundaryDistance { get; }` | `ParameterTypeId.BoundaryDistance` | ForgeTypeId |
| `ForgeTypeId BoundaryLinearRestraintRotX { get; }` | `ParameterTypeId.BoundaryLinearRestraintRotX` | ForgeTypeId |
| `ForgeTypeId BoundaryLinearRestraintX { get; }` | `ParameterTypeId.BoundaryLinearRestraintX` | ForgeTypeId |
| `ForgeTypeId BoundaryLinearRestraintY { get; }` | `ParameterTypeId.BoundaryLinearRestraintY` | ForgeTypeId |
| `ForgeTypeId BoundaryLinearRestraintZ { get; }` | `ParameterTypeId.BoundaryLinearRestraintZ` | ForgeTypeId |
| `ForgeTypeId BoundaryParamPreset { get; }` | `ParameterTypeId.BoundaryParamPreset` | ForgeTypeId |
| `ForgeTypeId BoundaryParamPresetArea { get; }` | `ParameterTypeId.BoundaryParamPresetArea` | ForgeTypeId |
| `ForgeTypeId BoundaryParamPresetLinear { get; }` | `ParameterTypeId.BoundaryParamPresetLinear` | ForgeTypeId |
| `ForgeTypeId BoundaryRadius { get; }` | `ParameterTypeId.BoundaryRadius` | ForgeTypeId |
| `ForgeTypeId BoundaryRestraintRotX { get; }` | `ParameterTypeId.BoundaryRestraintRotX` | ForgeTypeId |
| `ForgeTypeId BoundaryRestraintRotY { get; }` | `ParameterTypeId.BoundaryRestraintRotY` | ForgeTypeId |
| `ForgeTypeId BoundaryRestraintRotZ { get; }` | `ParameterTypeId.BoundaryRestraintRotZ` | ForgeTypeId |
| `ForgeTypeId BoundaryRestraintX { get; }` | `ParameterTypeId.BoundaryRestraintX` | ForgeTypeId |
| `ForgeTypeId BoundaryRestraintY { get; }` | `ParameterTypeId.BoundaryRestraintY` | ForgeTypeId |
| `ForgeTypeId BoundaryRestraintZ { get; }` | `ParameterTypeId.BoundaryRestraintZ` | ForgeTypeId |
| `ForgeTypeId BoundaryXRotationFixed { get; }` | `ParameterTypeId.BoundaryXRotationFixed` | ForgeTypeId |
| `ForgeTypeId BoundaryXRotationSpring { get; }` | `ParameterTypeId.BoundaryXRotationSpring` | ForgeTypeId |
| `ForgeTypeId BoundaryXTranslationFixed { get; }` | `ParameterTypeId.BoundaryXTranslationFixed` | ForgeTypeId |
| `ForgeTypeId BoundaryXTranslationSpring { get; }` | `ParameterTypeId.BoundaryXTranslationSpring` | ForgeTypeId |
| `ForgeTypeId BoundaryYRotationFixed { get; }` | `ParameterTypeId.BoundaryYRotationFixed` | ForgeTypeId |
| `ForgeTypeId BoundaryYRotationSpring { get; }` | `ParameterTypeId.BoundaryYRotationSpring` | ForgeTypeId |
| `ForgeTypeId BoundaryYTranslationFixed { get; }` | `ParameterTypeId.BoundaryYTranslationFixed` | ForgeTypeId |
| `ForgeTypeId BoundaryYTranslationSpring { get; }` | `ParameterTypeId.BoundaryYTranslationSpring` | ForgeTypeId |
| `ForgeTypeId BoundaryZRotationFixed { get; }` | `ParameterTypeId.BoundaryZRotationFixed` | ForgeTypeId |
| `ForgeTypeId BoundaryZRotationSpring { get; }` | `ParameterTypeId.BoundaryZRotationSpring` | ForgeTypeId |
| `ForgeTypeId BoundaryZTranslationFixed { get; }` | `ParameterTypeId.BoundaryZTranslationFixed` | ForgeTypeId |
| `ForgeTypeId BoundaryZTranslationSpring { get; }` | `ParameterTypeId.BoundaryZTranslationSpring` | ForgeTypeId |
| `ForgeTypeId BrOrgFilter { get; }` | `ParameterTypeId.BrOrgFilter` | ForgeTypeId |
| `ForgeTypeId BrOrgFolders { get; }` | `ParameterTypeId.BrOrgFolders` | ForgeTypeId |
| `ForgeTypeId BuildingClosingTimeParam { get; }` | `ParameterTypeId.BuildingClosingTimeParam` | ForgeTypeId |
| `ForgeTypeId BuildingCurveGstyle { get; }` | `ParameterTypeId.BuildingCurveGstyle` | ForgeTypeId |
| `ForgeTypeId BuildingCurveGstylePlusInvisible { get; }` | `ParameterTypeId.BuildingCurveGstylePlusInvisible` | ForgeTypeId |
| `ForgeTypeId BuildingOpeningTimeParam { get; }` | `ParameterTypeId.BuildingOpeningTimeParam` | ForgeTypeId |
| `ForgeTypeId BuildingpadHeightabovelevelParam { get; }` | `ParameterTypeId.BuildingpadHeightabovelevelParam` | ForgeTypeId |
| `ForgeTypeId BuildingpadThickness { get; }` | `ParameterTypeId.BuildingpadThickness` | ForgeTypeId |
| `ForgeTypeId BuildingUnoccupiedCoolingSetPointParam { get; }` | `ParameterTypeId.BuildingUnoccupiedCoolingSetPointParam` | ForgeTypeId |
| `ForgeTypeId BuilidingPadStructureIdParam { get; }` | `ParameterTypeId.BuilidingPadStructureIdParam` | ForgeTypeId |
| `ForgeTypeId CabletrayMinbendmultiplierParam { get; }` | `ParameterTypeId.CabletrayMinbendmultiplierParam` | ForgeTypeId |
| `ForgeTypeId CalloutAttrHeadTag { get; }` | `ParameterTypeId.CalloutAttrHeadTag` | ForgeTypeId |
| `ForgeTypeId CalloutCornerSheetRadius { get; }` | `ParameterTypeId.CalloutCornerSheetRadius` | ForgeTypeId |
| `ForgeTypeId CalloutSyncronizeBoundOffsetFar { get; }` | `ParameterTypeId.CalloutSyncronizeBoundOffsetFar` | ForgeTypeId |
| `ForgeTypeId CalloutTag { get; }` | `ParameterTypeId.CalloutTag` | ForgeTypeId |
| `ForgeTypeId CeilingAttrDefaultHeightParam { get; }` | `ParameterTypeId.CeilingAttrDefaultHeightParam` | ForgeTypeId |
| `ForgeTypeId CeilingAttrPatternParam { get; }` | `ParameterTypeId.CeilingAttrPatternParam` | ForgeTypeId |
| `ForgeTypeId CeilingAttrSpacing1Param { get; }` | `ParameterTypeId.CeilingAttrSpacing1Param` | ForgeTypeId |
| `ForgeTypeId CeilingAttrSpacing2Param { get; }` | `ParameterTypeId.CeilingAttrSpacing2Param` | ForgeTypeId |
| `ForgeTypeId CeilingAttrSystemnameParam { get; }` | `ParameterTypeId.CeilingAttrSystemnameParam` | ForgeTypeId |
| `ForgeTypeId CeilingHasThicknessParam { get; }` | `ParameterTypeId.CeilingHasThicknessParam` | ForgeTypeId |
| `ForgeTypeId CeilingHeightabovelevelParam { get; }` | `ParameterTypeId.CeilingHeightabovelevelParam` | ForgeTypeId |
| `ForgeTypeId CeilingStructureIdParam { get; }` | `ParameterTypeId.CeilingStructureIdParam` | ForgeTypeId |
| `ForgeTypeId CeilingThickness { get; }` | `ParameterTypeId.CeilingThickness` | ForgeTypeId |
| `ForgeTypeId CeilingThicknessParam { get; }` | `ParameterTypeId.CeilingThicknessParam` | ForgeTypeId |
| `ForgeTypeId CenterMarkSize { get; }` | `ParameterTypeId.CenterMarkSize` | ForgeTypeId |
| `ForgeTypeId CircMullionRadius { get; }` | `ParameterTypeId.CircMullionRadius` | ForgeTypeId |
| `ForgeTypeId CircuitLoadClassificationAbbreviationParam { get; }` | `ParameterTypeId.CircuitLoadClassificationAbbreviationParam` | ForgeTypeId |
| `ForgeTypeId CircuitLoadClassificationParam { get; }` | `ParameterTypeId.CircuitLoadClassificationParam` | ForgeTypeId |
| `ForgeTypeId CircuitPhaseParam { get; }` | `ParameterTypeId.CircuitPhaseParam` | ForgeTypeId |
| `ForgeTypeId CircuitWaysParam { get; }` | `ParameterTypeId.CircuitWaysParam` | ForgeTypeId |
| `ForgeTypeId CircularFramingDiameter { get; }` | `ParameterTypeId.CircularFramingDiameter` | ForgeTypeId |
| `ForgeTypeId ClearCover { get; }` | `ParameterTypeId.ClearCover` | ForgeTypeId |
| `ForgeTypeId ClearCoverBottom { get; }` | `ParameterTypeId.ClearCoverBottom` | ForgeTypeId |
| `ForgeTypeId ClearCoverExterior { get; }` | `ParameterTypeId.ClearCoverExterior` | ForgeTypeId |
| `ForgeTypeId ClearCoverInterior { get; }` | `ParameterTypeId.ClearCoverInterior` | ForgeTypeId |
| `ForgeTypeId ClearCoverOther { get; }` | `ParameterTypeId.ClearCoverOther` | ForgeTypeId |
| `ForgeTypeId ClearCoverTop { get; }` | `ParameterTypeId.ClearCoverTop` | ForgeTypeId |
| `ForgeTypeId ClientName { get; }` | `ParameterTypeId.ClientName` | ForgeTypeId |
| `ForgeTypeId ClineSubcategory { get; }` | `ParameterTypeId.ClineSubcategory` | ForgeTypeId |
| `ForgeTypeId CoarseScaleFillPatternColor { get; }` | `ParameterTypeId.CoarseScaleFillPatternColor` | ForgeTypeId |
| `ForgeTypeId CoarseScaleFillPatternIdParam { get; }` | `ParameterTypeId.CoarseScaleFillPatternIdParam` | ForgeTypeId |
| `ForgeTypeId ColorFillFilteredParam { get; }` | `ParameterTypeId.ColorFillFilteredParam` | ForgeTypeId |
| `ForgeTypeId ColorFillSwatchHeightParam { get; }` | `ParameterTypeId.ColorFillSwatchHeightParam` | ForgeTypeId |
| `ForgeTypeId ColorFillSwatchWidthParam { get; }` | `ParameterTypeId.ColorFillSwatchWidthParam` | ForgeTypeId |
| `ForgeTypeId ColorSchemeLocation { get; }` | `ParameterTypeId.ColorSchemeLocation` | ForgeTypeId |
| `ForgeTypeId ColumnBaseAttachCutParam { get; }` | `ParameterTypeId.ColumnBaseAttachCutParam` | ForgeTypeId |
| `ForgeTypeId ColumnBaseAttachedParam { get; }` | `ParameterTypeId.ColumnBaseAttachedParam` | ForgeTypeId |
| `ForgeTypeId ColumnBaseAttachJustificationParam { get; }` | `ParameterTypeId.ColumnBaseAttachJustificationParam` | ForgeTypeId |
| `ForgeTypeId ColumnBaseAttachmentOffsetParam { get; }` | `ParameterTypeId.ColumnBaseAttachmentOffsetParam` | ForgeTypeId |
| `ForgeTypeId ColumnLocationMark { get; }` | `ParameterTypeId.ColumnLocationMark` | ForgeTypeId |
| `ForgeTypeId ColumnTopAttachCutParam { get; }` | `ParameterTypeId.ColumnTopAttachCutParam` | ForgeTypeId |
| `ForgeTypeId ColumnTopAttachedParam { get; }` | `ParameterTypeId.ColumnTopAttachedParam` | ForgeTypeId |
| `ForgeTypeId ColumnTopAttachJustificationParam { get; }` | `ParameterTypeId.ColumnTopAttachJustificationParam` | ForgeTypeId |
| `ForgeTypeId ColumnTopAttachmentOffsetParam { get; }` | `ParameterTypeId.ColumnTopAttachmentOffsetParam` | ForgeTypeId |
| `ForgeTypeId ConceptualConstructionMaterial { get; }` | `ParameterTypeId.ConceptualConstructionMaterial` | ForgeTypeId |
| `ForgeTypeId ConduitStandardTypeParam { get; }` | `ParameterTypeId.ConduitStandardTypeParam` | ForgeTypeId |
| `ForgeTypeId ConnectorAngle { get; }` | `ParameterTypeId.ConnectorAngle` | ForgeTypeId |
| `ForgeTypeId ConnectorAngleOfDeflection { get; }` | `ParameterTypeId.ConnectorAngleOfDeflection` | ForgeTypeId |
| `ForgeTypeId ConnectorDiameter { get; }` | `ParameterTypeId.ConnectorDiameter` | ForgeTypeId |
| `ForgeTypeId ConnectorEngagementLength { get; }` | `ParameterTypeId.ConnectorEngagementLength` | ForgeTypeId |
| `ForgeTypeId ConnectorGenderType { get; }` | `ParameterTypeId.ConnectorGenderType` | ForgeTypeId |
| `ForgeTypeId ConnectorHeight { get; }` | `ParameterTypeId.ConnectorHeight` | ForgeTypeId |
| `ForgeTypeId ConnectorIndex { get; }` | `ParameterTypeId.ConnectorIndex` | ForgeTypeId |
| `ForgeTypeId ConnectorInsideDiameter { get; }` | `ParameterTypeId.ConnectorInsideDiameter` | ForgeTypeId |
| `ForgeTypeId ConnectorJointType { get; }` | `ParameterTypeId.ConnectorJointType` | ForgeTypeId |
| `ForgeTypeId ConnectorLength { get; }` | `ParameterTypeId.ConnectorLength` | ForgeTypeId |
| `ForgeTypeId ConnectorProfileType { get; }` | `ParameterTypeId.ConnectorProfileType` | ForgeTypeId |
| `ForgeTypeId ConnectorRadius { get; }` | `ParameterTypeId.ConnectorRadius` | ForgeTypeId |
| `ForgeTypeId ConnectorReferenceIndex { get; }` | `ParameterTypeId.ConnectorReferenceIndex` | ForgeTypeId |
| `ForgeTypeId ConnectorUtilityParam { get; }` | `ParameterTypeId.ConnectorUtilityParam` | ForgeTypeId |
| `ForgeTypeId ConnectorVisibleSize { get; }` | `ParameterTypeId.ConnectorVisibleSize` | ForgeTypeId |
| `ForgeTypeId ConnectorWidth { get; }` | `ParameterTypeId.ConnectorWidth` | ForgeTypeId |
| `ForgeTypeId ConstructionIsSchematic { get; }` | `ParameterTypeId.ConstructionIsSchematic` | ForgeTypeId |
| `ForgeTypeId ConstructionName { get; }` | `ParameterTypeId.ConstructionName` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingBearingWidth { get; }` | `ParameterTypeId.ContinuousFootingBearingWidth` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingBottomHeel { get; }` | `ParameterTypeId.ContinuousFootingBottomHeel` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingBottomToe { get; }` | `ParameterTypeId.ContinuousFootingBottomToe` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingBreakAtInsertsDisable { get; }` | `ParameterTypeId.ContinuousFootingBreakAtInsertsDisable` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingDefaultEndExtensionLength { get; }` | `ParameterTypeId.ContinuousFootingDefaultEndExtensionLength` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingEccentricity { get; }` | `ParameterTypeId.ContinuousFootingEccentricity` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingLength { get; }` | `ParameterTypeId.ContinuousFootingLength` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingStructuralUsage { get; }` | `ParameterTypeId.ContinuousFootingStructuralUsage` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingTopHeel { get; }` | `ParameterTypeId.ContinuousFootingTopHeel` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingTopToe { get; }` | `ParameterTypeId.ContinuousFootingTopToe` | ForgeTypeId |
| `ForgeTypeId ContinuousFootingWidth { get; }` | `ParameterTypeId.ContinuousFootingWidth` | ForgeTypeId |
| `ForgeTypeId ContinuousrailBeginningTerminationAttachmentParam { get; }` | `ParameterTypeId.ContinuousrailBeginningTerminationAttachmentParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailBeginningTerminationTypeParam { get; }` | `ParameterTypeId.ContinuousrailBeginningTerminationTypeParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailDefaultJoinTypeParam { get; }` | `ParameterTypeId.ContinuousrailDefaultJoinTypeParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailEndExtensionLengthParam { get; }` | `ParameterTypeId.ContinuousrailEndExtensionLengthParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailEndTerminationAttachmentParam { get; }` | `ParameterTypeId.ContinuousrailEndTerminationAttachmentParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailEndTerminationTypeParam { get; }` | `ParameterTypeId.ContinuousrailEndTerminationTypeParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailExtensionLengthParam { get; }` | `ParameterTypeId.ContinuousrailExtensionLengthParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailFilletRadiusParam { get; }` | `ParameterTypeId.ContinuousrailFilletRadiusParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailJoinTypeParam { get; }` | `ParameterTypeId.ContinuousrailJoinTypeParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailLengthParam { get; }` | `ParameterTypeId.ContinuousrailLengthParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailMaterialsParam { get; }` | `ParameterTypeId.ContinuousrailMaterialsParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailPlusTreadDepthParam { get; }` | `ParameterTypeId.ContinuousrailPlusTreadDepthParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailProfileTypeParam { get; }` | `ParameterTypeId.ContinuousrailProfileTypeParam` | ForgeTypeId |
| `ForgeTypeId ContinuousrailTransitionTypeParam { get; }` | `ParameterTypeId.ContinuousrailTransitionTypeParam` | ForgeTypeId |
| `ForgeTypeId ContourElevation { get; }` | `ParameterTypeId.ContourElevation` | ForgeTypeId |
| `ForgeTypeId ContourElevationStep { get; }` | `ParameterTypeId.ContourElevationStep` | ForgeTypeId |
| `ForgeTypeId ContourLabelsElevBaseType { get; }` | `ParameterTypeId.ContourLabelsElevBaseType` | ForgeTypeId |
| `ForgeTypeId ContourLabelsLinearUnits { get; }` | `ParameterTypeId.ContourLabelsLinearUnits` | ForgeTypeId |
| `ForgeTypeId ContourLabelsPrimaryOnly { get; }` | `ParameterTypeId.ContourLabelsPrimaryOnly` | ForgeTypeId |
| `ForgeTypeId ContourLabelsRelativeBase { get; }` | `ParameterTypeId.ContourLabelsRelativeBase` | ForgeTypeId |
| `ForgeTypeId CouplerCode { get; }` | `ParameterTypeId.CouplerCode` | ForgeTypeId |
| `ForgeTypeId CouplerCoupledBarSize { get; }` | `ParameterTypeId.CouplerCoupledBarSize` | ForgeTypeId |
| `ForgeTypeId CouplerCoupledEndtreatment { get; }` | `ParameterTypeId.CouplerCoupledEndtreatment` | ForgeTypeId |
| `ForgeTypeId CouplerCoupledEngagement { get; }` | `ParameterTypeId.CouplerCoupledEngagement` | ForgeTypeId |
| `ForgeTypeId CouplerLength { get; }` | `ParameterTypeId.CouplerLength` | ForgeTypeId |
| `ForgeTypeId CouplerMainBarSize { get; }` | `ParameterTypeId.CouplerMainBarSize` | ForgeTypeId |
| `ForgeTypeId CouplerMainEndtreatment { get; }` | `ParameterTypeId.CouplerMainEndtreatment` | ForgeTypeId |
| `ForgeTypeId CouplerMainEngagement { get; }` | `ParameterTypeId.CouplerMainEngagement` | ForgeTypeId |
| `ForgeTypeId CouplerMark { get; }` | `ParameterTypeId.CouplerMark` | ForgeTypeId |
| `ForgeTypeId CouplerNumber { get; }` | `ParameterTypeId.CouplerNumber` | ForgeTypeId |
| `ForgeTypeId CouplerQuantity { get; }` | `ParameterTypeId.CouplerQuantity` | ForgeTypeId |
| `ForgeTypeId CouplerRotationAngle { get; }` | `ParameterTypeId.CouplerRotationAngle` | ForgeTypeId |
| `ForgeTypeId CouplerWeight { get; }` | `ParameterTypeId.CouplerWeight` | ForgeTypeId |
| `ForgeTypeId CouplerWidth { get; }` | `ParameterTypeId.CouplerWidth` | ForgeTypeId |
| `ForgeTypeId CoverTypeLength { get; }` | `ParameterTypeId.CoverTypeLength` | ForgeTypeId |
| `ForgeTypeId CoverTypeName { get; }` | `ParameterTypeId.CoverTypeName` | ForgeTypeId |
| `ForgeTypeId CurtaingridAdjustBorderHoriz { get; }` | `ParameterTypeId.CurtaingridAdjustBorderHoriz` | ForgeTypeId |
| `ForgeTypeId CurtaingridAdjustBordern1 { get; }` | `ParameterTypeId.CurtaingridAdjustBordern1` | ForgeTypeId |
| `ForgeTypeId CurtaingridAdjustBordern2 { get; }` | `ParameterTypeId.CurtaingridAdjustBordern2` | ForgeTypeId |
| `ForgeTypeId CurtaingridAdjustBorderU { get; }` | `ParameterTypeId.CurtaingridAdjustBorderU` | ForgeTypeId |
| `ForgeTypeId CurtaingridAdjustBorderV { get; }` | `ParameterTypeId.CurtaingridAdjustBorderV` | ForgeTypeId |
| `ForgeTypeId CurtaingridAdjustBorderVert { get; }` | `ParameterTypeId.CurtaingridAdjustBorderVert` | ForgeTypeId |
| `ForgeTypeId CurtaingridAngleHoriz { get; }` | `ParameterTypeId.CurtaingridAngleHoriz` | ForgeTypeId |
| `ForgeTypeId CurtaingridAnglen1 { get; }` | `ParameterTypeId.CurtaingridAnglen1` | ForgeTypeId |
| `ForgeTypeId CurtaingridAnglen2 { get; }` | `ParameterTypeId.CurtaingridAnglen2` | ForgeTypeId |
| `ForgeTypeId CurtaingridAngleU { get; }` | `ParameterTypeId.CurtaingridAngleU` | ForgeTypeId |
| `ForgeTypeId CurtaingridAngleV { get; }` | `ParameterTypeId.CurtaingridAngleV` | ForgeTypeId |
| `ForgeTypeId CurtaingridAngleVert { get; }` | `ParameterTypeId.CurtaingridAngleVert` | ForgeTypeId |
| `ForgeTypeId CurtainGridBaseOrientation { get; }` | `ParameterTypeId.CurtainGridBaseOrientation` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltHoriz { get; }` | `ParameterTypeId.CurtaingridBeltHoriz` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltn1 { get; }` | `ParameterTypeId.CurtaingridBeltn1` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltn2 { get; }` | `ParameterTypeId.CurtaingridBeltn2` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltRation1 { get; }` | `ParameterTypeId.CurtaingridBeltRation1` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltRation2 { get; }` | `ParameterTypeId.CurtaingridBeltRation2` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltRatioU { get; }` | `ParameterTypeId.CurtaingridBeltRatioU` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltRatioV { get; }` | `ParameterTypeId.CurtaingridBeltRatioV` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltU { get; }` | `ParameterTypeId.CurtaingridBeltU` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltV { get; }` | `ParameterTypeId.CurtaingridBeltV` | ForgeTypeId |
| `ForgeTypeId CurtaingridBeltVert { get; }` | `ParameterTypeId.CurtaingridBeltVert` | ForgeTypeId |
| `ForgeTypeId CurtaingridOriginHoriz { get; }` | `ParameterTypeId.CurtaingridOriginHoriz` | ForgeTypeId |
| `ForgeTypeId CurtaingridOriginn1 { get; }` | `ParameterTypeId.CurtaingridOriginn1` | ForgeTypeId |
| `ForgeTypeId CurtaingridOriginn2 { get; }` | `ParameterTypeId.CurtaingridOriginn2` | ForgeTypeId |
| `ForgeTypeId CurtaingridOriginU { get; }` | `ParameterTypeId.CurtaingridOriginU` | ForgeTypeId |
| `ForgeTypeId CurtaingridOriginV { get; }` | `ParameterTypeId.CurtaingridOriginV` | ForgeTypeId |
| `ForgeTypeId CurtaingridOriginVert { get; }` | `ParameterTypeId.CurtaingridOriginVert` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDist { get; }` | `ParameterTypeId.CurtaingridUseCurveDist` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDistHoriz { get; }` | `ParameterTypeId.CurtaingridUseCurveDistHoriz` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDistn1 { get; }` | `ParameterTypeId.CurtaingridUseCurveDistn1` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDistn2 { get; }` | `ParameterTypeId.CurtaingridUseCurveDistn2` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDistU { get; }` | `ParameterTypeId.CurtaingridUseCurveDistU` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDistV { get; }` | `ParameterTypeId.CurtaingridUseCurveDistV` | ForgeTypeId |
| `ForgeTypeId CurtaingridUseCurveDistVert { get; }` | `ParameterTypeId.CurtaingridUseCurveDistVert` | ForgeTypeId |
| `ForgeTypeId CurtainVersionParam { get; }` | `ParameterTypeId.CurtainVersionParam` | ForgeTypeId |
| `ForgeTypeId CurtainWallPanelHostId { get; }` | `ParameterTypeId.CurtainWallPanelHostId` | ForgeTypeId |
| `ForgeTypeId CurtainWallPanelsHeight { get; }` | `ParameterTypeId.CurtainWallPanelsHeight` | ForgeTypeId |
| `ForgeTypeId CurtainWallPanelsWidth { get; }` | `ParameterTypeId.CurtainWallPanelsWidth` | ForgeTypeId |
| `ForgeTypeId CurtainWallSyspanelOffset { get; }` | `ParameterTypeId.CurtainWallSyspanelOffset` | ForgeTypeId |
| `ForgeTypeId CurtainWallSyspanelThickness { get; }` | `ParameterTypeId.CurtainWallSyspanelThickness` | ForgeTypeId |
| `ForgeTypeId CurveBottomLevel { get; }` | `ParameterTypeId.CurveBottomLevel` | ForgeTypeId |
| `ForgeTypeId CurveByPointsProjectionType { get; }` | `ParameterTypeId.CurveByPointsProjectionType` | ForgeTypeId |
| `ForgeTypeId CurveDeterminesOrientation { get; }` | `ParameterTypeId.CurveDeterminesOrientation` | ForgeTypeId |
| `ForgeTypeId CurveEdgeOffset { get; }` | `ParameterTypeId.CurveEdgeOffset` | ForgeTypeId |
| `ForgeTypeId CurveElemArcEndAngle { get; }` | `ParameterTypeId.CurveElemArcEndAngle` | ForgeTypeId |
| `ForgeTypeId CurveElemArcRadius { get; }` | `ParameterTypeId.CurveElemArcRadius` | ForgeTypeId |
| `ForgeTypeId CurveElemArcRange { get; }` | `ParameterTypeId.CurveElemArcRange` | ForgeTypeId |
| `ForgeTypeId CurveElemArcStartAngle { get; }` | `ParameterTypeId.CurveElemArcStartAngle` | ForgeTypeId |
| `ForgeTypeId CurveElemDefinesSlope { get; }` | `ParameterTypeId.CurveElemDefinesSlope` | ForgeTypeId |
| `ForgeTypeId CurveElemLength { get; }` | `ParameterTypeId.CurveElemLength` | ForgeTypeId |
| `ForgeTypeId CurveElemLineAngle { get; }` | `ParameterTypeId.CurveElemLineAngle` | ForgeTypeId |
| `ForgeTypeId CurveHeightOffset { get; }` | `ParameterTypeId.CurveHeightOffset` | ForgeTypeId |
| `ForgeTypeId CurveIsDetail { get; }` | `ParameterTypeId.CurveIsDetail` | ForgeTypeId |
| `ForgeTypeId CurveIsFilled { get; }` | `ParameterTypeId.CurveIsFilled` | ForgeTypeId |
| `ForgeTypeId CurveIsMultilevel { get; }` | `ParameterTypeId.CurveIsMultilevel` | ForgeTypeId |
| `ForgeTypeId CurveIsReferenceLine { get; }` | `ParameterTypeId.CurveIsReferenceLine` | ForgeTypeId |
| `ForgeTypeId CurveIsSlopeDefining { get; }` | `ParameterTypeId.CurveIsSlopeDefining` | ForgeTypeId |
| `ForgeTypeId CurveLevel { get; }` | `ParameterTypeId.CurveLevel` | ForgeTypeId |
| `ForgeTypeId CurveNumberOfSegments { get; }` | `ParameterTypeId.CurveNumberOfSegments` | ForgeTypeId |
| `ForgeTypeId CurveParamConcreteCantilever { get; }` | `ParameterTypeId.CurveParamConcreteCantilever` | ForgeTypeId |
| `ForgeTypeId CurveParamSteelCantilever { get; }` | `ParameterTypeId.CurveParamSteelCantilever` | ForgeTypeId |
| `ForgeTypeId CurveSupportOffset { get; }` | `ParameterTypeId.CurveSupportOffset` | ForgeTypeId |
| `ForgeTypeId CurveTopLevel { get; }` | `ParameterTypeId.CurveTopLevel` | ForgeTypeId |
| `ForgeTypeId CurveVisibilityParam { get; }` | `ParameterTypeId.CurveVisibilityParam` | ForgeTypeId |
| `ForgeTypeId CurveWallOffset { get; }` | `ParameterTypeId.CurveWallOffset` | ForgeTypeId |
| `ForgeTypeId CurveWallOffsetRoofs { get; }` | `ParameterTypeId.CurveWallOffsetRoofs` | ForgeTypeId |
| `ForgeTypeId CustMullionThick { get; }` | `ParameterTypeId.CustMullionThick` | ForgeTypeId |
| `ForgeTypeId CustMullionWidth1 { get; }` | `ParameterTypeId.CustMullionWidth1` | ForgeTypeId |
| `ForgeTypeId CustMullionWidth2 { get; }` | `ParameterTypeId.CustMullionWidth2` | ForgeTypeId |
| `ForgeTypeId CutLineAngle { get; }` | `ParameterTypeId.CutLineAngle` | ForgeTypeId |
| `ForgeTypeId CutLineDistance { get; }` | `ParameterTypeId.CutLineDistance` | ForgeTypeId |
| `ForgeTypeId CutLineExtension { get; }` | `ParameterTypeId.CutLineExtension` | ForgeTypeId |
| `ForgeTypeId CutLineType { get; }` | `ParameterTypeId.CutLineType` | ForgeTypeId |
| `ForgeTypeId CutMarkSymbol { get; }` | `ParameterTypeId.CutMarkSymbol` | ForgeTypeId |
| `ForgeTypeId CutMarkSymbolSize { get; }` | `ParameterTypeId.CutMarkSymbolSize` | ForgeTypeId |
| `ForgeTypeId CwpAddGridPrefix { get; }` | `ParameterTypeId.CwpAddGridPrefix` | ForgeTypeId |
| `ForgeTypeId CwpAddGridSuffix { get; }` | `ParameterTypeId.CwpAddGridSuffix` | ForgeTypeId |
| `ForgeTypeId CwpAddLevelPrefix { get; }` | `ParameterTypeId.CwpAddLevelPrefix` | ForgeTypeId |
| `ForgeTypeId CwpAddLevelSuffix { get; }` | `ParameterTypeId.CwpAddLevelSuffix` | ForgeTypeId |
| `ForgeTypeId CwpCopyFloorInserts { get; }` | `ParameterTypeId.CwpCopyFloorInserts` | ForgeTypeId |
| `ForgeTypeId CwpCopyRoofInserts { get; }` | `ParameterTypeId.CwpCopyRoofInserts` | ForgeTypeId |
| `ForgeTypeId CwpCopyWallInserts { get; }` | `ParameterTypeId.CwpCopyWallInserts` | ForgeTypeId |
| `ForgeTypeId CwpLevelOffset { get; }` | `ParameterTypeId.CwpLevelOffset` | ForgeTypeId |
| `ForgeTypeId CwpLinkedRoomParams { get; }` | `ParameterTypeId.CwpLinkedRoomParams` | ForgeTypeId |
| `ForgeTypeId CwpLinkedRoomPhases { get; }` | `ParameterTypeId.CwpLinkedRoomPhases` | ForgeTypeId |
| `ForgeTypeId CwpReuseExistingGrids { get; }` | `ParameterTypeId.CwpReuseExistingGrids` | ForgeTypeId |
| `ForgeTypeId CwpReuseExistingLevels { get; }` | `ParameterTypeId.CwpReuseExistingLevels` | ForgeTypeId |
| `ForgeTypeId CwpReuseGridsSameName { get; }` | `ParameterTypeId.CwpReuseGridsSameName` | ForgeTypeId |
| `ForgeTypeId CwpReuseLevelsSameName { get; }` | `ParameterTypeId.CwpReuseLevelsSameName` | ForgeTypeId |
| `ForgeTypeId CwpSplitColumnsAtLevels { get; }` | `ParameterTypeId.CwpSplitColumnsAtLevels` | ForgeTypeId |
| `ForgeTypeId DatumBubbleEndn1 { get; }` | `ParameterTypeId.DatumBubbleEndn1` | ForgeTypeId |
| `ForgeTypeId DatumBubbleEndn2 { get; }` | `ParameterTypeId.DatumBubbleEndn2` | ForgeTypeId |
| `ForgeTypeId DatumBubbleLocationInElev { get; }` | `ParameterTypeId.DatumBubbleLocationInElev` | ForgeTypeId |
| `ForgeTypeId DatumPlaneDefinesOrigin { get; }` | `ParameterTypeId.DatumPlaneDefinesOrigin` | ForgeTypeId |
| `ForgeTypeId DatumPlaneDefinesWallClosure { get; }` | `ParameterTypeId.DatumPlaneDefinesWallClosure` | ForgeTypeId |
| `ForgeTypeId DatumText { get; }` | `ParameterTypeId.DatumText` | ForgeTypeId |
| `ForgeTypeId DatumVolumeOfInterest { get; }` | `ParameterTypeId.DatumVolumeOfInterest` | ForgeTypeId |
| `ForgeTypeId DecalAttributes { get; }` | `ParameterTypeId.DecalAttributes` | ForgeTypeId |
| `ForgeTypeId DecalHeight { get; }` | `ParameterTypeId.DecalHeight` | ForgeTypeId |
| `ForgeTypeId DecalLockProportions { get; }` | `ParameterTypeId.DecalLockProportions` | ForgeTypeId |
| `ForgeTypeId DecalSubcategoryId { get; }` | `ParameterTypeId.DecalSubcategoryId` | ForgeTypeId |
| `ForgeTypeId DecalWidth { get; }` | `ParameterTypeId.DecalWidth` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionExtWallUnderground { get; }` | `ParameterTypeId.DefaultConstructionExtWallUnderground` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassExteriorWall { get; }` | `ParameterTypeId.DefaultConstructionMassExteriorWall` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassFloor { get; }` | `ParameterTypeId.DefaultConstructionMassFloor` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassGlazing { get; }` | `ParameterTypeId.DefaultConstructionMassGlazing` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassInteriorWall { get; }` | `ParameterTypeId.DefaultConstructionMassInteriorWall` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassOpening { get; }` | `ParameterTypeId.DefaultConstructionMassOpening` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassRoof { get; }` | `ParameterTypeId.DefaultConstructionMassRoof` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassShade { get; }` | `ParameterTypeId.DefaultConstructionMassShade` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassSkylight { get; }` | `ParameterTypeId.DefaultConstructionMassSkylight` | ForgeTypeId |
| `ForgeTypeId DefaultConstructionMassSlab { get; }` | `ParameterTypeId.DefaultConstructionMassSlab` | ForgeTypeId |
| `ForgeTypeId DefaultViewTemplate { get; }` | `ParameterTypeId.DefaultViewTemplate` | ForgeTypeId |
| `ForgeTypeId DefinesConstantHeight { get; }` | `ParameterTypeId.DefinesConstantHeight` | ForgeTypeId |
| `ForgeTypeId DesignOptionId { get; }` | `ParameterTypeId.DesignOptionId` | ForgeTypeId |
| `ForgeTypeId DesignOptionParam { get; }` | `ParameterTypeId.DesignOptionParam` | ForgeTypeId |
| `ForgeTypeId DiameterSymbolLocation { get; }` | `ParameterTypeId.DiameterSymbolLocation` | ForgeTypeId |
| `ForgeTypeId DiameterSymbolText { get; }` | `ParameterTypeId.DiameterSymbolText` | ForgeTypeId |
| `ForgeTypeId DimDisplayEq { get; }` | `ParameterTypeId.DimDisplayEq` | ForgeTypeId |
| `ForgeTypeId DimIsreporting { get; }` | `ParameterTypeId.DimIsreporting` | ForgeTypeId |
| `ForgeTypeId DimLabel { get; }` | `ParameterTypeId.DimLabel` | ForgeTypeId |
| `ForgeTypeId DimLabelGpShow { get; }` | `ParameterTypeId.DimLabelGpShow` | ForgeTypeId |
| `ForgeTypeId DimLabelIsInstance { get; }` | `ParameterTypeId.DimLabelIsInstance` | ForgeTypeId |
| `ForgeTypeId DimLeader { get; }` | `ParameterTypeId.DimLeader` | ForgeTypeId |
| `ForgeTypeId DimLeaderArrowhead { get; }` | `ParameterTypeId.DimLeaderArrowhead` | ForgeTypeId |
| `ForgeTypeId DimLeaderDisplayCondition { get; }` | `ParameterTypeId.DimLeaderDisplayCondition` | ForgeTypeId |
| `ForgeTypeId DimLeaderShoulderLength { get; }` | `ParameterTypeId.DimLeaderShoulderLength` | ForgeTypeId |
| `ForgeTypeId DimLeaderType { get; }` | `ParameterTypeId.DimLeaderType` | ForgeTypeId |
| `ForgeTypeId DimLineExtension { get; }` | `ParameterTypeId.DimLineExtension` | ForgeTypeId |
| `ForgeTypeId DimNotModifiable { get; }` | `ParameterTypeId.DimNotModifiable` | ForgeTypeId |
| `ForgeTypeId DimPrefix { get; }` | `ParameterTypeId.DimPrefix` | ForgeTypeId |
| `ForgeTypeId DimReferenceCount { get; }` | `ParameterTypeId.DimReferenceCount` | ForgeTypeId |
| `ForgeTypeId DimStyleAngularUnits { get; }` | `ParameterTypeId.DimStyleAngularUnits` | ForgeTypeId |
| `ForgeTypeId DimStyleAngularUnitsAlt { get; }` | `ParameterTypeId.DimStyleAngularUnitsAlt` | ForgeTypeId |
| `ForgeTypeId DimStyleCenterlinePattern { get; }` | `ParameterTypeId.DimStyleCenterlinePattern` | ForgeTypeId |
| `ForgeTypeId DimStyleCenterlineSymbol { get; }` | `ParameterTypeId.DimStyleCenterlineSymbol` | ForgeTypeId |
| `ForgeTypeId DimStyleCenterlineTickMark { get; }` | `ParameterTypeId.DimStyleCenterlineTickMark` | ForgeTypeId |
| `ForgeTypeId DimStyleDimLineSnapDist { get; }` | `ParameterTypeId.DimStyleDimLineSnapDist` | ForgeTypeId |
| `ForgeTypeId DimStyleFlippedDimLineExtension { get; }` | `ParameterTypeId.DimStyleFlippedDimLineExtension` | ForgeTypeId |
| `ForgeTypeId DimStyleInteriorTickMark { get; }` | `ParameterTypeId.DimStyleInteriorTickMark` | ForgeTypeId |
| `ForgeTypeId DimStyleLeaderTickMark { get; }` | `ParameterTypeId.DimStyleLeaderTickMark` | ForgeTypeId |
| `ForgeTypeId DimStyleLinearUnits { get; }` | `ParameterTypeId.DimStyleLinearUnits` | ForgeTypeId |
| `ForgeTypeId DimStyleLinearUnitsAlt { get; }` | `ParameterTypeId.DimStyleLinearUnitsAlt` | ForgeTypeId |
| `ForgeTypeId DimStyleReadConvention { get; }` | `ParameterTypeId.DimStyleReadConvention` | ForgeTypeId |
| `ForgeTypeId DimStyleShowOpeningHt { get; }` | `ParameterTypeId.DimStyleShowOpeningHt` | ForgeTypeId |
| `ForgeTypeId DimStyleSuppressSpaces { get; }` | `ParameterTypeId.DimStyleSuppressSpaces` | ForgeTypeId |
| `ForgeTypeId DimSuffix { get; }` | `ParameterTypeId.DimSuffix` | ForgeTypeId |
| `ForgeTypeId DimTextBackground { get; }` | `ParameterTypeId.DimTextBackground` | ForgeTypeId |
| `ForgeTypeId DimTextLocationForLeader { get; }` | `ParameterTypeId.DimTextLocationForLeader` | ForgeTypeId |
| `ForgeTypeId DimToInserts { get; }` | `ParameterTypeId.DimToInserts` | ForgeTypeId |
| `ForgeTypeId DimToInsertType { get; }` | `ParameterTypeId.DimToInsertType` | ForgeTypeId |
| `ForgeTypeId DimToIntersectingGrids { get; }` | `ParameterTypeId.DimToIntersectingGrids` | ForgeTypeId |
| `ForgeTypeId DimToIntersectingWalls { get; }` | `ParameterTypeId.DimToIntersectingWalls` | ForgeTypeId |
| `ForgeTypeId DimTotalLength { get; }` | `ParameterTypeId.DimTotalLength` | ForgeTypeId |
| `ForgeTypeId DimValueAngle { get; }` | `ParameterTypeId.DimValueAngle` | ForgeTypeId |
| `ForgeTypeId DimValueLength { get; }` | `ParameterTypeId.DimValueLength` | ForgeTypeId |
| `ForgeTypeId DimWitnsLineCntrl { get; }` | `ParameterTypeId.DimWitnsLineCntrl` | ForgeTypeId |
| `ForgeTypeId DimWitnsLineExtensionBelow { get; }` | `ParameterTypeId.DimWitnsLineExtensionBelow` | ForgeTypeId |
| `ForgeTypeId Directcontext3dApplicationId { get; }` | `ParameterTypeId.Directcontext3dApplicationId` | ForgeTypeId |
| `ForgeTypeId Directcontext3dLoaded { get; }` | `ParameterTypeId.Directcontext3dLoaded` | ForgeTypeId |
| `ForgeTypeId Directcontext3dName { get; }` | `ParameterTypeId.Directcontext3dName` | ForgeTypeId |
| `ForgeTypeId Directcontext3dServerId { get; }` | `ParameterTypeId.Directcontext3dServerId` | ForgeTypeId |
| `ForgeTypeId Directcontext3dSourceId { get; }` | `ParameterTypeId.Directcontext3dSourceId` | ForgeTypeId |
| `ForgeTypeId DisplacedElementDisplacementX { get; }` | `ParameterTypeId.DisplacedElementDisplacementX` | ForgeTypeId |
| `ForgeTypeId DisplacedElementDisplacementY { get; }` | `ParameterTypeId.DisplacedElementDisplacementY` | ForgeTypeId |
| `ForgeTypeId DisplacedElementDisplacementZ { get; }` | `ParameterTypeId.DisplacedElementDisplacementZ` | ForgeTypeId |
| `ForgeTypeId DisplacementPathDepth { get; }` | `ParameterTypeId.DisplacementPathDepth` | ForgeTypeId |
| `ForgeTypeId DisplacementPathStyle { get; }` | `ParameterTypeId.DisplacementPathStyle` | ForgeTypeId |
| `ForgeTypeId DistanceToCutMark { get; }` | `ParameterTypeId.DistanceToCutMark` | ForgeTypeId |
| `ForgeTypeId DividedpathBeginningIndent { get; }` | `ParameterTypeId.DividedpathBeginningIndent` | ForgeTypeId |
| `ForgeTypeId DividedpathDisplayNodeNumbers { get; }` | `ParameterTypeId.DividedpathDisplayNodeNumbers` | ForgeTypeId |
| `ForgeTypeId DividedpathDisplayNodes { get; }` | `ParameterTypeId.DividedpathDisplayNodes` | ForgeTypeId |
| `ForgeTypeId DividedpathDisplayReferenceCurves { get; }` | `ParameterTypeId.DividedpathDisplayReferenceCurves` | ForgeTypeId |
| `ForgeTypeId DividedpathDistance { get; }` | `ParameterTypeId.DividedpathDistance` | ForgeTypeId |
| `ForgeTypeId DividedpathEndIndent { get; }` | `ParameterTypeId.DividedpathEndIndent` | ForgeTypeId |
| `ForgeTypeId DividedpathFlipDirection { get; }` | `ParameterTypeId.DividedpathFlipDirection` | ForgeTypeId |
| `ForgeTypeId DividedpathJustification { get; }` | `ParameterTypeId.DividedpathJustification` | ForgeTypeId |
| `ForgeTypeId DividedpathLayout { get; }` | `ParameterTypeId.DividedpathLayout` | ForgeTypeId |
| `ForgeTypeId DividedpathLayoutFixedNumPoint { get; }` | `ParameterTypeId.DividedpathLayoutFixedNumPoint` | ForgeTypeId |
| `ForgeTypeId DividedpathMaxDistance { get; }` | `ParameterTypeId.DividedpathMaxDistance` | ForgeTypeId |
| `ForgeTypeId DividedpathMeasurementType { get; }` | `ParameterTypeId.DividedpathMeasurementType` | ForgeTypeId |
| `ForgeTypeId DividedpathMergedPointNum { get; }` | `ParameterTypeId.DividedpathMergedPointNum` | ForgeTypeId |
| `ForgeTypeId DividedpathMinDistance { get; }` | `ParameterTypeId.DividedpathMinDistance` | ForgeTypeId |
| `ForgeTypeId DividedpathTotalPathLength { get; }` | `ParameterTypeId.DividedpathTotalPathLength` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceAllGridRotation { get; }` | `ParameterTypeId.DividedSurfaceAllGridRotation` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceAllPoints { get; }` | `ParameterTypeId.DividedSurfaceAllPoints` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceComponentTrimType { get; }` | `ParameterTypeId.DividedSurfaceComponentTrimType` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceCoverFaceCompletely { get; }` | `ParameterTypeId.DividedSurfaceCoverFaceCompletely` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayComponents { get; }` | `ParameterTypeId.DividedSurfaceDisplayComponents` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayDiscardeddivisionlines { get; }` | `ParameterTypeId.DividedSurfaceDisplayDiscardeddivisionlines` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayGridlines { get; }` | `ParameterTypeId.DividedSurfaceDisplayGridlines` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayNodes { get; }` | `ParameterTypeId.DividedSurfaceDisplayNodes` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayOriginalSurface { get; }` | `ParameterTypeId.DividedSurfaceDisplayOriginalSurface` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayPatternFill { get; }` | `ParameterTypeId.DividedSurfaceDisplayPatternFill` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplayPatternLines { get; }` | `ParameterTypeId.DividedSurfaceDisplayPatternLines` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceDisplaySurfaceOption { get; }` | `ParameterTypeId.DividedSurfaceDisplaySurfaceOption` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceEdgeNumber { get; }` | `ParameterTypeId.DividedSurfaceEdgeNumber` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceFacetNumber { get; }` | `ParameterTypeId.DividedSurfaceFacetNumber` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceGridlinesStyle { get; }` | `ParameterTypeId.DividedSurfaceGridlinesStyle` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceGridOptionParamn1 { get; }` | `ParameterTypeId.DividedSurfaceGridOptionParamn1` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceGridOptionParamn2 { get; }` | `ParameterTypeId.DividedSurfaceGridOptionParamn2` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceOffsetFromSurface { get; }` | `ParameterTypeId.DividedSurfaceOffsetFromSurface` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceOriginalSurfaceMaterial { get; }` | `ParameterTypeId.DividedSurfaceOriginalSurfaceMaterial` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePattern { get; }` | `ParameterTypeId.DividedSurfacePattern` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternFillMaterial { get; }` | `ParameterTypeId.DividedSurfacePatternFillMaterial` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternFlip { get; }` | `ParameterTypeId.DividedSurfacePatternFlip` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternIndentn1 { get; }` | `ParameterTypeId.DividedSurfacePatternIndentn1` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternIndentn2 { get; }` | `ParameterTypeId.DividedSurfacePatternIndentn2` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternLinesStyle { get; }` | `ParameterTypeId.DividedSurfacePatternLinesStyle` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternMirror { get; }` | `ParameterTypeId.DividedSurfacePatternMirror` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePatternRotationAngle { get; }` | `ParameterTypeId.DividedSurfacePatternRotationAngle` | ForgeTypeId |
| `ForgeTypeId DividedSurfacePointNumber { get; }` | `ParameterTypeId.DividedSurfacePointNumber` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceRule1Suspension { get; }` | `ParameterTypeId.DividedSurfaceRule1Suspension` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceRule2Suspension { get; }` | `ParameterTypeId.DividedSurfaceRule2Suspension` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceSurfaceArea { get; }` | `ParameterTypeId.DividedSurfaceSurfaceArea` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceTileBorder { get; }` | `ParameterTypeId.DividedSurfaceTileBorder` | ForgeTypeId |
| `ForgeTypeId DividedSurfaceTotalEdgeLength { get; }` | `ParameterTypeId.DividedSurfaceTotalEdgeLength` | ForgeTypeId |
| `ForgeTypeId DivisionPattern { get; }` | `ParameterTypeId.DivisionPattern` | ForgeTypeId |
| `ForgeTypeId DivisionProfileWidth { get; }` | `ParameterTypeId.DivisionProfileWidth` | ForgeTypeId |
| `ForgeTypeId DivisionRuleParam { get; }` | `ParameterTypeId.DivisionRuleParam` | ForgeTypeId |
| `ForgeTypeId DivisionSketchCurveDivisionParamsOverrideParam { get; }` | `ParameterTypeId.DivisionSketchCurveDivisionParamsOverrideParam` | ForgeTypeId |
| `ForgeTypeId DivisionSketchCurveExtentdToSilhParam { get; }` | `ParameterTypeId.DivisionSketchCurveExtentdToSilhParam` | ForgeTypeId |
| `ForgeTypeId DoorConstructionType { get; }` | `ParameterTypeId.DoorConstructionType` | ForgeTypeId |
| `ForgeTypeId DoorCost { get; }` | `ParameterTypeId.DoorCost` | ForgeTypeId |
| `ForgeTypeId DoorEvacuationExitType { get; }` | `ParameterTypeId.DoorEvacuationExitType` | ForgeTypeId |
| `ForgeTypeId DoorFinish { get; }` | `ParameterTypeId.DoorFinish` | ForgeTypeId |
| `ForgeTypeId DoorFrameMaterial { get; }` | `ParameterTypeId.DoorFrameMaterial` | ForgeTypeId |
| `ForgeTypeId DoorFrameType { get; }` | `ParameterTypeId.DoorFrameType` | ForgeTypeId |
| `ForgeTypeId DoorNumber { get; }` | `ParameterTypeId.DoorNumber` | ForgeTypeId |
| `ForgeTypeId DoorOperationType { get; }` | `ParameterTypeId.DoorOperationType` | ForgeTypeId |
| `ForgeTypeId DpartAreaComputed { get; }` | `ParameterTypeId.DpartAreaComputed` | ForgeTypeId |
| `ForgeTypeId DpartBaseLevel { get; }` | `ParameterTypeId.DpartBaseLevel` | ForgeTypeId |
| `ForgeTypeId DpartBaseLevelByOriginal { get; }` | `ParameterTypeId.DpartBaseLevelByOriginal` | ForgeTypeId |
| `ForgeTypeId DpartCanHostRebar { get; }` | `ParameterTypeId.DpartCanHostRebar` | ForgeTypeId |
| `ForgeTypeId DpartExcluded { get; }` | `ParameterTypeId.DpartExcluded` | ForgeTypeId |
| `ForgeTypeId DpartHeightComputed { get; }` | `ParameterTypeId.DpartHeightComputed` | ForgeTypeId |
| `ForgeTypeId DpartLayerConstruction { get; }` | `ParameterTypeId.DpartLayerConstruction` | ForgeTypeId |
| `ForgeTypeId DpartLayerFunction { get; }` | `ParameterTypeId.DpartLayerFunction` | ForgeTypeId |
| `ForgeTypeId DpartLayerIndex { get; }` | `ParameterTypeId.DpartLayerIndex` | ForgeTypeId |
| `ForgeTypeId DpartLayerWidth { get; }` | `ParameterTypeId.DpartLayerWidth` | ForgeTypeId |
| `ForgeTypeId DpartLengthComputed { get; }` | `ParameterTypeId.DpartLengthComputed` | ForgeTypeId |
| `ForgeTypeId DpartMaterialByOriginal { get; }` | `ParameterTypeId.DpartMaterialByOriginal` | ForgeTypeId |
| `ForgeTypeId DpartMaterialIdParam { get; }` | `ParameterTypeId.DpartMaterialIdParam` | ForgeTypeId |
| `ForgeTypeId DpartOriginalCategory { get; }` | `ParameterTypeId.DpartOriginalCategory` | ForgeTypeId |
| `ForgeTypeId DpartOriginalCategoryId { get; }` | `ParameterTypeId.DpartOriginalCategoryId` | ForgeTypeId |
| `ForgeTypeId DpartOriginalFamily { get; }` | `ParameterTypeId.DpartOriginalFamily` | ForgeTypeId |
| `ForgeTypeId DpartOriginalType { get; }` | `ParameterTypeId.DpartOriginalType` | ForgeTypeId |
| `ForgeTypeId DpartPhaseCreatedByOriginal { get; }` | `ParameterTypeId.DpartPhaseCreatedByOriginal` | ForgeTypeId |
| `ForgeTypeId DpartPhaseDemolishedByOriginal { get; }` | `ParameterTypeId.DpartPhaseDemolishedByOriginal` | ForgeTypeId |
| `ForgeTypeId DpartShapeModified { get; }` | `ParameterTypeId.DpartShapeModified` | ForgeTypeId |
| `ForgeTypeId DpartVolumeComputed { get; }` | `ParameterTypeId.DpartVolumeComputed` | ForgeTypeId |
| `ForgeTypeId DrawForEachRun { get; }` | `ParameterTypeId.DrawForEachRun` | ForgeTypeId |
| `ForgeTypeId DuctInsulationThickness { get; }` | `ParameterTypeId.DuctInsulationThickness` | ForgeTypeId |
| `ForgeTypeId DuctRoughness { get; }` | `ParameterTypeId.DuctRoughness` | ForgeTypeId |
| `ForgeTypeId DuctTerminalEngagementLength { get; }` | `ParameterTypeId.DuctTerminalEngagementLength` | ForgeTypeId |
| `ForgeTypeId EdgeLinework { get; }` | `ParameterTypeId.EdgeLinework` | ForgeTypeId |
| `ForgeTypeId EditedBy { get; }` | `ParameterTypeId.EditedBy` | ForgeTypeId |
| `ForgeTypeId ElecticalEquipVoltage { get; }` | `ParameterTypeId.ElecticalEquipVoltage` | ForgeTypeId |
| `ForgeTypeId ElecticalEquipWattage { get; }` | `ParameterTypeId.ElecticalEquipWattage` | ForgeTypeId |
| `ForgeTypeId ElemCategoryParam { get; }` | `ParameterTypeId.ElemCategoryParam` | ForgeTypeId |
| `ForgeTypeId ElemCategoryParamMt { get; }` | `ParameterTypeId.ElemCategoryParamMt` | ForgeTypeId |
| `ForgeTypeId ElemDeletableInFamily { get; }` | `ParameterTypeId.ElemDeletableInFamily` | ForgeTypeId |
| `ForgeTypeId ElementIsCutting { get; }` | `ParameterTypeId.ElementIsCutting` | ForgeTypeId |
| `ForgeTypeId ElementLockedParam { get; }` | `ParameterTypeId.ElementLockedParam` | ForgeTypeId |
| `ForgeTypeId ElemFamilyAndTypeParam { get; }` | `ParameterTypeId.ElemFamilyAndTypeParam` | ForgeTypeId |
| `ForgeTypeId ElemFamilyParam { get; }` | `ParameterTypeId.ElemFamilyParam` | ForgeTypeId |
| `ForgeTypeId ElemIsReference { get; }` | `ParameterTypeId.ElemIsReference` | ForgeTypeId |
| `ForgeTypeId ElemPartitionParam { get; }` | `ParameterTypeId.ElemPartitionParam` | ForgeTypeId |
| `ForgeTypeId ElemReferenceName { get; }` | `ParameterTypeId.ElemReferenceName` | ForgeTypeId |
| `ForgeTypeId ElemReferenceName2dXz { get; }` | `ParameterTypeId.ElemReferenceName2dXz` | ForgeTypeId |
| `ForgeTypeId ElemRoomId { get; }` | `ParameterTypeId.ElemRoomId` | ForgeTypeId |
| `ForgeTypeId ElemRoomName { get; }` | `ParameterTypeId.ElemRoomName` | ForgeTypeId |
| `ForgeTypeId ElemRoomNumber { get; }` | `ParameterTypeId.ElemRoomNumber` | ForgeTypeId |
| `ForgeTypeId ElemTypeLabel { get; }` | `ParameterTypeId.ElemTypeLabel` | ForgeTypeId |
| `ForgeTypeId ElemTypeParam { get; }` | `ParameterTypeId.ElemTypeParam` | ForgeTypeId |
| `ForgeTypeId ElevArrowAngle { get; }` | `ParameterTypeId.ElevArrowAngle` | ForgeTypeId |
| `ForgeTypeId ElevArrowFilled { get; }` | `ParameterTypeId.ElevArrowFilled` | ForgeTypeId |
| `ForgeTypeId ElevAssocDatum { get; }` | `ParameterTypeId.ElevAssocDatum` | ForgeTypeId |
| `ForgeTypeId ElevatnTag { get; }` | `ParameterTypeId.ElevatnTag` | ForgeTypeId |
| `ForgeTypeId ElevReferenceLabelPos { get; }` | `ParameterTypeId.ElevReferenceLabelPos` | ForgeTypeId |
| `ForgeTypeId ElevShape { get; }` | `ParameterTypeId.ElevShape` | ForgeTypeId |
| `ForgeTypeId ElevShowViewName { get; }` | `ParameterTypeId.ElevShowViewName` | ForgeTypeId |
| `ForgeTypeId ElevSymbolId { get; }` | `ParameterTypeId.ElevSymbolId` | ForgeTypeId |
| `ForgeTypeId ElevTextPos { get; }` | `ParameterTypeId.ElevTextPos` | ForgeTypeId |
| `ForgeTypeId ElevViewNamePos { get; }` | `ParameterTypeId.ElevViewNamePos` | ForgeTypeId |
| `ForgeTypeId ElevWidth { get; }` | `ParameterTypeId.ElevWidth` | ForgeTypeId |
| `ForgeTypeId EllipseFocusMrkVisible { get; }` | `ParameterTypeId.EllipseFocusMrkVisible` | ForgeTypeId |
| `ForgeTypeId EllipseModificationKeepsRatio { get; }` | `ParameterTypeId.EllipseModificationKeepsRatio` | ForgeTypeId |
| `ForgeTypeId EllipseXParam { get; }` | `ParameterTypeId.EllipseXParam` | ForgeTypeId |
| `ForgeTypeId EllipseYParam { get; }` | `ParameterTypeId.EllipseYParam` | ForgeTypeId |
| `ForgeTypeId EndExtension { get; }` | `ParameterTypeId.EndExtension` | ForgeTypeId |
| `ForgeTypeId EndJoinCutback { get; }` | `ParameterTypeId.EndJoinCutback` | ForgeTypeId |
| `ForgeTypeId EndTreatment { get; }` | `ParameterTypeId.EndTreatment` | ForgeTypeId |
| `ForgeTypeId EndYJustification { get; }` | `ParameterTypeId.EndYJustification` | ForgeTypeId |
| `ForgeTypeId EndYOffsetValue { get; }` | `ParameterTypeId.EndYOffsetValue` | ForgeTypeId |
| `ForgeTypeId EndZJustification { get; }` | `ParameterTypeId.EndZJustification` | ForgeTypeId |
| `ForgeTypeId EndZOffsetValue { get; }` | `ParameterTypeId.EndZOffsetValue` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisAdvancedOptions { get; }` | `ParameterTypeId.EnergyAnalysisAdvancedOptions` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; }` | `ParameterTypeId.EnergyAnalysisBuildingOperatingSchedule` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisConceptualConstruction { get; }` | `ParameterTypeId.EnergyAnalysisConceptualConstruction` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get; }` | `ParameterTypeId.EnergyAnalysisCreateAnalyticalModel` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisCurrentViewOnly { get; }` | `ParameterTypeId.EnergyAnalysisCurrentViewOnly` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisGlazingIsShaded { get; }` | `ParameterTypeId.EnergyAnalysisGlazingIsShaded` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisHorizontalVoidThreshold { get; }` | `ParameterTypeId.EnergyAnalysisHorizontalVoidThreshold` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisHvacSystem { get; }` | `ParameterTypeId.EnergyAnalysisHvacSystem` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisMasszoneCoreoffset { get; }` | `ParameterTypeId.EnergyAnalysisMasszoneCoreoffset` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisMasszoneDivideperimeter { get; }` | `ParameterTypeId.EnergyAnalysisMasszoneDivideperimeter` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisMasszoneUseenergydatasettings { get; }` | `ParameterTypeId.EnergyAnalysisMasszoneUseenergydatasettings` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisMassZoning { get; }` | `ParameterTypeId.EnergyAnalysisMassZoning` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisOutdoorAirInformationParam { get; }` | `ParameterTypeId.EnergyAnalysisOutdoorAirInformationParam` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisPercentageGlazing { get; }` | `ParameterTypeId.EnergyAnalysisPercentageGlazing` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisPercentageSkylights { get; }` | `ParameterTypeId.EnergyAnalysisPercentageSkylights` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisProjectPhase { get; }` | `ParameterTypeId.EnergyAnalysisProjectPhase` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisShadeDepth { get; }` | `ParameterTypeId.EnergyAnalysisShadeDepth` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisSillHeight { get; }` | `ParameterTypeId.EnergyAnalysisSillHeight` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisSkylightWidth { get; }` | `ParameterTypeId.EnergyAnalysisSkylightWidth` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisSpaceBoundingParam { get; }` | `ParameterTypeId.EnergyAnalysisSpaceBoundingParam` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisVerticalVoidThreshold { get; }` | `ParameterTypeId.EnergyAnalysisVerticalVoidThreshold` | ForgeTypeId |
| `ForgeTypeId EqualityFormula { get; }` | `ParameterTypeId.EqualityFormula` | ForgeTypeId |
| `ForgeTypeId EqualityTextForAngularDim { get; }` | `ParameterTypeId.EqualityTextForAngularDim` | ForgeTypeId |
| `ForgeTypeId EqualityTextForContinuousLinearDim { get; }` | `ParameterTypeId.EqualityTextForContinuousLinearDim` | ForgeTypeId |
| `ForgeTypeId EqualityWitnessDisplay { get; }` | `ParameterTypeId.EqualityWitnessDisplay` | ForgeTypeId |
| `ForgeTypeId ExcavationElementFamilyAndType { get; }` | `ParameterTypeId.ExcavationElementFamilyAndType` | ForgeTypeId |
| `ForgeTypeId ExcavationElementId { get; }` | `ParameterTypeId.ExcavationElementId` | ForgeTypeId |
| `ForgeTypeId ExcavationVolume { get; }` | `ParameterTypeId.ExcavationVolume` | ForgeTypeId |
| `ForgeTypeId ExcavationVolumeOnToposolid { get; }` | `ParameterTypeId.ExcavationVolumeOnToposolid` | ForgeTypeId |
| `ForgeTypeId ExchangeEntityId { get; }` | `ParameterTypeId.ExchangeEntityId` | ForgeTypeId |
| `ForgeTypeId ExchangeId { get; }` | `ParameterTypeId.ExchangeId` | ForgeTypeId |
| `ForgeTypeId ExtrusionAutoParams { get; }` | `ParameterTypeId.ExtrusionAutoParams` | ForgeTypeId |
| `ForgeTypeId ExtrusionDepthParam { get; }` | `ParameterTypeId.ExtrusionDepthParam` | ForgeTypeId |
| `ForgeTypeId ExtrusionEndParam { get; }` | `ParameterTypeId.ExtrusionEndParam` | ForgeTypeId |
| `ForgeTypeId ExtrusionLength { get; }` | `ParameterTypeId.ExtrusionLength` | ForgeTypeId |
| `ForgeTypeId ExtrusionStartParam { get; }` | `ParameterTypeId.ExtrusionStartParam` | ForgeTypeId |
| `ForgeTypeId FabricationBottomElevationIncludeInsulationOfPart { get; }` | `ParameterTypeId.FabricationBottomElevationIncludeInsulationOfPart` | ForgeTypeId |
| `ForgeTypeId FabricationBottomElevationOfPart { get; }` | `ParameterTypeId.FabricationBottomElevationOfPart` | ForgeTypeId |
| `ForgeTypeId FabricationBottomOfPart { get; }` | `ParameterTypeId.FabricationBottomOfPart` | ForgeTypeId |
| `ForgeTypeId FabricationBranchSize { get; }` | `ParameterTypeId.FabricationBranchSize` | ForgeTypeId |
| `ForgeTypeId FabricationChangeServiceParam { get; }` | `ParameterTypeId.FabricationChangeServiceParam` | ForgeTypeId |
| `ForgeTypeId FabricationDoublewallMaterialAbbreviation { get; }` | `ParameterTypeId.FabricationDoublewallMaterialAbbreviation` | ForgeTypeId |
| `ForgeTypeId FabricationDuctworkStiffenerSpec { get; }` | `ParameterTypeId.FabricationDuctworkStiffenerSpec` | ForgeTypeId |
| `ForgeTypeId FabricationEndOffsetParam { get; }` | `ParameterTypeId.FabricationEndOffsetParam` | ForgeTypeId |
| `ForgeTypeId FabricationEndSize { get; }` | `ParameterTypeId.FabricationEndSize` | ForgeTypeId |
| `ForgeTypeId FabricationFittingDescription { get; }` | `ParameterTypeId.FabricationFittingDescription` | ForgeTypeId |
| `ForgeTypeId FabricationInsulationAbbreviation { get; }` | `ParameterTypeId.FabricationInsulationAbbreviation` | ForgeTypeId |
| `ForgeTypeId FabricationInsulationMaterialFinish { get; }` | `ParameterTypeId.FabricationInsulationMaterialFinish` | ForgeTypeId |
| `ForgeTypeId FabricationInsulationSpec { get; }` | `ParameterTypeId.FabricationInsulationSpec` | ForgeTypeId |
| `ForgeTypeId FabricationInsulationSpecificationAbbreviation { get; }` | `ParameterTypeId.FabricationInsulationSpecificationAbbreviation` | ForgeTypeId |
| `ForgeTypeId FabricationLevelParam { get; }` | `ParameterTypeId.FabricationLevelParam` | ForgeTypeId |
| `ForgeTypeId FabricationMaterialAbbreviation { get; }` | `ParameterTypeId.FabricationMaterialAbbreviation` | ForgeTypeId |
| `ForgeTypeId FabricationMaterialGauge { get; }` | `ParameterTypeId.FabricationMaterialGauge` | ForgeTypeId |
| `ForgeTypeId FabricationOffsetParam { get; }` | `ParameterTypeId.FabricationOffsetParam` | ForgeTypeId |
| `ForgeTypeId FabricationPartAlias { get; }` | `ParameterTypeId.FabricationPartAlias` | ForgeTypeId |
| `ForgeTypeId FabricationPartAngle { get; }` | `ParameterTypeId.FabricationPartAngle` | ForgeTypeId |
| `ForgeTypeId FabricationPartAngleOption { get; }` | `ParameterTypeId.FabricationPartAngleOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartBoughtOut { get; }` | `ParameterTypeId.FabricationPartBoughtOut` | ForgeTypeId |
| `ForgeTypeId FabricationPartCutType { get; }` | `ParameterTypeId.FabricationPartCutType` | ForgeTypeId |
| `ForgeTypeId FabricationPartDepthIn { get; }` | `ParameterTypeId.FabricationPartDepthIn` | ForgeTypeId |
| `ForgeTypeId FabricationPartDepthInOption { get; }` | `ParameterTypeId.FabricationPartDepthInOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartDepthOut { get; }` | `ParameterTypeId.FabricationPartDepthOut` | ForgeTypeId |
| `ForgeTypeId FabricationPartDepthOutOption { get; }` | `ParameterTypeId.FabricationPartDepthOutOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartDiameterIn { get; }` | `ParameterTypeId.FabricationPartDiameterIn` | ForgeTypeId |
| `ForgeTypeId FabricationPartDiameterInOption { get; }` | `ParameterTypeId.FabricationPartDiameterInOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartDiameterOut { get; }` | `ParameterTypeId.FabricationPartDiameterOut` | ForgeTypeId |
| `ForgeTypeId FabricationPartDiameterOutOption { get; }` | `ParameterTypeId.FabricationPartDiameterOutOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartDoublewallMaterial { get; }` | `ParameterTypeId.FabricationPartDoublewallMaterial` | ForgeTypeId |
| `ForgeTypeId FabricationPartDoublewallMaterialArea { get; }` | `ParameterTypeId.FabricationPartDoublewallMaterialArea` | ForgeTypeId |
| `ForgeTypeId FabricationPartDoublewallMaterialThickness { get; }` | `ParameterTypeId.FabricationPartDoublewallMaterialThickness` | ForgeTypeId |
| `ForgeTypeId FabricationPartInsulationArea { get; }` | `ParameterTypeId.FabricationPartInsulationArea` | ForgeTypeId |
| `ForgeTypeId FabricationPartItemNumber { get; }` | `ParameterTypeId.FabricationPartItemNumber` | ForgeTypeId |
| `ForgeTypeId FabricationPartLength { get; }` | `ParameterTypeId.FabricationPartLength` | ForgeTypeId |
| `ForgeTypeId FabricationPartLengthOption { get; }` | `ParameterTypeId.FabricationPartLengthOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartLiningArea { get; }` | `ParameterTypeId.FabricationPartLiningArea` | ForgeTypeId |
| `ForgeTypeId FabricationPartMaterial { get; }` | `ParameterTypeId.FabricationPartMaterial` | ForgeTypeId |
| `ForgeTypeId FabricationPartMaterialThickness { get; }` | `ParameterTypeId.FabricationPartMaterialThickness` | ForgeTypeId |
| `ForgeTypeId FabricationPartNotes { get; }` | `ParameterTypeId.FabricationPartNotes` | ForgeTypeId |
| `ForgeTypeId FabricationPartPatNo { get; }` | `ParameterTypeId.FabricationPartPatNo` | ForgeTypeId |
| `ForgeTypeId FabricationPartSheetmetalArea { get; }` | `ParameterTypeId.FabricationPartSheetmetalArea` | ForgeTypeId |
| `ForgeTypeId FabricationPartTakeoffDialogParam { get; }` | `ParameterTypeId.FabricationPartTakeoffDialogParam` | ForgeTypeId |
| `ForgeTypeId FabricationPartWeight { get; }` | `ParameterTypeId.FabricationPartWeight` | ForgeTypeId |
| `ForgeTypeId FabricationPartWidthIn { get; }` | `ParameterTypeId.FabricationPartWidthIn` | ForgeTypeId |
| `ForgeTypeId FabricationPartWidthInOption { get; }` | `ParameterTypeId.FabricationPartWidthInOption` | ForgeTypeId |
| `ForgeTypeId FabricationPartWidthOut { get; }` | `ParameterTypeId.FabricationPartWidthOut` | ForgeTypeId |
| `ForgeTypeId FabricationPartWidthOutOption { get; }` | `ParameterTypeId.FabricationPartWidthOutOption` | ForgeTypeId |
| `ForgeTypeId FabricationPipeInvertElevation { get; }` | `ParameterTypeId.FabricationPipeInvertElevation` | ForgeTypeId |
| `ForgeTypeId FabricationPrimarySize { get; }` | `ParameterTypeId.FabricationPrimarySize` | ForgeTypeId |
| `ForgeTypeId FabricationProductCode { get; }` | `ParameterTypeId.FabricationProductCode` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataFinishDescription { get; }` | `ParameterTypeId.FabricationProductDataFinishDescription` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataInstallType { get; }` | `ParameterTypeId.FabricationProductDataInstallType` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataItemDescription { get; }` | `ParameterTypeId.FabricationProductDataItemDescription` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataLongDescription { get; }` | `ParameterTypeId.FabricationProductDataLongDescription` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataMaterialDescription { get; }` | `ParameterTypeId.FabricationProductDataMaterialDescription` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataOem { get; }` | `ParameterTypeId.FabricationProductDataOem` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataProduct { get; }` | `ParameterTypeId.FabricationProductDataProduct` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataRange { get; }` | `ParameterTypeId.FabricationProductDataRange` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataSizeDescription { get; }` | `ParameterTypeId.FabricationProductDataSizeDescription` | ForgeTypeId |
| `ForgeTypeId FabricationProductDataSpecification { get; }` | `ParameterTypeId.FabricationProductDataSpecification` | ForgeTypeId |
| `ForgeTypeId FabricationProductEntry { get; }` | `ParameterTypeId.FabricationProductEntry` | ForgeTypeId |
| `ForgeTypeId FabricationRelativeFilename { get; }` | `ParameterTypeId.FabricationRelativeFilename` | ForgeTypeId |
| `ForgeTypeId FabricationRoutingSolutionsUiParam { get; }` | `ParameterTypeId.FabricationRoutingSolutionsUiParam` | ForgeTypeId |
| `ForgeTypeId FabricationSecondarySize { get; }` | `ParameterTypeId.FabricationSecondarySize` | ForgeTypeId |
| `ForgeTypeId FabricationServiceAbbreviation { get; }` | `ParameterTypeId.FabricationServiceAbbreviation` | ForgeTypeId |
| `ForgeTypeId FabricationServiceName { get; }` | `ParameterTypeId.FabricationServiceName` | ForgeTypeId |
| `ForgeTypeId FabricationServiceParam { get; }` | `ParameterTypeId.FabricationServiceParam` | ForgeTypeId |
| `ForgeTypeId FabricationSetUpDownTag { get; }` | `ParameterTypeId.FabricationSetUpDownTag` | ForgeTypeId |
| `ForgeTypeId FabricationSetUpDownTagFromBottom { get; }` | `ParameterTypeId.FabricationSetUpDownTagFromBottom` | ForgeTypeId |
| `ForgeTypeId FabricationSlopeParam { get; }` | `ParameterTypeId.FabricationSlopeParam` | ForgeTypeId |
| `ForgeTypeId FabricationSpecification { get; }` | `ParameterTypeId.FabricationSpecification` | ForgeTypeId |
| `ForgeTypeId FabricationSpecificationAbbreviation { get; }` | `ParameterTypeId.FabricationSpecificationAbbreviation` | ForgeTypeId |
| `ForgeTypeId FabricationStartOffsetParam { get; }` | `ParameterTypeId.FabricationStartOffsetParam` | ForgeTypeId |
| `ForgeTypeId FabricationTopElevationIncludeInsulationOfPart { get; }` | `ParameterTypeId.FabricationTopElevationIncludeInsulationOfPart` | ForgeTypeId |
| `ForgeTypeId FabricationTopElevationOfPart { get; }` | `ParameterTypeId.FabricationTopElevationOfPart` | ForgeTypeId |
| `ForgeTypeId FabricationTopOfPart { get; }` | `ParameterTypeId.FabricationTopOfPart` | ForgeTypeId |
| `ForgeTypeId FabricationVendor { get; }` | `ParameterTypeId.FabricationVendor` | ForgeTypeId |
| `ForgeTypeId FabricationVendorCode { get; }` | `ParameterTypeId.FabricationVendorCode` | ForgeTypeId |
| `ForgeTypeId FabricBendDiameter { get; }` | `ParameterTypeId.FabricBendDiameter` | ForgeTypeId |
| `ForgeTypeId FabricNumber { get; }` | `ParameterTypeId.FabricNumber` | ForgeTypeId |
| `ForgeTypeId FabricParamCoverOffset { get; }` | `ParameterTypeId.FabricParamCoverOffset` | ForgeTypeId |
| `ForgeTypeId FabricParamCutByHost { get; }` | `ParameterTypeId.FabricParamCutByHost` | ForgeTypeId |
| `ForgeTypeId FabricParamCutOverallLength { get; }` | `ParameterTypeId.FabricParamCutOverallLength` | ForgeTypeId |
| `ForgeTypeId FabricParamCutOverallWidth { get; }` | `ParameterTypeId.FabricParamCutOverallWidth` | ForgeTypeId |
| `ForgeTypeId FabricParamCutSheetMass { get; }` | `ParameterTypeId.FabricParamCutSheetMass` | ForgeTypeId |
| `ForgeTypeId FabricParamLapsplicePosition { get; }` | `ParameterTypeId.FabricParamLapsplicePosition` | ForgeTypeId |
| `ForgeTypeId FabricParamLocationGeneric { get; }` | `ParameterTypeId.FabricParamLocationGeneric` | ForgeTypeId |
| `ForgeTypeId FabricParamLocationSlab { get; }` | `ParameterTypeId.FabricParamLocationSlab` | ForgeTypeId |
| `ForgeTypeId FabricParamLocationWall { get; }` | `ParameterTypeId.FabricParamLocationWall` | ForgeTypeId |
| `ForgeTypeId FabricParamMajorLapspliceLength { get; }` | `ParameterTypeId.FabricParamMajorLapspliceLength` | ForgeTypeId |
| `ForgeTypeId FabricParamMinorLapspliceLength { get; }` | `ParameterTypeId.FabricParamMinorLapspliceLength` | ForgeTypeId |
| `ForgeTypeId FabricParamRounding { get; }` | `ParameterTypeId.FabricParamRounding` | ForgeTypeId |
| `ForgeTypeId FabricParamSharedFamilyKey { get; }` | `ParameterTypeId.FabricParamSharedFamilyKey` | ForgeTypeId |
| `ForgeTypeId FabricParamSheetType { get; }` | `ParameterTypeId.FabricParamSheetType` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymBottom { get; }` | `ParameterTypeId.FabricParamSpanSymBottom` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymDBottom { get; }` | `ParameterTypeId.FabricParamSpanSymDBottom` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymDLeft { get; }` | `ParameterTypeId.FabricParamSpanSymDLeft` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymDRight { get; }` | `ParameterTypeId.FabricParamSpanSymDRight` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymDTop { get; }` | `ParameterTypeId.FabricParamSpanSymDTop` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymLeft { get; }` | `ParameterTypeId.FabricParamSpanSymLeft` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymRight { get; }` | `ParameterTypeId.FabricParamSpanSymRight` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanSymTop { get; }` | `ParameterTypeId.FabricParamSpanSymTop` | ForgeTypeId |
| `ForgeTypeId FabricParamSpanTagComponentReference { get; }` | `ParameterTypeId.FabricParamSpanTagComponentReference` | ForgeTypeId |
| `ForgeTypeId FabricParamTagView { get; }` | `ParameterTypeId.FabricParamTagView` | ForgeTypeId |
| `ForgeTypeId FabricParamTotalSheetMass { get; }` | `ParameterTypeId.FabricParamTotalSheetMass` | ForgeTypeId |
| `ForgeTypeId FabricSheetDefaultMajorLapspliceLength { get; }` | `ParameterTypeId.FabricSheetDefaultMajorLapspliceLength` | ForgeTypeId |
| `ForgeTypeId FabricSheetDefaultMinorLapspliceLength { get; }` | `ParameterTypeId.FabricSheetDefaultMinorLapspliceLength` | ForgeTypeId |
| `ForgeTypeId FabricSheetLength { get; }` | `ParameterTypeId.FabricSheetLength` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorDirectionWireType { get; }` | `ParameterTypeId.FabricSheetMajorDirectionWireType` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorEndOverhang { get; }` | `ParameterTypeId.FabricSheetMajorEndOverhang` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorLayoutPattern { get; }` | `ParameterTypeId.FabricSheetMajorLayoutPattern` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorNumberOfWires { get; }` | `ParameterTypeId.FabricSheetMajorNumberOfWires` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorReinforcementArea { get; }` | `ParameterTypeId.FabricSheetMajorReinforcementArea` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorSpacing { get; }` | `ParameterTypeId.FabricSheetMajorSpacing` | ForgeTypeId |
| `ForgeTypeId FabricSheetMajorStartOverhang { get; }` | `ParameterTypeId.FabricSheetMajorStartOverhang` | ForgeTypeId |
| `ForgeTypeId FabricSheetMass { get; }` | `ParameterTypeId.FabricSheetMass` | ForgeTypeId |
| `ForgeTypeId FabricSheetMassunit { get; }` | `ParameterTypeId.FabricSheetMassunit` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorDirectionWireType { get; }` | `ParameterTypeId.FabricSheetMinorDirectionWireType` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorEndOverhang { get; }` | `ParameterTypeId.FabricSheetMinorEndOverhang` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorLayoutPattern { get; }` | `ParameterTypeId.FabricSheetMinorLayoutPattern` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorNumberOfWires { get; }` | `ParameterTypeId.FabricSheetMinorNumberOfWires` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorReinforcementArea { get; }` | `ParameterTypeId.FabricSheetMinorReinforcementArea` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorSpacing { get; }` | `ParameterTypeId.FabricSheetMinorSpacing` | ForgeTypeId |
| `ForgeTypeId FabricSheetMinorStartOverhang { get; }` | `ParameterTypeId.FabricSheetMinorStartOverhang` | ForgeTypeId |
| `ForgeTypeId FabricSheetOverallLength { get; }` | `ParameterTypeId.FabricSheetOverallLength` | ForgeTypeId |
| `ForgeTypeId FabricSheetOverallWidth { get; }` | `ParameterTypeId.FabricSheetOverallWidth` | ForgeTypeId |
| `ForgeTypeId FabricSheetPhysicalMaterialAsset { get; }` | `ParameterTypeId.FabricSheetPhysicalMaterialAsset` | ForgeTypeId |
| `ForgeTypeId FabricSheetWidth { get; }` | `ParameterTypeId.FabricSheetWidth` | ForgeTypeId |
| `ForgeTypeId FabricWireDiameter { get; }` | `ParameterTypeId.FabricWireDiameter` | ForgeTypeId |
| `ForgeTypeId FabricWireDistance { get; }` | `ParameterTypeId.FabricWireDistance` | ForgeTypeId |
| `ForgeTypeId FabricWireLength { get; }` | `ParameterTypeId.FabricWireLength` | ForgeTypeId |
| `ForgeTypeId FabricWireOffset { get; }` | `ParameterTypeId.FabricWireOffset` | ForgeTypeId |
| `ForgeTypeId FabricWireType { get; }` | `ParameterTypeId.FabricWireType` | ForgeTypeId |
| `ForgeTypeId FaceroofLevelParam { get; }` | `ParameterTypeId.FaceroofLevelParam` | ForgeTypeId |
| `ForgeTypeId FaceroofOffsetParam { get; }` | `ParameterTypeId.FaceroofOffsetParam` | ForgeTypeId |
| `ForgeTypeId FamilyAllowCutWithVoids { get; }` | `ParameterTypeId.FamilyAllowCutWithVoids` | ForgeTypeId |
| `ForgeTypeId FamilyAlwaysVertical { get; }` | `ParameterTypeId.FamilyAlwaysVertical` | ForgeTypeId |
| `ForgeTypeId FamilyAutojoin { get; }` | `ParameterTypeId.FamilyAutojoin` | ForgeTypeId |
| `ForgeTypeId FamilyBaseLevelOffsetParam { get; }` | `ParameterTypeId.FamilyBaseLevelOffsetParam` | ForgeTypeId |
| `ForgeTypeId FamilyBaseLevelParam { get; }` | `ParameterTypeId.FamilyBaseLevelParam` | ForgeTypeId |
| `ForgeTypeId FamilyCanHostRebar { get; }` | `ParameterTypeId.FamilyCanHostRebar` | ForgeTypeId |
| `ForgeTypeId FamilyCategoryPseudoParam { get; }` | `ParameterTypeId.FamilyCategoryPseudoParam` | ForgeTypeId |
| `ForgeTypeId FamilyContentPartType { get; }` | `ParameterTypeId.FamilyContentPartType` | ForgeTypeId |
| `ForgeTypeId FamilyCurveAttachmentProportion { get; }` | `ParameterTypeId.FamilyCurveAttachmentProportion` | ForgeTypeId |
| `ForgeTypeId FamilyCurveGstyleFor2010Mass { get; }` | `ParameterTypeId.FamilyCurveGstyleFor2010Mass` | ForgeTypeId |
| `ForgeTypeId FamilyCurveGstylePlusInvisible { get; }` | `ParameterTypeId.FamilyCurveGstylePlusInvisible` | ForgeTypeId |
| `ForgeTypeId FamilyCurveGstylePlusInvisibleMinusAnalytical { get; }` | `ParameterTypeId.FamilyCurveGstylePlusInvisibleMinusAnalytical` | ForgeTypeId |
| `ForgeTypeId FamilyCurveGstylePlusInvisiblePlusStickSym { get; }` | `ParameterTypeId.FamilyCurveGstylePlusInvisiblePlusStickSym` | ForgeTypeId |
| `ForgeTypeId FamilyCurveGstylePlusInvisiblePlusStickSymMinusAnalytical { get; }` | `ParameterTypeId.FamilyCurveGstylePlusInvisiblePlusStickSymMinusAnalytical` | ForgeTypeId |
| `ForgeTypeId FamilyElectricalMaintainAnnotationOrientation { get; }` | `ParameterTypeId.FamilyElectricalMaintainAnnotationOrientation` | ForgeTypeId |
| `ForgeTypeId FamilyElemSubcategory { get; }` | `ParameterTypeId.FamilyElemSubcategory` | ForgeTypeId |
| `ForgeTypeId FamilyEnableCuttingInViews { get; }` | `ParameterTypeId.FamilyEnableCuttingInViews` | ForgeTypeId |
| `ForgeTypeId FamilyExportAsGeometry { get; }` | `ParameterTypeId.FamilyExportAsGeometry` | ForgeTypeId |
| `ForgeTypeId FamilyFreeinstDefaultElevation { get; }` | `ParameterTypeId.FamilyFreeinstDefaultElevation` | ForgeTypeId |
| `ForgeTypeId FamilyHeightParam { get; }` | `ParameterTypeId.FamilyHeightParam` | ForgeTypeId |
| `ForgeTypeId FamilyHostingBehavior { get; }` | `ParameterTypeId.FamilyHostingBehavior` | ForgeTypeId |
| `ForgeTypeId FamilyIsElevationMarkBody { get; }` | `ParameterTypeId.FamilyIsElevationMarkBody` | ForgeTypeId |
| `ForgeTypeId FamilyIsParametric { get; }` | `ParameterTypeId.FamilyIsParametric` | ForgeTypeId |
| `ForgeTypeId FamilyKeepTextReadable { get; }` | `ParameterTypeId.FamilyKeepTextReadable` | ForgeTypeId |
| `ForgeTypeId FamilyKeyExtParam { get; }` | `ParameterTypeId.FamilyKeyExtParam` | ForgeTypeId |
| `ForgeTypeId FamilyKeywordProtected { get; }` | `ParameterTypeId.FamilyKeywordProtected` | ForgeTypeId |
| `ForgeTypeId FamilyLevelParam { get; }` | `ParameterTypeId.FamilyLevelParam` | ForgeTypeId |
| `ForgeTypeId FamilyLineLengthParam { get; }` | `ParameterTypeId.FamilyLineLengthParam` | ForgeTypeId |
| `ForgeTypeId FamilyNamePseudoParam { get; }` | `ParameterTypeId.FamilyNamePseudoParam` | ForgeTypeId |
| `ForgeTypeId FamilyNestingBehavior { get; }` | `ParameterTypeId.FamilyNestingBehavior` | ForgeTypeId |
| `ForgeTypeId FamilyRenderingType { get; }` | `ParameterTypeId.FamilyRenderingType` | ForgeTypeId |
| `ForgeTypeId FamilyRfaPathPseudoParam { get; }` | `ParameterTypeId.FamilyRfaPathPseudoParam` | ForgeTypeId |
| `ForgeTypeId FamilyRotateTextWithComponent { get; }` | `ParameterTypeId.FamilyRotateTextWithComponent` | ForgeTypeId |
| `ForgeTypeId FamilyRotateWithComponent { get; }` | `ParameterTypeId.FamilyRotateWithComponent` | ForgeTypeId |
| `ForgeTypeId FamilyRoughHeightParam { get; }` | `ParameterTypeId.FamilyRoughHeightParam` | ForgeTypeId |
| `ForgeTypeId FamilyRoughWidthParam { get; }` | `ParameterTypeId.FamilyRoughWidthParam` | ForgeTypeId |
| `ForgeTypeId FamilyRoundconnectorDimensiontype { get; }` | `ParameterTypeId.FamilyRoundconnectorDimensiontype` | ForgeTypeId |
| `ForgeTypeId FamilySelfOrienting { get; }` | `ParameterTypeId.FamilySelfOrienting` | ForgeTypeId |
| `ForgeTypeId FamilyShared { get; }` | `ParameterTypeId.FamilyShared` | ForgeTypeId |
| `ForgeTypeId FamilyStructFootingUseCapTop { get; }` | `ParameterTypeId.FamilyStructFootingUseCapTop` | ForgeTypeId |
| `ForgeTypeId FamilyStructMaterialType { get; }` | `ParameterTypeId.FamilyStructMaterialType` | ForgeTypeId |
| `ForgeTypeId FamilySymbolicRep { get; }` | `ParameterTypeId.FamilySymbolicRep` | ForgeTypeId |
| `ForgeTypeId FamilyThicknessParam { get; }` | `ParameterTypeId.FamilyThicknessParam` | ForgeTypeId |
| `ForgeTypeId FamilyTopLevelOffsetParam { get; }` | `ParameterTypeId.FamilyTopLevelOffsetParam` | ForgeTypeId |
| `ForgeTypeId FamilyTopLevelParam { get; }` | `ParameterTypeId.FamilyTopLevelParam` | ForgeTypeId |
| `ForgeTypeId FamilyUsagePseudoParam { get; }` | `ParameterTypeId.FamilyUsagePseudoParam` | ForgeTypeId |
| `ForgeTypeId FamilyUsePrecutShape { get; }` | `ParameterTypeId.FamilyUsePrecutShape` | ForgeTypeId |
| `ForgeTypeId FamilyUsingMultiple { get; }` | `ParameterTypeId.FamilyUsingMultiple` | ForgeTypeId |
| `ForgeTypeId FamilyWidthParam { get; }` | `ParameterTypeId.FamilyWidthParam` | ForgeTypeId |
| `ForgeTypeId FamilyWindowInsetParam { get; }` | `ParameterTypeId.FamilyWindowInsetParam` | ForgeTypeId |
| `ForgeTypeId FamilyWorkPlaneBased { get; }` | `ParameterTypeId.FamilyWorkPlaneBased` | ForgeTypeId |
| `ForgeTypeId FamilyWpbDefaultElevation { get; }` | `ParameterTypeId.FamilyWpbDefaultElevation` | ForgeTypeId |
| `ForgeTypeId FamProfileDefinition { get; }` | `ParameterTypeId.FamProfileDefinition` | ForgeTypeId |
| `ForgeTypeId FamProfileUsage { get; }` | `ParameterTypeId.FamProfileUsage` | ForgeTypeId |
| `ForgeTypeId FasciaDepthParam { get; }` | `ParameterTypeId.FasciaDepthParam` | ForgeTypeId |
| `ForgeTypeId FasciaMaterialParam { get; }` | `ParameterTypeId.FasciaMaterialParam` | ForgeTypeId |
| `ForgeTypeId FasciaProfileParam { get; }` | `ParameterTypeId.FasciaProfileParam` | ForgeTypeId |
| `ForgeTypeId FbxAssetType { get; }` | `ParameterTypeId.FbxAssetType` | ForgeTypeId |
| `ForgeTypeId FbxLightAtADistance { get; }` | `ParameterTypeId.FbxLightAtADistance` | ForgeTypeId |
| `ForgeTypeId FbxLightBallastLoss { get; }` | `ParameterTypeId.FbxLightBallastLoss` | ForgeTypeId |
| `ForgeTypeId FbxLightColorFilter { get; }` | `ParameterTypeId.FbxLightColorFilter` | ForgeTypeId |
| `ForgeTypeId FbxLightDimmingLightColor { get; }` | `ParameterTypeId.FbxLightDimmingLightColor` | ForgeTypeId |
| `ForgeTypeId FbxLightEfficacy { get; }` | `ParameterTypeId.FbxLightEfficacy` | ForgeTypeId |
| `ForgeTypeId FbxLightEmitCircleDiameter { get; }` | `ParameterTypeId.FbxLightEmitCircleDiameter` | ForgeTypeId |
| `ForgeTypeId FbxLightEmitLineLength { get; }` | `ParameterTypeId.FbxLightEmitLineLength` | ForgeTypeId |
| `ForgeTypeId FbxLightEmitRectangleLength { get; }` | `ParameterTypeId.FbxLightEmitRectangleLength` | ForgeTypeId |
| `ForgeTypeId FbxLightEmitRectangleWidth { get; }` | `ParameterTypeId.FbxLightEmitRectangleWidth` | ForgeTypeId |
| `ForgeTypeId FbxLightEmitShapeVisible { get; }` | `ParameterTypeId.FbxLightEmitShapeVisible` | ForgeTypeId |
| `ForgeTypeId FbxLightIlluminance { get; }` | `ParameterTypeId.FbxLightIlluminance` | ForgeTypeId |
| `ForgeTypeId FbxLightInitialColorCtrl { get; }` | `ParameterTypeId.FbxLightInitialColorCtrl` | ForgeTypeId |
| `ForgeTypeId FbxLightInitialColorName { get; }` | `ParameterTypeId.FbxLightInitialColorName` | ForgeTypeId |
| `ForgeTypeId FbxLightInitialColorTemperature { get; }` | `ParameterTypeId.FbxLightInitialColorTemperature` | ForgeTypeId |
| `ForgeTypeId FbxLightInitialIntensity { get; }` | `ParameterTypeId.FbxLightInitialIntensity` | ForgeTypeId |
| `ForgeTypeId FbxLightInitialIntensityInputMethod { get; }` | `ParameterTypeId.FbxLightInitialIntensityInputMethod` | ForgeTypeId |
| `ForgeTypeId FbxLightLampLumenDepr { get; }` | `ParameterTypeId.FbxLightLampLumenDepr` | ForgeTypeId |
| `ForgeTypeId FbxLightLampTiltLoss { get; }` | `ParameterTypeId.FbxLightLampTiltLoss` | ForgeTypeId |
| `ForgeTypeId FbxLightLimunousFlux { get; }` | `ParameterTypeId.FbxLightLimunousFlux` | ForgeTypeId |
| `ForgeTypeId FbxLightLimunousIntensity { get; }` | `ParameterTypeId.FbxLightLimunousIntensity` | ForgeTypeId |
| `ForgeTypeId FbxLightLossFactorCtrl { get; }` | `ParameterTypeId.FbxLightLossFactorCtrl` | ForgeTypeId |
| `ForgeTypeId FbxLightLossFactorMethod { get; }` | `ParameterTypeId.FbxLightLossFactorMethod` | ForgeTypeId |
| `ForgeTypeId FbxLightLumenaireDirt { get; }` | `ParameterTypeId.FbxLightLumenaireDirt` | ForgeTypeId |
| `ForgeTypeId FbxLightPhotometricFile { get; }` | `ParameterTypeId.FbxLightPhotometricFile` | ForgeTypeId |
| `ForgeTypeId FbxLightPhotometricFileCache { get; }` | `ParameterTypeId.FbxLightPhotometricFileCache` | ForgeTypeId |
| `ForgeTypeId FbxLightPhotometrics { get; }` | `ParameterTypeId.FbxLightPhotometrics` | ForgeTypeId |
| `ForgeTypeId FbxLightPhotometricsFam { get; }` | `ParameterTypeId.FbxLightPhotometricsFam` | ForgeTypeId |
| `ForgeTypeId FbxLightSourceDiameter { get; }` | `ParameterTypeId.FbxLightSourceDiameter` | ForgeTypeId |
| `ForgeTypeId FbxLightSourceLength { get; }` | `ParameterTypeId.FbxLightSourceLength` | ForgeTypeId |
| `ForgeTypeId FbxLightSpotBeamAngle { get; }` | `ParameterTypeId.FbxLightSpotBeamAngle` | ForgeTypeId |
| `ForgeTypeId FbxLightSpotFieldAngle { get; }` | `ParameterTypeId.FbxLightSpotFieldAngle` | ForgeTypeId |
| `ForgeTypeId FbxLightSpotTiltAngle { get; }` | `ParameterTypeId.FbxLightSpotTiltAngle` | ForgeTypeId |
| `ForgeTypeId FbxLightSurfaceLoss { get; }` | `ParameterTypeId.FbxLightSurfaceLoss` | ForgeTypeId |
| `ForgeTypeId FbxLightTemperatureLoss { get; }` | `ParameterTypeId.FbxLightTemperatureLoss` | ForgeTypeId |
| `ForgeTypeId FbxLightTotalLightLoss { get; }` | `ParameterTypeId.FbxLightTotalLightLoss` | ForgeTypeId |
| `ForgeTypeId FbxLightVoltageLoss { get; }` | `ParameterTypeId.FbxLightVoltageLoss` | ForgeTypeId |
| `ForgeTypeId FbxLightWattage { get; }` | `ParameterTypeId.FbxLightWattage` | ForgeTypeId |
| `ForgeTypeId FilledRegionMasking { get; }` | `ParameterTypeId.FilledRegionMasking` | ForgeTypeId |
| `ForgeTypeId FillPatternIdParam { get; }` | `ParameterTypeId.FillPatternIdParam` | ForgeTypeId |
| `ForgeTypeId FillPatternIdParamNoNo { get; }` | `ParameterTypeId.FillPatternIdParamNoNo` | ForgeTypeId |
| `ForgeTypeId FireRating { get; }` | `ParameterTypeId.FireRating` | ForgeTypeId |
| `ForgeTypeId FixedRotation { get; }` | `ParameterTypeId.FixedRotation` | ForgeTypeId |
| `ForgeTypeId FlexibleInstanceFlip { get; }` | `ParameterTypeId.FlexibleInstanceFlip` | ForgeTypeId |
| `ForgeTypeId FloorAttrDefaultHeightParam { get; }` | `ParameterTypeId.FloorAttrDefaultHeightParam` | ForgeTypeId |
| `ForgeTypeId FloorAttrDefaultThicknessParam { get; }` | `ParameterTypeId.FloorAttrDefaultThicknessParam` | ForgeTypeId |
| `ForgeTypeId FloorAttrThicknessParam { get; }` | `ParameterTypeId.FloorAttrThicknessParam` | ForgeTypeId |
| `ForgeTypeId FloorHeightabovelevelParam { get; }` | `ParameterTypeId.FloorHeightabovelevelParam` | ForgeTypeId |
| `ForgeTypeId FloorParamIsStructural { get; }` | `ParameterTypeId.FloorParamIsStructural` | ForgeTypeId |
| `ForgeTypeId FloorParamSpanDirection { get; }` | `ParameterTypeId.FloorParamSpanDirection` | ForgeTypeId |
| `ForgeTypeId FloorStructureIdParam { get; }` | `ParameterTypeId.FloorStructureIdParam` | ForgeTypeId |
| `ForgeTypeId FollowSurface { get; }` | `ParameterTypeId.FollowSurface` | ForgeTypeId |
| `ForgeTypeId ForegroundAnyPatternIdParam { get; }` | `ParameterTypeId.ForegroundAnyPatternIdParam` | ForgeTypeId |
| `ForgeTypeId ForegroundDraftPatternIdParam { get; }` | `ParameterTypeId.ForegroundDraftPatternIdParam` | ForgeTypeId |
| `ForgeTypeId ForegroundPatternColorParam { get; }` | `ParameterTypeId.ForegroundPatternColorParam` | ForgeTypeId |
| `ForgeTypeId FramingLengthRoundoff { get; }` | `ParameterTypeId.FramingLengthRoundoff` | ForgeTypeId |
| `ForgeTypeId FramingShapeClassification { get; }` | `ParameterTypeId.FramingShapeClassification` | ForgeTypeId |
| `ForgeTypeId FrictionFactor { get; }` | `ParameterTypeId.FrictionFactor` | ForgeTypeId |
| `ForgeTypeId FunctionParam { get; }` | `ParameterTypeId.FunctionParam` | ForgeTypeId |
| `ForgeTypeId GbxmlEditDataParam { get; }` | `ParameterTypeId.GbxmlEditDataParam` | ForgeTypeId |
| `ForgeTypeId GenericDepth { get; }` | `ParameterTypeId.GenericDepth` | ForgeTypeId |
| `ForgeTypeId GenericZoneName { get; }` | `ParameterTypeId.GenericZoneName` | ForgeTypeId |
| `ForgeTypeId GeoLocation { get; }` | `ParameterTypeId.GeoLocation` | ForgeTypeId |
| `ForgeTypeId GeomVisibilityParam { get; }` | `ParameterTypeId.GeomVisibilityParam` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptions { get; }` | `ParameterTypeId.GraphicDisplayOptions` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsBackground { get; }` | `ParameterTypeId.GraphicDisplayOptionsBackground` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsFog { get; }` | `ParameterTypeId.GraphicDisplayOptionsFog` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsLighting { get; }` | `ParameterTypeId.GraphicDisplayOptionsLighting` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsModel { get; }` | `ParameterTypeId.GraphicDisplayOptionsModel` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsPhotoExposure { get; }` | `ParameterTypeId.GraphicDisplayOptionsPhotoExposure` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsShadows { get; }` | `ParameterTypeId.GraphicDisplayOptionsShadows` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsSketchyLines { get; }` | `ParameterTypeId.GraphicDisplayOptionsSketchyLines` | ForgeTypeId |
| `ForgeTypeId GraphicDisplayOptionsSsIntensity { get; }` | `ParameterTypeId.GraphicDisplayOptionsSsIntensity` | ForgeTypeId |
| `ForgeTypeId GridBankColNum { get; }` | `ParameterTypeId.GridBankColNum` | ForgeTypeId |
| `ForgeTypeId GridBankColWidth { get; }` | `ParameterTypeId.GridBankColWidth` | ForgeTypeId |
| `ForgeTypeId GridBankRowHeight { get; }` | `ParameterTypeId.GridBankRowHeight` | ForgeTypeId |
| `ForgeTypeId GridBankRowNum { get; }` | `ParameterTypeId.GridBankRowNum` | ForgeTypeId |
| `ForgeTypeId GridBubbleEndn1 { get; }` | `ParameterTypeId.GridBubbleEndn1` | ForgeTypeId |
| `ForgeTypeId GridBubbleEndn2 { get; }` | `ParameterTypeId.GridBubbleEndn2` | ForgeTypeId |
| `ForgeTypeId GridBubbleLinePen { get; }` | `ParameterTypeId.GridBubbleLinePen` | ForgeTypeId |
| `ForgeTypeId GridCenterSegmentColor { get; }` | `ParameterTypeId.GridCenterSegmentColor` | ForgeTypeId |
| `ForgeTypeId GridCenterSegmentPattern { get; }` | `ParameterTypeId.GridCenterSegmentPattern` | ForgeTypeId |
| `ForgeTypeId GridCenterSegmentStyle { get; }` | `ParameterTypeId.GridCenterSegmentStyle` | ForgeTypeId |
| `ForgeTypeId GridCenterSegmentWeight { get; }` | `ParameterTypeId.GridCenterSegmentWeight` | ForgeTypeId |
| `ForgeTypeId GridEndSegmentColor { get; }` | `ParameterTypeId.GridEndSegmentColor` | ForgeTypeId |
| `ForgeTypeId GridEndSegmentPattern { get; }` | `ParameterTypeId.GridEndSegmentPattern` | ForgeTypeId |
| `ForgeTypeId GridEndSegmentsLength { get; }` | `ParameterTypeId.GridEndSegmentsLength` | ForgeTypeId |
| `ForgeTypeId GridEndSegmentWeight { get; }` | `ParameterTypeId.GridEndSegmentWeight` | ForgeTypeId |
| `ForgeTypeId GridHeadTag { get; }` | `ParameterTypeId.GridHeadTag` | ForgeTypeId |
| `ForgeTypeId GridlineSpecStatus { get; }` | `ParameterTypeId.GridlineSpecStatus` | ForgeTypeId |
| `ForgeTypeId GridNetLocationMark { get; }` | `ParameterTypeId.GridNetLocationMark` | ForgeTypeId |
| `ForgeTypeId GroupAllowedViewTypes { get; }` | `ParameterTypeId.GroupAllowedViewTypes` | ForgeTypeId |
| `ForgeTypeId GroupAttachedParentName { get; }` | `ParameterTypeId.GroupAttachedParentName` | ForgeTypeId |
| `ForgeTypeId GroupLevel { get; }` | `ParameterTypeId.GroupLevel` | ForgeTypeId |
| `ForgeTypeId GroupnameParam { get; }` | `ParameterTypeId.GroupnameParam` | ForgeTypeId |
| `ForgeTypeId GroupOffsetFromLevel { get; }` | `ParameterTypeId.GroupOffsetFromLevel` | ForgeTypeId |
| `ForgeTypeId GuideGridNameParam { get; }` | `ParameterTypeId.GuideGridNameParam` | ForgeTypeId |
| `ForgeTypeId GuideGridSpacingParam { get; }` | `ParameterTypeId.GuideGridSpacingParam` | ForgeTypeId |
| `ForgeTypeId GutterMaterialParam { get; }` | `ParameterTypeId.GutterMaterialParam` | ForgeTypeId |
| `ForgeTypeId GutterProfileParam { get; }` | `ParameterTypeId.GutterProfileParam` | ForgeTypeId |
| `ForgeTypeId HandrailHandClearanceParam { get; }` | `ParameterTypeId.HandrailHandClearanceParam` | ForgeTypeId |
| `ForgeTypeId HandrailHeightParam { get; }` | `ParameterTypeId.HandrailHeightParam` | ForgeTypeId |
| `ForgeTypeId HandrailProjectionParam { get; }` | `ParameterTypeId.HandrailProjectionParam` | ForgeTypeId |
| `ForgeTypeId HandrailSupportsJustificationParam { get; }` | `ParameterTypeId.HandrailSupportsJustificationParam` | ForgeTypeId |
| `ForgeTypeId HandrailSupportsLayoutParam { get; }` | `ParameterTypeId.HandrailSupportsLayoutParam` | ForgeTypeId |
| `ForgeTypeId HandrailSupportsNumberParam { get; }` | `ParameterTypeId.HandrailSupportsNumberParam` | ForgeTypeId |
| `ForgeTypeId HandrailSupportsSpacingParam { get; }` | `ParameterTypeId.HandrailSupportsSpacingParam` | ForgeTypeId |
| `ForgeTypeId HandrailSupportsTypeParam { get; }` | `ParameterTypeId.HandrailSupportsTypeParam` | ForgeTypeId |
| `ForgeTypeId HeadOnPlacementMethod { get; }` | `ParameterTypeId.HeadOnPlacementMethod` | ForgeTypeId |
| `ForgeTypeId HeavyEndPen { get; }` | `ParameterTypeId.HeavyEndPen` | ForgeTypeId |
| `ForgeTypeId HeavyTickMarkPen { get; }` | `ParameterTypeId.HeavyTickMarkPen` | ForgeTypeId |
| `ForgeTypeId HighestAssociatedLevel { get; }` | `ParameterTypeId.HighestAssociatedLevel` | ForgeTypeId |
| `ForgeTypeId HostAreaComputed { get; }` | `ParameterTypeId.HostAreaComputed` | ForgeTypeId |
| `ForgeTypeId HostIdParam { get; }` | `ParameterTypeId.HostIdParam` | ForgeTypeId |
| `ForgeTypeId HostPanelScheduleAsPanelParam { get; }` | `ParameterTypeId.HostPanelScheduleAsPanelParam` | ForgeTypeId |
| `ForgeTypeId HostPerimeterComputed { get; }` | `ParameterTypeId.HostPerimeterComputed` | ForgeTypeId |
| `ForgeTypeId HostSseCurvedEdgeConditionParam { get; }` | `ParameterTypeId.HostSseCurvedEdgeConditionParam` | ForgeTypeId |
| `ForgeTypeId HostVolumeComputed { get; }` | `ParameterTypeId.HostVolumeComputed` | ForgeTypeId |
| `ForgeTypeId IconIndexParam { get; }` | `ParameterTypeId.IconIndexParam` | ForgeTypeId |
| `ForgeTypeId IdParam { get; }` | `ParameterTypeId.IdParam` | ForgeTypeId |
| `ForgeTypeId IfcApplicationName { get; }` | `ParameterTypeId.IfcApplicationName` | ForgeTypeId |
| `ForgeTypeId IfcApplicationVersion { get; }` | `ParameterTypeId.IfcApplicationVersion` | ForgeTypeId |
| `ForgeTypeId IfcBuildingGuid { get; }` | `ParameterTypeId.IfcBuildingGuid` | ForgeTypeId |
| `ForgeTypeId IfcExportElement { get; }` | `ParameterTypeId.IfcExportElement` | ForgeTypeId |
| `ForgeTypeId IfcExportElementAs { get; }` | `ParameterTypeId.IfcExportElementAs` | ForgeTypeId |
| `ForgeTypeId IfcExportElementType { get; }` | `ParameterTypeId.IfcExportElementType` | ForgeTypeId |
| `ForgeTypeId IfcExportElementTypeAs { get; }` | `ParameterTypeId.IfcExportElementTypeAs` | ForgeTypeId |
| `ForgeTypeId IfcExportPredefinedtype { get; }` | `ParameterTypeId.IfcExportPredefinedtype` | ForgeTypeId |
| `ForgeTypeId IfcExportPredefinedtypeType { get; }` | `ParameterTypeId.IfcExportPredefinedtypeType` | ForgeTypeId |
| `ForgeTypeId IfcGuid { get; }` | `ParameterTypeId.IfcGuid` | ForgeTypeId |
| `ForgeTypeId IfcImportMaterialName { get; }` | `ParameterTypeId.IfcImportMaterialName` | ForgeTypeId |
| `ForgeTypeId IfcOrganization { get; }` | `ParameterTypeId.IfcOrganization` | ForgeTypeId |
| `ForgeTypeId IfcProjectGuid { get; }` | `ParameterTypeId.IfcProjectGuid` | ForgeTypeId |
| `ForgeTypeId IfcSiteGuid { get; }` | `ParameterTypeId.IfcSiteGuid` | ForgeTypeId |
| `ForgeTypeId IfcTypeGuid { get; }` | `ParameterTypeId.IfcTypeGuid` | ForgeTypeId |
| `ForgeTypeId ImportAdtComponentsDesc { get; }` | `ParameterTypeId.ImportAdtComponentsDesc` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityHeight { get; }` | `ParameterTypeId.ImportAdtEntityHeight` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityLength { get; }` | `ParameterTypeId.ImportAdtEntityLength` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityRoll { get; }` | `ParameterTypeId.ImportAdtEntityRoll` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityStructType { get; }` | `ParameterTypeId.ImportAdtEntityStructType` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityStyle { get; }` | `ParameterTypeId.ImportAdtEntityStyle` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityThickness { get; }` | `ParameterTypeId.ImportAdtEntityThickness` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityType { get; }` | `ParameterTypeId.ImportAdtEntityType` | ForgeTypeId |
| `ForgeTypeId ImportAdtEntityWidth { get; }` | `ParameterTypeId.ImportAdtEntityWidth` | ForgeTypeId |
| `ForgeTypeId ImportBackground { get; }` | `ParameterTypeId.ImportBackground` | ForgeTypeId |
| `ForgeTypeId ImportBaseLevel { get; }` | `ParameterTypeId.ImportBaseLevel` | ForgeTypeId |
| `ForgeTypeId ImportBaseLevelOffset { get; }` | `ParameterTypeId.ImportBaseLevelOffset` | ForgeTypeId |
| `ForgeTypeId ImportDisplayUnits { get; }` | `ParameterTypeId.ImportDisplayUnits` | ForgeTypeId |
| `ForgeTypeId ImportInstanceCuttingInView { get; }` | `ParameterTypeId.ImportInstanceCuttingInView` | ForgeTypeId |
| `ForgeTypeId ImportInstanceScale { get; }` | `ParameterTypeId.ImportInstanceScale` | ForgeTypeId |
| `ForgeTypeId ImportScale { get; }` | `ParameterTypeId.ImportScale` | ForgeTypeId |
| `ForgeTypeId ImportSymbolName { get; }` | `ParameterTypeId.ImportSymbolName` | ForgeTypeId |
| `ForgeTypeId IndividualExcavationVolume { get; }` | `ParameterTypeId.IndividualExcavationVolume` | ForgeTypeId |
| `ForgeTypeId InfrastructureAlignmentDescription { get; }` | `ParameterTypeId.InfrastructureAlignmentDescription` | ForgeTypeId |
| `ForgeTypeId InfrastructureAlignmentDisplayedEndStation { get; }` | `ParameterTypeId.InfrastructureAlignmentDisplayedEndStation` | ForgeTypeId |
| `ForgeTypeId InfrastructureAlignmentDisplayedStartStation { get; }` | `ParameterTypeId.InfrastructureAlignmentDisplayedStartStation` | ForgeTypeId |
| `ForgeTypeId InfrastructureAlignmentName { get; }` | `ParameterTypeId.InfrastructureAlignmentName` | ForgeTypeId |
| `ForgeTypeId InsertOrientation { get; }` | `ParameterTypeId.InsertOrientation` | ForgeTypeId |
| `ForgeTypeId InstanceElevationParam { get; }` | `ParameterTypeId.InstanceElevationParam` | ForgeTypeId |
| `ForgeTypeId InstanceFreeHostOffsetParam { get; }` | `ParameterTypeId.InstanceFreeHostOffsetParam` | ForgeTypeId |
| `ForgeTypeId InstanceFreeHostParam { get; }` | `ParameterTypeId.InstanceFreeHostParam` | ForgeTypeId |
| `ForgeTypeId InstanceHeadHeightParam { get; }` | `ParameterTypeId.InstanceHeadHeightParam` | ForgeTypeId |
| `ForgeTypeId InstanceLengthParam { get; }` | `ParameterTypeId.InstanceLengthParam` | ForgeTypeId |
| `ForgeTypeId InstanceMoveBaseWithGrids { get; }` | `ParameterTypeId.InstanceMoveBaseWithGrids` | ForgeTypeId |
| `ForgeTypeId InstanceMovesWithGridParam { get; }` | `ParameterTypeId.InstanceMovesWithGridParam` | ForgeTypeId |
| `ForgeTypeId InstanceMoveTopWithGrids { get; }` | `ParameterTypeId.InstanceMoveTopWithGrids` | ForgeTypeId |
| `ForgeTypeId InstanceOffsetPosParam { get; }` | `ParameterTypeId.InstanceOffsetPosParam` | ForgeTypeId |
| `ForgeTypeId InstanceReferenceLevelParam { get; }` | `ParameterTypeId.InstanceReferenceLevelParam` | ForgeTypeId |
| `ForgeTypeId InstanceScheduleOnlyLevelParam { get; }` | `ParameterTypeId.InstanceScheduleOnlyLevelParam` | ForgeTypeId |
| `ForgeTypeId InstanceSillHeightParam { get; }` | `ParameterTypeId.InstanceSillHeightParam` | ForgeTypeId |
| `ForgeTypeId InstanceStructUsageParam { get; }` | `ParameterTypeId.InstanceStructUsageParam` | ForgeTypeId |
| `ForgeTypeId InsulationScale { get; }` | `ParameterTypeId.InsulationScale` | ForgeTypeId |
| `ForgeTypeId InsulationWidth { get; }` | `ParameterTypeId.InsulationWidth` | ForgeTypeId |
| `ForgeTypeId InteriorTickDisplay { get; }` | `ParameterTypeId.InteriorTickDisplay` | ForgeTypeId |
| `ForgeTypeId IsVisibleParam { get; }` | `ParameterTypeId.IsVisibleParam` | ForgeTypeId |
| `ForgeTypeId JoinStrengthOrder { get; }` | `ParameterTypeId.JoinStrengthOrder` | ForgeTypeId |
| `ForgeTypeId JoistSystemClearSpacingParam { get; }` | `ParameterTypeId.JoistSystemClearSpacingParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemElemTagNewMembersView { get; }` | `ParameterTypeId.JoistSystemElemTagNewMembersView` | ForgeTypeId |
| `ForgeTypeId JoistSystemFixedSpacingParam { get; }` | `ParameterTypeId.JoistSystemFixedSpacingParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemJustificationParam { get; }` | `ParameterTypeId.JoistSystemJustificationParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemLayoutRuleParam { get; }` | `ParameterTypeId.JoistSystemLayoutRuleParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemMaximumSpacingParam { get; }` | `ParameterTypeId.JoistSystemMaximumSpacingParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemNewBeamTypeNoFamNameParam { get; }` | `ParameterTypeId.JoistSystemNewBeamTypeNoFamNameParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemNewBeamTypeParam { get; }` | `ParameterTypeId.JoistSystemNewBeamTypeParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemNumBeamsSameType { get; }` | `ParameterTypeId.JoistSystemNumBeamsSameType` | ForgeTypeId |
| `ForgeTypeId JoistSystemNumberOfLinesParam { get; }` | `ParameterTypeId.JoistSystemNumberOfLinesParam` | ForgeTypeId |
| `ForgeTypeId JoistSystemSpacingParam { get; }` | `ParameterTypeId.JoistSystemSpacingParam` | ForgeTypeId |
| `ForgeTypeId KeepReadable { get; }` | `ParameterTypeId.KeepReadable` | ForgeTypeId |
| `ForgeTypeId KeynoteNumber { get; }` | `ParameterTypeId.KeynoteNumber` | ForgeTypeId |
| `ForgeTypeId KeynoteParam { get; }` | `ParameterTypeId.KeynoteParam` | ForgeTypeId |
| `ForgeTypeId KeynoteText { get; }` | `ParameterTypeId.KeynoteText` | ForgeTypeId |
| `ForgeTypeId KeySourceParam { get; }` | `ParameterTypeId.KeySourceParam` | ForgeTypeId |
| `ForgeTypeId KeyValue { get; }` | `ParameterTypeId.KeyValue` | ForgeTypeId |
| `ForgeTypeId LayerElemAreaComputed { get; }` | `ParameterTypeId.LayerElemAreaComputed` | ForgeTypeId |
| `ForgeTypeId LayerElemBaseConstraint { get; }` | `ParameterTypeId.LayerElemBaseConstraint` | ForgeTypeId |
| `ForgeTypeId LayerElemBaseExtensionDis { get; }` | `ParameterTypeId.LayerElemBaseExtensionDis` | ForgeTypeId |
| `ForgeTypeId LayerElemCompoundElemFamily { get; }` | `ParameterTypeId.LayerElemCompoundElemFamily` | ForgeTypeId |
| `ForgeTypeId LayerElemCompoundElemType { get; }` | `ParameterTypeId.LayerElemCompoundElemType` | ForgeTypeId |
| `ForgeTypeId LayerElemFunction { get; }` | `ParameterTypeId.LayerElemFunction` | ForgeTypeId |
| `ForgeTypeId LayerElemIsCoreLayer { get; }` | `ParameterTypeId.LayerElemIsCoreLayer` | ForgeTypeId |
| `ForgeTypeId LayerElemIsStructuralMaterial { get; }` | `ParameterTypeId.LayerElemIsStructuralMaterial` | ForgeTypeId |
| `ForgeTypeId LayerElemIsVariable { get; }` | `ParameterTypeId.LayerElemIsVariable` | ForgeTypeId |
| `ForgeTypeId LayerElemMaterials { get; }` | `ParameterTypeId.LayerElemMaterials` | ForgeTypeId |
| `ForgeTypeId LayerElemOffsetFromHost { get; }` | `ParameterTypeId.LayerElemOffsetFromHost` | ForgeTypeId |
| `ForgeTypeId LayerElemScheduleFamily { get; }` | `ParameterTypeId.LayerElemScheduleFamily` | ForgeTypeId |
| `ForgeTypeId LayerElemThickness { get; }` | `ParameterTypeId.LayerElemThickness` | ForgeTypeId |
| `ForgeTypeId LayerElemTopConstraint { get; }` | `ParameterTypeId.LayerElemTopConstraint` | ForgeTypeId |
| `ForgeTypeId LayerElemTopExtensionDis { get; }` | `ParameterTypeId.LayerElemTopExtensionDis` | ForgeTypeId |
| `ForgeTypeId LayerElemVolumeComputed { get; }` | `ParameterTypeId.LayerElemVolumeComputed` | ForgeTypeId |
| `ForgeTypeId LayerTypeMaterials { get; }` | `ParameterTypeId.LayerTypeMaterials` | ForgeTypeId |
| `ForgeTypeId LayerTypeThickness { get; }` | `ParameterTypeId.LayerTypeThickness` | ForgeTypeId |
| `ForgeTypeId LayoutnodeCurvetypeParam { get; }` | `ParameterTypeId.LayoutnodeCurvetypeParam` | ForgeTypeId |
| `ForgeTypeId LeaderAngle { get; }` | `ParameterTypeId.LeaderAngle` | ForgeTypeId |
| `ForgeTypeId LeaderArrowhead { get; }` | `ParameterTypeId.LeaderArrowhead` | ForgeTypeId |
| `ForgeTypeId LeaderArrowWidth { get; }` | `ParameterTypeId.LeaderArrowWidth` | ForgeTypeId |
| `ForgeTypeId LeaderLeftAttachment { get; }` | `ParameterTypeId.LeaderLeftAttachment` | ForgeTypeId |
| `ForgeTypeId LeaderLength { get; }` | `ParameterTypeId.LeaderLength` | ForgeTypeId |
| `ForgeTypeId LeaderLine { get; }` | `ParameterTypeId.LeaderLine` | ForgeTypeId |
| `ForgeTypeId LeaderOffsetSheet { get; }` | `ParameterTypeId.LeaderOffsetSheet` | ForgeTypeId |
| `ForgeTypeId LeaderOrientation { get; }` | `ParameterTypeId.LeaderOrientation` | ForgeTypeId |
| `ForgeTypeId LeaderRightAttachment { get; }` | `ParameterTypeId.LeaderRightAttachment` | ForgeTypeId |
| `ForgeTypeId LegendComponent { get; }` | `ParameterTypeId.LegendComponent` | ForgeTypeId |
| `ForgeTypeId LegendComponentDetailLevel { get; }` | `ParameterTypeId.LegendComponentDetailLevel` | ForgeTypeId |
| `ForgeTypeId LegendComponentLength { get; }` | `ParameterTypeId.LegendComponentLength` | ForgeTypeId |
| `ForgeTypeId LegendComponentView { get; }` | `ParameterTypeId.LegendComponentView` | ForgeTypeId |
| `ForgeTypeId LevelAttrRoomComputationAutomatic { get; }` | `ParameterTypeId.LevelAttrRoomComputationAutomatic` | ForgeTypeId |
| `ForgeTypeId LevelAttrRoomComputationHeight { get; }` | `ParameterTypeId.LevelAttrRoomComputationHeight` | ForgeTypeId |
| `ForgeTypeId LevelDataFloorArea { get; }` | `ParameterTypeId.LevelDataFloorArea` | ForgeTypeId |
| `ForgeTypeId LevelDataFloorPerimeter { get; }` | `ParameterTypeId.LevelDataFloorPerimeter` | ForgeTypeId |
| `ForgeTypeId LevelDataMassFamilyAndTypeParam { get; }` | `ParameterTypeId.LevelDataMassFamilyAndTypeParam` | ForgeTypeId |
| `ForgeTypeId LevelDataMassFamilyParam { get; }` | `ParameterTypeId.LevelDataMassFamilyParam` | ForgeTypeId |
| `ForgeTypeId LevelDataMassInstanceComments { get; }` | `ParameterTypeId.LevelDataMassInstanceComments` | ForgeTypeId |
| `ForgeTypeId LevelDataMassTypeComments { get; }` | `ParameterTypeId.LevelDataMassTypeComments` | ForgeTypeId |
| `ForgeTypeId LevelDataMassTypeDescription { get; }` | `ParameterTypeId.LevelDataMassTypeDescription` | ForgeTypeId |
| `ForgeTypeId LevelDataMassTypeParam { get; }` | `ParameterTypeId.LevelDataMassTypeParam` | ForgeTypeId |
| `ForgeTypeId LevelDataOwningLevel { get; }` | `ParameterTypeId.LevelDataOwningLevel` | ForgeTypeId |
| `ForgeTypeId LevelDataSpaceUsage { get; }` | `ParameterTypeId.LevelDataSpaceUsage` | ForgeTypeId |
| `ForgeTypeId LevelDataSurfaceArea { get; }` | `ParameterTypeId.LevelDataSurfaceArea` | ForgeTypeId |
| `ForgeTypeId LevelDataVolume { get; }` | `ParameterTypeId.LevelDataVolume` | ForgeTypeId |
| `ForgeTypeId LevelElev { get; }` | `ParameterTypeId.LevelElev` | ForgeTypeId |
| `ForgeTypeId LevelHeadTag { get; }` | `ParameterTypeId.LevelHeadTag` | ForgeTypeId |
| `ForgeTypeId LevelIsBuildingStory { get; }` | `ParameterTypeId.LevelIsBuildingStory` | ForgeTypeId |
| `ForgeTypeId LevelIsGroundPlane { get; }` | `ParameterTypeId.LevelIsGroundPlane` | ForgeTypeId |
| `ForgeTypeId LevelIsStructural { get; }` | `ParameterTypeId.LevelIsStructural` | ForgeTypeId |
| `ForgeTypeId LevelName { get; }` | `ParameterTypeId.LevelName` | ForgeTypeId |
| `ForgeTypeId LevelParam { get; }` | `ParameterTypeId.LevelParam` | ForgeTypeId |
| `ForgeTypeId LevelRelativeBaseType { get; }` | `ParameterTypeId.LevelRelativeBaseType` | ForgeTypeId |
| `ForgeTypeId LevelRoomComputationHeight { get; }` | `ParameterTypeId.LevelRoomComputationHeight` | ForgeTypeId |
| `ForgeTypeId LevelUpToLevel { get; }` | `ParameterTypeId.LevelUpToLevel` | ForgeTypeId |
| `ForgeTypeId LightingFixtureLamp { get; }` | `ParameterTypeId.LightingFixtureLamp` | ForgeTypeId |
| `ForgeTypeId LightingFixtureLightEmitter { get; }` | `ParameterTypeId.LightingFixtureLightEmitter` | ForgeTypeId |
| `ForgeTypeId LightingFixtureWattage { get; }` | `ParameterTypeId.LightingFixtureWattage` | ForgeTypeId |
| `ForgeTypeId LinearDimType { get; }` | `ParameterTypeId.LinearDimType` | ForgeTypeId |
| `ForgeTypeId LinearFramingLength { get; }` | `ParameterTypeId.LinearFramingLength` | ForgeTypeId |
| `ForgeTypeId LineColor { get; }` | `ParameterTypeId.LineColor` | ForgeTypeId |
| `ForgeTypeId LinePattern { get; }` | `ParameterTypeId.LinePattern` | ForgeTypeId |
| `ForgeTypeId LinePen { get; }` | `ParameterTypeId.LinePen` | ForgeTypeId |
| `ForgeTypeId LineShapeAtCorner { get; }` | `ParameterTypeId.LineShapeAtCorner` | ForgeTypeId |
| `ForgeTypeId LoadAllNon0Loads { get; }` | `ParameterTypeId.LoadAllNon0Loads` | ForgeTypeId |
| `ForgeTypeId LoadAreaArea { get; }` | `ParameterTypeId.LoadAreaArea` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFx1 { get; }` | `ParameterTypeId.LoadAreaForceFx1` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFx2 { get; }` | `ParameterTypeId.LoadAreaForceFx2` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFx3 { get; }` | `ParameterTypeId.LoadAreaForceFx3` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFy1 { get; }` | `ParameterTypeId.LoadAreaForceFy1` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFy2 { get; }` | `ParameterTypeId.LoadAreaForceFy2` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFy3 { get; }` | `ParameterTypeId.LoadAreaForceFy3` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFz1 { get; }` | `ParameterTypeId.LoadAreaForceFz1` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFz2 { get; }` | `ParameterTypeId.LoadAreaForceFz2` | ForgeTypeId |
| `ForgeTypeId LoadAreaForceFz3 { get; }` | `ParameterTypeId.LoadAreaForceFz3` | ForgeTypeId |
| `ForgeTypeId LoadAreaIsProjected { get; }` | `ParameterTypeId.LoadAreaIsProjected` | ForgeTypeId |
| `ForgeTypeId LoadArrowSeparation { get; }` | `ParameterTypeId.LoadArrowSeparation` | ForgeTypeId |
| `ForgeTypeId LoadAttrAreaForceScaleFactor { get; }` | `ParameterTypeId.LoadAttrAreaForceScaleFactor` | ForgeTypeId |
| `ForgeTypeId LoadAttrForceArrowType { get; }` | `ParameterTypeId.LoadAttrForceArrowType` | ForgeTypeId |
| `ForgeTypeId LoadAttrForceScaleFactor { get; }` | `ParameterTypeId.LoadAttrForceScaleFactor` | ForgeTypeId |
| `ForgeTypeId LoadAttrLinearForceScaleFactor { get; }` | `ParameterTypeId.LoadAttrLinearForceScaleFactor` | ForgeTypeId |
| `ForgeTypeId LoadAttrMomentArrowArc { get; }` | `ParameterTypeId.LoadAttrMomentArrowArc` | ForgeTypeId |
| `ForgeTypeId LoadAttrMomentArrowLine { get; }` | `ParameterTypeId.LoadAttrMomentArrowLine` | ForgeTypeId |
| `ForgeTypeId LoadAttrMomentScaleFactor { get; }` | `ParameterTypeId.LoadAttrMomentScaleFactor` | ForgeTypeId |
| `ForgeTypeId LoadCaseId { get; }` | `ParameterTypeId.LoadCaseId` | ForgeTypeId |
| `ForgeTypeId LoadCaseName { get; }` | `ParameterTypeId.LoadCaseName` | ForgeTypeId |
| `ForgeTypeId LoadCaseNature { get; }` | `ParameterTypeId.LoadCaseNature` | ForgeTypeId |
| `ForgeTypeId LoadCaseNatureText { get; }` | `ParameterTypeId.LoadCaseNatureText` | ForgeTypeId |
| `ForgeTypeId LoadCaseNumber { get; }` | `ParameterTypeId.LoadCaseNumber` | ForgeTypeId |
| `ForgeTypeId LoadCaseSubcategory { get; }` | `ParameterTypeId.LoadCaseSubcategory` | ForgeTypeId |
| `ForgeTypeId LoadCombinationFactor { get; }` | `ParameterTypeId.LoadCombinationFactor` | ForgeTypeId |
| `ForgeTypeId LoadCombinationName { get; }` | `ParameterTypeId.LoadCombinationName` | ForgeTypeId |
| `ForgeTypeId LoadComments { get; }` | `ParameterTypeId.LoadComments` | ForgeTypeId |
| `ForgeTypeId LoadDescription { get; }` | `ParameterTypeId.LoadDescription` | ForgeTypeId |
| `ForgeTypeId LoadForceFx { get; }` | `ParameterTypeId.LoadForceFx` | ForgeTypeId |
| `ForgeTypeId LoadForceFy { get; }` | `ParameterTypeId.LoadForceFy` | ForgeTypeId |
| `ForgeTypeId LoadForceFz { get; }` | `ParameterTypeId.LoadForceFz` | ForgeTypeId |
| `ForgeTypeId LoadIsConstrainedOnHost { get; }` | `ParameterTypeId.LoadIsConstrainedOnHost` | ForgeTypeId |
| `ForgeTypeId LoadIsHosted { get; }` | `ParameterTypeId.LoadIsHosted` | ForgeTypeId |
| `ForgeTypeId LoadIsProjected { get; }` | `ParameterTypeId.LoadIsProjected` | ForgeTypeId |
| `ForgeTypeId LoadIsReaction { get; }` | `ParameterTypeId.LoadIsReaction` | ForgeTypeId |
| `ForgeTypeId LoadIsUniform { get; }` | `ParameterTypeId.LoadIsUniform` | ForgeTypeId |
| `ForgeTypeId LoadLinearForceFx1 { get; }` | `ParameterTypeId.LoadLinearForceFx1` | ForgeTypeId |
| `ForgeTypeId LoadLinearForceFx2 { get; }` | `ParameterTypeId.LoadLinearForceFx2` | ForgeTypeId |
| `ForgeTypeId LoadLinearForceFy1 { get; }` | `ParameterTypeId.LoadLinearForceFy1` | ForgeTypeId |
| `ForgeTypeId LoadLinearForceFy2 { get; }` | `ParameterTypeId.LoadLinearForceFy2` | ForgeTypeId |
| `ForgeTypeId LoadLinearForceFz1 { get; }` | `ParameterTypeId.LoadLinearForceFz1` | ForgeTypeId |
| `ForgeTypeId LoadLinearForceFz2 { get; }` | `ParameterTypeId.LoadLinearForceFz2` | ForgeTypeId |
| `ForgeTypeId LoadLinearLength { get; }` | `ParameterTypeId.LoadLinearLength` | ForgeTypeId |
| `ForgeTypeId LoadMomentMx { get; }` | `ParameterTypeId.LoadMomentMx` | ForgeTypeId |
| `ForgeTypeId LoadMomentMx1 { get; }` | `ParameterTypeId.LoadMomentMx1` | ForgeTypeId |
| `ForgeTypeId LoadMomentMx2 { get; }` | `ParameterTypeId.LoadMomentMx2` | ForgeTypeId |
| `ForgeTypeId LoadMomentMy { get; }` | `ParameterTypeId.LoadMomentMy` | ForgeTypeId |
| `ForgeTypeId LoadMomentMy1 { get; }` | `ParameterTypeId.LoadMomentMy1` | ForgeTypeId |
| `ForgeTypeId LoadMomentMy2 { get; }` | `ParameterTypeId.LoadMomentMy2` | ForgeTypeId |
| `ForgeTypeId LoadMomentMz { get; }` | `ParameterTypeId.LoadMomentMz` | ForgeTypeId |
| `ForgeTypeId LoadMomentMz1 { get; }` | `ParameterTypeId.LoadMomentMz1` | ForgeTypeId |
| `ForgeTypeId LoadMomentMz2 { get; }` | `ParameterTypeId.LoadMomentMz2` | ForgeTypeId |
| `ForgeTypeId LoadNatureName { get; }` | `ParameterTypeId.LoadNatureName` | ForgeTypeId |
| `ForgeTypeId LoadUsageName { get; }` | `ParameterTypeId.LoadUsageName` | ForgeTypeId |
| `ForgeTypeId LoadUseLocalCoordinateSystem { get; }` | `ParameterTypeId.LoadUseLocalCoordinateSystem` | ForgeTypeId |
| `ForgeTypeId LockAlignmentUiToggle { get; }` | `ParameterTypeId.LockAlignmentUiToggle` | ForgeTypeId |
| `ForgeTypeId LockedBaseOffset { get; }` | `ParameterTypeId.LockedBaseOffset` | ForgeTypeId |
| `ForgeTypeId LockedEndOffset { get; }` | `ParameterTypeId.LockedEndOffset` | ForgeTypeId |
| `ForgeTypeId LockedStartOffset { get; }` | `ParameterTypeId.LockedStartOffset` | ForgeTypeId |
| `ForgeTypeId LockedTopOffset { get; }` | `ParameterTypeId.LockedTopOffset` | ForgeTypeId |
| `ForgeTypeId LowestAssociatedLevel { get; }` | `ParameterTypeId.LowestAssociatedLevel` | ForgeTypeId |
| `ForgeTypeId LvMullionLeg1 { get; }` | `ParameterTypeId.LvMullionLeg1` | ForgeTypeId |
| `ForgeTypeId LvMullionLeg2 { get; }` | `ParameterTypeId.LvMullionLeg2` | ForgeTypeId |
| `ForgeTypeId MarkupsCreated { get; }` | `ParameterTypeId.MarkupsCreated` | ForgeTypeId |
| `ForgeTypeId MarkupsCreator { get; }` | `ParameterTypeId.MarkupsCreator` | ForgeTypeId |
| `ForgeTypeId MarkupsHistory { get; }` | `ParameterTypeId.MarkupsHistory` | ForgeTypeId |
| `ForgeTypeId MarkupsLabel { get; }` | `ParameterTypeId.MarkupsLabel` | ForgeTypeId |
| `ForgeTypeId MarkupsModified { get; }` | `ParameterTypeId.MarkupsModified` | ForgeTypeId |
| `ForgeTypeId MarkupsNotes { get; }` | `ParameterTypeId.MarkupsNotes` | ForgeTypeId |
| `ForgeTypeId MarkupsPrivate { get; }` | `ParameterTypeId.MarkupsPrivate` | ForgeTypeId |
| `ForgeTypeId MarkupsStatus { get; }` | `ParameterTypeId.MarkupsStatus` | ForgeTypeId |
| `ForgeTypeId MassDataConceptualConstruction { get; }` | `ParameterTypeId.MassDataConceptualConstruction` | ForgeTypeId |
| `ForgeTypeId MassDataGlazingIsShaded { get; }` | `ParameterTypeId.MassDataGlazingIsShaded` | ForgeTypeId |
| `ForgeTypeId MassDataMassExteriorWallArea { get; }` | `ParameterTypeId.MassDataMassExteriorWallArea` | ForgeTypeId |
| `ForgeTypeId MassDataMassInteriorWallArea { get; }` | `ParameterTypeId.MassDataMassInteriorWallArea` | ForgeTypeId |
| `ForgeTypeId MassDataMassOpeningArea { get; }` | `ParameterTypeId.MassDataMassOpeningArea` | ForgeTypeId |
| `ForgeTypeId MassDataMassRoofArea { get; }` | `ParameterTypeId.MassDataMassRoofArea` | ForgeTypeId |
| `ForgeTypeId MassDataMassSkylightArea { get; }` | `ParameterTypeId.MassDataMassSkylightArea` | ForgeTypeId |
| `ForgeTypeId MassDataMassWindowArea { get; }` | `ParameterTypeId.MassDataMassWindowArea` | ForgeTypeId |
| `ForgeTypeId MassDataPercentageGlazing { get; }` | `ParameterTypeId.MassDataPercentageGlazing` | ForgeTypeId |
| `ForgeTypeId MassDataPercentageSkylights { get; }` | `ParameterTypeId.MassDataPercentageSkylights` | ForgeTypeId |
| `ForgeTypeId MassDataShadeDepth { get; }` | `ParameterTypeId.MassDataShadeDepth` | ForgeTypeId |
| `ForgeTypeId MassDataSillHeight { get; }` | `ParameterTypeId.MassDataSillHeight` | ForgeTypeId |
| `ForgeTypeId MassDataSkylightWidth { get; }` | `ParameterTypeId.MassDataSkylightWidth` | ForgeTypeId |
| `ForgeTypeId MassDataSlab { get; }` | `ParameterTypeId.MassDataSlab` | ForgeTypeId |
| `ForgeTypeId MassDataSubcategory { get; }` | `ParameterTypeId.MassDataSubcategory` | ForgeTypeId |
| `ForgeTypeId MassDataSurfaceDataSource { get; }` | `ParameterTypeId.MassDataSurfaceDataSource` | ForgeTypeId |
| `ForgeTypeId MassDataUnderground { get; }` | `ParameterTypeId.MassDataUnderground` | ForgeTypeId |
| `ForgeTypeId MassFloorAreaLevels { get; }` | `ParameterTypeId.MassFloorAreaLevels` | ForgeTypeId |
| `ForgeTypeId MassGrossArea { get; }` | `ParameterTypeId.MassGrossArea` | ForgeTypeId |
| `ForgeTypeId MassGrossSurfaceArea { get; }` | `ParameterTypeId.MassGrossSurfaceArea` | ForgeTypeId |
| `ForgeTypeId MassGrossVolume { get; }` | `ParameterTypeId.MassGrossVolume` | ForgeTypeId |
| `ForgeTypeId MassingIntegrationLevel { get; }` | `ParameterTypeId.MassingIntegrationLevel` | ForgeTypeId |
| `ForgeTypeId MassSurfacedataMaterial { get; }` | `ParameterTypeId.MassSurfacedataMaterial` | ForgeTypeId |
| `ForgeTypeId MassZoneConditionTypeParam { get; }` | `ParameterTypeId.MassZoneConditionTypeParam` | ForgeTypeId |
| `ForgeTypeId MassZoneFloorArea { get; }` | `ParameterTypeId.MassZoneFloorArea` | ForgeTypeId |
| `ForgeTypeId MassZoneMaterial { get; }` | `ParameterTypeId.MassZoneMaterial` | ForgeTypeId |
| `ForgeTypeId MassZoneSpaceTypeParam { get; }` | `ParameterTypeId.MassZoneSpaceTypeParam` | ForgeTypeId |
| `ForgeTypeId MassZoneVolume { get; }` | `ParameterTypeId.MassZoneVolume` | ForgeTypeId |
| `ForgeTypeId MatchlineBottomOffset { get; }` | `ParameterTypeId.MatchlineBottomOffset` | ForgeTypeId |
| `ForgeTypeId MatchlineBottomPlane { get; }` | `ParameterTypeId.MatchlineBottomPlane` | ForgeTypeId |
| `ForgeTypeId MatchlineTopOffset { get; }` | `ParameterTypeId.MatchlineTopOffset` | ForgeTypeId |
| `ForgeTypeId MatchlineTopPlane { get; }` | `ParameterTypeId.MatchlineTopPlane` | ForgeTypeId |
| `ForgeTypeId MaterialArea { get; }` | `ParameterTypeId.MaterialArea` | ForgeTypeId |
| `ForgeTypeId MaterialAspaint { get; }` | `ParameterTypeId.MaterialAspaint` | ForgeTypeId |
| `ForgeTypeId MaterialAssetParamAssetLibId { get; }` | `ParameterTypeId.MaterialAssetParamAssetLibId` | ForgeTypeId |
| `ForgeTypeId MaterialAssetParamCommonSharedAsset { get; }` | `ParameterTypeId.MaterialAssetParamCommonSharedAsset` | ForgeTypeId |
| `ForgeTypeId MaterialAssetParamExternalMaterialId { get; }` | `ParameterTypeId.MaterialAssetParamExternalMaterialId` | ForgeTypeId |
| `ForgeTypeId MaterialAssetParamSource { get; }` | `ParameterTypeId.MaterialAssetParamSource` | ForgeTypeId |
| `ForgeTypeId MaterialAssetParamSourceUrl { get; }` | `ParameterTypeId.MaterialAssetParamSourceUrl` | ForgeTypeId |
| `ForgeTypeId MaterialIdParam { get; }` | `ParameterTypeId.MaterialIdParam` | ForgeTypeId |
| `ForgeTypeId MaterialName { get; }` | `ParameterTypeId.MaterialName` | ForgeTypeId |
| `ForgeTypeId MaterialParamColor { get; }` | `ParameterTypeId.MaterialParamColor` | ForgeTypeId |
| `ForgeTypeId MaterialParamGlow { get; }` | `ParameterTypeId.MaterialParamGlow` | ForgeTypeId |
| `ForgeTypeId MaterialParamShininess { get; }` | `ParameterTypeId.MaterialParamShininess` | ForgeTypeId |
| `ForgeTypeId MaterialParamSmoothness { get; }` | `ParameterTypeId.MaterialParamSmoothness` | ForgeTypeId |
| `ForgeTypeId MaterialParamTransparency { get; }` | `ParameterTypeId.MaterialParamTransparency` | ForgeTypeId |
| `ForgeTypeId MaterialVolume { get; }` | `ParameterTypeId.MaterialVolume` | ForgeTypeId |
| `ForgeTypeId MeasureFromStructure { get; }` | `ParameterTypeId.MeasureFromStructure` | ForgeTypeId |
| `ForgeTypeId MechanicalEquipmentSetIdParam { get; }` | `ParameterTypeId.MechanicalEquipmentSetIdParam` | ForgeTypeId |
| `ForgeTypeId MechanicalEquipmentSetName { get; }` | `ParameterTypeId.MechanicalEquipmentSetName` | ForgeTypeId |
| `ForgeTypeId MechanicalEquipmentSetOnDuty { get; }` | `ParameterTypeId.MechanicalEquipmentSetOnDuty` | ForgeTypeId |
| `ForgeTypeId MechanicalEquipmentSetOnStandby { get; }` | `ParameterTypeId.MechanicalEquipmentSetOnStandby` | ForgeTypeId |
| `ForgeTypeId MepAirloopFantype { get; }` | `ParameterTypeId.MepAirloopFantype` | ForgeTypeId |
| `ForgeTypeId MepAirloopHeatexchangerType { get; }` | `ParameterTypeId.MepAirloopHeatexchangerType` | ForgeTypeId |
| `ForgeTypeId MepAirloopPreheatCoiltype { get; }` | `ParameterTypeId.MepAirloopPreheatCoiltype` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalCriticalpathParam { get; }` | `ParameterTypeId.MepAnalyticalCriticalpathParam` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalCriticalsequence { get; }` | `ParameterTypeId.MepAnalyticalCriticalsequence` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalElecApparentPowerRating { get; }` | `ParameterTypeId.MepAnalyticalElecApparentPowerRating` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalElecCurrent { get; }` | `ParameterTypeId.MepAnalyticalElecCurrent` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalElecCurrentRating { get; }` | `ParameterTypeId.MepAnalyticalElecCurrentRating` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalElecVoltage { get; }` | `ParameterTypeId.MepAnalyticalElecVoltage` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalEquipmentName { get; }` | `ParameterTypeId.MepAnalyticalEquipmentName` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalHeadersegment { get; }` | `ParameterTypeId.MepAnalyticalHeadersegment` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalHydraulicloop { get; }` | `ParameterTypeId.MepAnalyticalHydraulicloop` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalLoopBoundaryParam { get; }` | `ParameterTypeId.MepAnalyticalLoopBoundaryParam` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalLoopName { get; }` | `ParameterTypeId.MepAnalyticalLoopName` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalNetwork { get; }` | `ParameterTypeId.MepAnalyticalNetwork` | ForgeTypeId |
| `ForgeTypeId MepAnalyticalPipeDesignflow { get; }` | `ParameterTypeId.MepAnalyticalPipeDesignflow` | ForgeTypeId |
| `ForgeTypeId MepChilledWaterLoop { get; }` | `ParameterTypeId.MepChilledWaterLoop` | ForgeTypeId |
| `ForgeTypeId MepCondenserWaterLoop { get; }` | `ParameterTypeId.MepCondenserWaterLoop` | ForgeTypeId |
| `ForgeTypeId MepCoolingCoilType { get; }` | `ParameterTypeId.MepCoolingCoilType` | ForgeTypeId |
| `ForgeTypeId MepElecZoneEquipmentType { get; }` | `ParameterTypeId.MepElecZoneEquipmentType` | ForgeTypeId |
| `ForgeTypeId MepEquipmentCalcPipingflowParam { get; }` | `ParameterTypeId.MepEquipmentCalcPipingflowParam` | ForgeTypeId |
| `ForgeTypeId MepEquipmentCalcPipingpressuredropParam { get; }` | `ParameterTypeId.MepEquipmentCalcPipingpressuredropParam` | ForgeTypeId |
| `ForgeTypeId MepEquipmentClassification { get; }` | `ParameterTypeId.MepEquipmentClassification` | ForgeTypeId |
| `ForgeTypeId MepHeatingCoilType { get; }` | `ParameterTypeId.MepHeatingCoilType` | ForgeTypeId |
| `ForgeTypeId MepHeatingHotwaterLoop { get; }` | `ParameterTypeId.MepHeatingHotwaterLoop` | ForgeTypeId |
| `ForgeTypeId MepIgnoreFlowAnalysis { get; }` | `ParameterTypeId.MepIgnoreFlowAnalysis` | ForgeTypeId |
| `ForgeTypeId MepLowerBottomElevation { get; }` | `ParameterTypeId.MepLowerBottomElevation` | ForgeTypeId |
| `ForgeTypeId MepLowerBottomElevationIncludeInsulation { get; }` | `ParameterTypeId.MepLowerBottomElevationIncludeInsulation` | ForgeTypeId |
| `ForgeTypeId MepLowerCenterlineElevation { get; }` | `ParameterTypeId.MepLowerCenterlineElevation` | ForgeTypeId |
| `ForgeTypeId MepLowerTopElevation { get; }` | `ParameterTypeId.MepLowerTopElevation` | ForgeTypeId |
| `ForgeTypeId MepLowerTopElevationIncludeInsulation { get; }` | `ParameterTypeId.MepLowerTopElevationIncludeInsulation` | ForgeTypeId |
| `ForgeTypeId MepPipeLowerInvertElevation { get; }` | `ParameterTypeId.MepPipeLowerInvertElevation` | ForgeTypeId |
| `ForgeTypeId MepPipeLowerObvertElevation { get; }` | `ParameterTypeId.MepPipeLowerObvertElevation` | ForgeTypeId |
| `ForgeTypeId MepPipeUpperInvertElevation { get; }` | `ParameterTypeId.MepPipeUpperInvertElevation` | ForgeTypeId |
| `ForgeTypeId MepPipeUpperObvertElevation { get; }` | `ParameterTypeId.MepPipeUpperObvertElevation` | ForgeTypeId |
| `ForgeTypeId MepPreheatHotwaterLoop { get; }` | `ParameterTypeId.MepPreheatHotwaterLoop` | ForgeTypeId |
| `ForgeTypeId MepProfileTypeParam { get; }` | `ParameterTypeId.MepProfileTypeParam` | ForgeTypeId |
| `ForgeTypeId MepReheatCoilType { get; }` | `ParameterTypeId.MepReheatCoilType` | ForgeTypeId |
| `ForgeTypeId MepReheatHotwaterLoop { get; }` | `ParameterTypeId.MepReheatHotwaterLoop` | ForgeTypeId |
| `ForgeTypeId MepSegmentElementTypename { get; }` | `ParameterTypeId.MepSegmentElementTypename` | ForgeTypeId |
| `ForgeTypeId MepSegmentFamilyname { get; }` | `ParameterTypeId.MepSegmentFamilyname` | ForgeTypeId |
| `ForgeTypeId MepSegmentLength { get; }` | `ParameterTypeId.MepSegmentLength` | ForgeTypeId |
| `ForgeTypeId MepSegmentSystemorservice { get; }` | `ParameterTypeId.MepSegmentSystemorservice` | ForgeTypeId |
| `ForgeTypeId MepSpotBottomElevation { get; }` | `ParameterTypeId.MepSpotBottomElevation` | ForgeTypeId |
| `ForgeTypeId MepSpotBottomElevationIncludeInsulation { get; }` | `ParameterTypeId.MepSpotBottomElevationIncludeInsulation` | ForgeTypeId |
| `ForgeTypeId MepSpotCenterlineElevation { get; }` | `ParameterTypeId.MepSpotCenterlineElevation` | ForgeTypeId |
| `ForgeTypeId MepSpotTopElevation { get; }` | `ParameterTypeId.MepSpotTopElevation` | ForgeTypeId |
| `ForgeTypeId MepSpotTopElevationIncludeInsulation { get; }` | `ParameterTypeId.MepSpotTopElevationIncludeInsulation` | ForgeTypeId |
| `ForgeTypeId MepSystemFillGraphicsOverridesParam { get; }` | `ParameterTypeId.MepSystemFillGraphicsOverridesParam` | ForgeTypeId |
| `ForgeTypeId MepSystemLineGraphicsOverridesParam { get; }` | `ParameterTypeId.MepSystemLineGraphicsOverridesParam` | ForgeTypeId |
| `ForgeTypeId MepUpperBottomElevation { get; }` | `ParameterTypeId.MepUpperBottomElevation` | ForgeTypeId |
| `ForgeTypeId MepUpperBottomElevationIncludeInsulation { get; }` | `ParameterTypeId.MepUpperBottomElevationIncludeInsulation` | ForgeTypeId |
| `ForgeTypeId MepUpperCenterlineElevation { get; }` | `ParameterTypeId.MepUpperCenterlineElevation` | ForgeTypeId |
| `ForgeTypeId MepUpperTopElevation { get; }` | `ParameterTypeId.MepUpperTopElevation` | ForgeTypeId |
| `ForgeTypeId MepUpperTopElevationIncludeInsulation { get; }` | `ParameterTypeId.MepUpperTopElevationIncludeInsulation` | ForgeTypeId |
| `ForgeTypeId MepVrfLoop { get; }` | `ParameterTypeId.MepVrfLoop` | ForgeTypeId |
| `ForgeTypeId MepWaterloopChillertype { get; }` | `ParameterTypeId.MepWaterloopChillertype` | ForgeTypeId |
| `ForgeTypeId MepWaterloopType { get; }` | `ParameterTypeId.MepWaterloopType` | ForgeTypeId |
| `ForgeTypeId MepZoneAirLoop { get; }` | `ParameterTypeId.MepZoneAirLoop` | ForgeTypeId |
| `ForgeTypeId MepZoneEquipment { get; }` | `ParameterTypeId.MepZoneEquipment` | ForgeTypeId |
| `ForgeTypeId MepZoneEquipmentBehavior { get; }` | `ParameterTypeId.MepZoneEquipmentBehavior` | ForgeTypeId |
| `ForgeTypeId MepZoneEquipmentDrawVentilation { get; }` | `ParameterTypeId.MepZoneEquipmentDrawVentilation` | ForgeTypeId |
| `ForgeTypeId MepZoneEquipmentType { get; }` | `ParameterTypeId.MepZoneEquipmentType` | ForgeTypeId |
| `ForgeTypeId MepZoneHotwaterLoop { get; }` | `ParameterTypeId.MepZoneHotwaterLoop` | ForgeTypeId |
| `ForgeTypeId ModelCategoryIdParam { get; }` | `ParameterTypeId.ModelCategoryIdParam` | ForgeTypeId |
| `ForgeTypeId ModelGraphicsStyle { get; }` | `ParameterTypeId.ModelGraphicsStyle` | ForgeTypeId |
| `ForgeTypeId ModelGraphicsStyleAnonDraft { get; }` | `ParameterTypeId.ModelGraphicsStyleAnonDraft` | ForgeTypeId |
| `ForgeTypeId ModelOrSymbolic { get; }` | `ParameterTypeId.ModelOrSymbolic` | ForgeTypeId |
| `ForgeTypeId ModelTextSize { get; }` | `ParameterTypeId.ModelTextSize` | ForgeTypeId |
| `ForgeTypeId MovesWithGridParam { get; }` | `ParameterTypeId.MovesWithGridParam` | ForgeTypeId |
| `ForgeTypeId MullionAngle { get; }` | `ParameterTypeId.MullionAngle` | ForgeTypeId |
| `ForgeTypeId MullionCornerType { get; }` | `ParameterTypeId.MullionCornerType` | ForgeTypeId |
| `ForgeTypeId MullionDepth { get; }` | `ParameterTypeId.MullionDepth` | ForgeTypeId |
| `ForgeTypeId MullionDepth1 { get; }` | `ParameterTypeId.MullionDepth1` | ForgeTypeId |
| `ForgeTypeId MullionDepth2 { get; }` | `ParameterTypeId.MullionDepth2` | ForgeTypeId |
| `ForgeTypeId MullionFamType { get; }` | `ParameterTypeId.MullionFamType` | ForgeTypeId |
| `ForgeTypeId MullionOffset { get; }` | `ParameterTypeId.MullionOffset` | ForgeTypeId |
| `ForgeTypeId MullionPosition { get; }` | `ParameterTypeId.MullionPosition` | ForgeTypeId |
| `ForgeTypeId MullionProfile { get; }` | `ParameterTypeId.MullionProfile` | ForgeTypeId |
| `ForgeTypeId MultipleAlignmentUiToggle { get; }` | `ParameterTypeId.MultipleAlignmentUiToggle` | ForgeTypeId |
| `ForgeTypeId MultiReferenceAnnotationDimensionStyle { get; }` | `ParameterTypeId.MultiReferenceAnnotationDimensionStyle` | ForgeTypeId |
| `ForgeTypeId MultiReferenceAnnotationGroupTagHeads { get; }` | `ParameterTypeId.MultiReferenceAnnotationGroupTagHeads` | ForgeTypeId |
| `ForgeTypeId MultiReferenceAnnotationReferenceCategory { get; }` | `ParameterTypeId.MultiReferenceAnnotationReferenceCategory` | ForgeTypeId |
| `ForgeTypeId MultiReferenceAnnotationShowDimensionText { get; }` | `ParameterTypeId.MultiReferenceAnnotationShowDimensionText` | ForgeTypeId |
| `ForgeTypeId MultiReferenceAnnotationTagType { get; }` | `ParameterTypeId.MultiReferenceAnnotationTagType` | ForgeTypeId |
| `ForgeTypeId MultistoryStairsActualTreadDepth { get; }` | `ParameterTypeId.MultistoryStairsActualTreadDepth` | ForgeTypeId |
| `ForgeTypeId MultistoryStairsRefLevel { get; }` | `ParameterTypeId.MultistoryStairsRefLevel` | ForgeTypeId |
| `ForgeTypeId NodeConnectionStatus { get; }` | `ParameterTypeId.NodeConnectionStatus` | ForgeTypeId |
| `ForgeTypeId NumberPartitionParam { get; }` | `ParameterTypeId.NumberPartitionParam` | ForgeTypeId |
| `ForgeTypeId NumberSystemDisplayRule { get; }` | `ParameterTypeId.NumberSystemDisplayRule` | ForgeTypeId |
| `ForgeTypeId NumberSystemJustify { get; }` | `ParameterTypeId.NumberSystemJustify` | ForgeTypeId |
| `ForgeTypeId NumberSystemJustifyOffset { get; }` | `ParameterTypeId.NumberSystemJustifyOffset` | ForgeTypeId |
| `ForgeTypeId NumberSystemOrientation { get; }` | `ParameterTypeId.NumberSystemOrientation` | ForgeTypeId |
| `ForgeTypeId NumberSystemReference { get; }` | `ParameterTypeId.NumberSystemReference` | ForgeTypeId |
| `ForgeTypeId NumberSystemReferenceOffset { get; }` | `ParameterTypeId.NumberSystemReferenceOffset` | ForgeTypeId |
| `ForgeTypeId NumberSystemTagType { get; }` | `ParameterTypeId.NumberSystemTagType` | ForgeTypeId |
| `ForgeTypeId NumberSystemTextSize { get; }` | `ParameterTypeId.NumberSystemTextSize` | ForgeTypeId |
| `ForgeTypeId ObjectStyleMaterialIdParam { get; }` | `ParameterTypeId.ObjectStyleMaterialIdParam` | ForgeTypeId |
| `ForgeTypeId OffsetfacesShowShapeHandles { get; }` | `ParameterTypeId.OffsetfacesShowShapeHandles` | ForgeTypeId |
| `ForgeTypeId OffsetFromReferenceBase { get; }` | `ParameterTypeId.OffsetFromReferenceBase` | ForgeTypeId |
| `ForgeTypeId OmniclassCode { get; }` | `ParameterTypeId.OmniclassCode` | ForgeTypeId |
| `ForgeTypeId OmniclassDescription { get; }` | `ParameterTypeId.OmniclassDescription` | ForgeTypeId |
| `ForgeTypeId OptionName { get; }` | `ParameterTypeId.OptionName` | ForgeTypeId |
| `ForgeTypeId OptionSetId { get; }` | `ParameterTypeId.OptionSetId` | ForgeTypeId |
| `ForgeTypeId OptionSetName { get; }` | `ParameterTypeId.OptionSetName` | ForgeTypeId |
| `ForgeTypeId OrdinateDimSetting { get; }` | `ParameterTypeId.OrdinateDimSetting` | ForgeTypeId |
| `ForgeTypeId OrientByView { get; }` | `ParameterTypeId.OrientByView` | ForgeTypeId |
| `ForgeTypeId OriginatingElementName { get; }` | `ParameterTypeId.OriginatingElementName` | ForgeTypeId |
| `ForgeTypeId OvalFramingHeight { get; }` | `ParameterTypeId.OvalFramingHeight` | ForgeTypeId |
| `ForgeTypeId OvalFramingWidth { get; }` | `ParameterTypeId.OvalFramingWidth` | ForgeTypeId |
| `ForgeTypeId PaddingLength { get; }` | `ParameterTypeId.PaddingLength` | ForgeTypeId |
| `ForgeTypeId PanelScheduleName { get; }` | `ParameterTypeId.PanelScheduleName` | ForgeTypeId |
| `ForgeTypeId PartMakerDivisionProfileOffset { get; }` | `ParameterTypeId.PartMakerDivisionProfileOffset` | ForgeTypeId |
| `ForgeTypeId PartmakerParamDivisionGap { get; }` | `ParameterTypeId.PartmakerParamDivisionGap` | ForgeTypeId |
| `ForgeTypeId PartMakerSplitterProfile { get; }` | `ParameterTypeId.PartMakerSplitterProfile` | ForgeTypeId |
| `ForgeTypeId PartMakerSplitterProfileEdgeMatch { get; }` | `ParameterTypeId.PartMakerSplitterProfileEdgeMatch` | ForgeTypeId |
| `ForgeTypeId PartMakerSplitterProfileFlipAcross { get; }` | `ParameterTypeId.PartMakerSplitterProfileFlipAcross` | ForgeTypeId |
| `ForgeTypeId PartMakerSplitterProfileFlipAlong { get; }` | `ParameterTypeId.PartMakerSplitterProfileFlipAlong` | ForgeTypeId |
| `ForgeTypeId PathOfTravelFromRoom { get; }` | `ParameterTypeId.PathOfTravelFromRoom` | ForgeTypeId |
| `ForgeTypeId PathOfTravelLevelName { get; }` | `ParameterTypeId.PathOfTravelLevelName` | ForgeTypeId |
| `ForgeTypeId PathOfTravelSpeed { get; }` | `ParameterTypeId.PathOfTravelSpeed` | ForgeTypeId |
| `ForgeTypeId PathOfTravelTime { get; }` | `ParameterTypeId.PathOfTravelTime` | ForgeTypeId |
| `ForgeTypeId PathOfTravelToRoom { get; }` | `ParameterTypeId.PathOfTravelToRoom` | ForgeTypeId |
| `ForgeTypeId PathOfTravelViewName { get; }` | `ParameterTypeId.PathOfTravelViewName` | ForgeTypeId |
| `ForgeTypeId PathReinAddlOffset { get; }` | `ParameterTypeId.PathReinAddlOffset` | ForgeTypeId |
| `ForgeTypeId PathReinAlternating { get; }` | `ParameterTypeId.PathReinAlternating` | ForgeTypeId |
| `ForgeTypeId PathReinAltOffset { get; }` | `ParameterTypeId.PathReinAltOffset` | ForgeTypeId |
| `ForgeTypeId PathReinEndHookOrient1Slab { get; }` | `ParameterTypeId.PathReinEndHookOrient1Slab` | ForgeTypeId |
| `ForgeTypeId PathReinEndHookOrient1Wall { get; }` | `ParameterTypeId.PathReinEndHookOrient1Wall` | ForgeTypeId |
| `ForgeTypeId PathReinEndHookOrient2Slab { get; }` | `ParameterTypeId.PathReinEndHookOrient2Slab` | ForgeTypeId |
| `ForgeTypeId PathReinEndHookOrient2Wall { get; }` | `ParameterTypeId.PathReinEndHookOrient2Wall` | ForgeTypeId |
| `ForgeTypeId PathReinEndHookTypen1 { get; }` | `ParameterTypeId.PathReinEndHookTypen1` | ForgeTypeId |
| `ForgeTypeId PathReinEndHookTypen2 { get; }` | `ParameterTypeId.PathReinEndHookTypen2` | ForgeTypeId |
| `ForgeTypeId PathReinEndSpanhookAlt { get; }` | `ParameterTypeId.PathReinEndSpanhookAlt` | ForgeTypeId |
| `ForgeTypeId PathReinEndSpanhookPrim { get; }` | `ParameterTypeId.PathReinEndSpanhookPrim` | ForgeTypeId |
| `ForgeTypeId PathReinFaceSlab { get; }` | `ParameterTypeId.PathReinFaceSlab` | ForgeTypeId |
| `ForgeTypeId PathReinFaceWall { get; }` | `ParameterTypeId.PathReinFaceWall` | ForgeTypeId |
| `ForgeTypeId PathReinHookOrient1Slab { get; }` | `ParameterTypeId.PathReinHookOrient1Slab` | ForgeTypeId |
| `ForgeTypeId PathReinHookOrient1Wall { get; }` | `ParameterTypeId.PathReinHookOrient1Wall` | ForgeTypeId |
| `ForgeTypeId PathReinHookOrient2Slab { get; }` | `ParameterTypeId.PathReinHookOrient2Slab` | ForgeTypeId |
| `ForgeTypeId PathReinHookOrient2Wall { get; }` | `ParameterTypeId.PathReinHookOrient2Wall` | ForgeTypeId |
| `ForgeTypeId PathReinHookTypen1 { get; }` | `ParameterTypeId.PathReinHookTypen1` | ForgeTypeId |
| `ForgeTypeId PathReinHookTypen2 { get; }` | `ParameterTypeId.PathReinHookTypen2` | ForgeTypeId |
| `ForgeTypeId PathReinLengthn1 { get; }` | `ParameterTypeId.PathReinLengthn1` | ForgeTypeId |
| `ForgeTypeId PathReinLengthn2 { get; }` | `ParameterTypeId.PathReinLengthn2` | ForgeTypeId |
| `ForgeTypeId PathReinNumberOfBars { get; }` | `ParameterTypeId.PathReinNumberOfBars` | ForgeTypeId |
| `ForgeTypeId PathReinShapen1 { get; }` | `ParameterTypeId.PathReinShapen1` | ForgeTypeId |
| `ForgeTypeId PathReinShapen2 { get; }` | `ParameterTypeId.PathReinShapen2` | ForgeTypeId |
| `ForgeTypeId PathReinSpacing { get; }` | `ParameterTypeId.PathReinSpacing` | ForgeTypeId |
| `ForgeTypeId PathReinSpanhookAlt { get; }` | `ParameterTypeId.PathReinSpanhookAlt` | ForgeTypeId |
| `ForgeTypeId PathReinSpanhookPrim { get; }` | `ParameterTypeId.PathReinSpanhookPrim` | ForgeTypeId |
| `ForgeTypeId PathReinSpanlengthAltOffset { get; }` | `ParameterTypeId.PathReinSpanlengthAltOffset` | ForgeTypeId |
| `ForgeTypeId PathReinSpanlengthBarlengthAlt { get; }` | `ParameterTypeId.PathReinSpanlengthBarlengthAlt` | ForgeTypeId |
| `ForgeTypeId PathReinSpanlengthBarlengthPrim { get; }` | `ParameterTypeId.PathReinSpanlengthBarlengthPrim` | ForgeTypeId |
| `ForgeTypeId PathReinSpanlengthBottomAlt { get; }` | `ParameterTypeId.PathReinSpanlengthBottomAlt` | ForgeTypeId |
| `ForgeTypeId PathReinSpanlengthBottomPrim { get; }` | `ParameterTypeId.PathReinSpanlengthBottomPrim` | ForgeTypeId |
| `ForgeTypeId PathReinSpanlengthTopAlt { get; }` | `ParameterTypeId.PathReinSpanlengthTopAlt` | ForgeTypeId |
| `ForgeTypeId PathReinSummary { get; }` | `ParameterTypeId.PathReinSummary` | ForgeTypeId |
| `ForgeTypeId PathReinTypen1 { get; }` | `ParameterTypeId.PathReinTypen1` | ForgeTypeId |
| `ForgeTypeId PathReinTypen2 { get; }` | `ParameterTypeId.PathReinTypen2` | ForgeTypeId |
| `ForgeTypeId PatternIndent1ForDivisionRule { get; }` | `ParameterTypeId.PatternIndent1ForDivisionRule` | ForgeTypeId |
| `ForgeTypeId PatternIndent2ForDivisionRule { get; }` | `ParameterTypeId.PatternIndent2ForDivisionRule` | ForgeTypeId |
| `ForgeTypeId PatternMirrorForDivisionRule { get; }` | `ParameterTypeId.PatternMirrorForDivisionRule` | ForgeTypeId |
| `ForgeTypeId PeakAirflowParam { get; }` | `ParameterTypeId.PeakAirflowParam` | ForgeTypeId |
| `ForgeTypeId PeakCoolingLoadParam { get; }` | `ParameterTypeId.PeakCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId PeakHeatingLoadParam { get; }` | `ParameterTypeId.PeakHeatingLoadParam` | ForgeTypeId |
| `ForgeTypeId PeakLatentCoolingLoad { get; }` | `ParameterTypeId.PeakLatentCoolingLoad` | ForgeTypeId |
| `ForgeTypeId PhaseCreated { get; }` | `ParameterTypeId.PhaseCreated` | ForgeTypeId |
| `ForgeTypeId PhaseDemolished { get; }` | `ParameterTypeId.PhaseDemolished` | ForgeTypeId |
| `ForgeTypeId PhaseName { get; }` | `ParameterTypeId.PhaseName` | ForgeTypeId |
| `ForgeTypeId PhaseSequenceNumber { get; }` | `ParameterTypeId.PhaseSequenceNumber` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamAverageModulus { get; }` | `ParameterTypeId.PhyMaterialParamAverageModulus` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamBehavior { get; }` | `ParameterTypeId.PhyMaterialParamBehavior` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamBending { get; }` | `ParameterTypeId.PhyMaterialParamBending` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamBendingReinforcement { get; }` | `ParameterTypeId.PhyMaterialParamBendingReinforcement` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamClass { get; }` | `ParameterTypeId.PhyMaterialParamClass` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamCompressionParallel { get; }` | `ParameterTypeId.PhyMaterialParamCompressionParallel` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamCompressionPerpendicular { get; }` | `ParameterTypeId.PhyMaterialParamCompressionPerpendicular` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamConcreteCompression { get; }` | `ParameterTypeId.PhyMaterialParamConcreteCompression` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamExpCoeff { get; }` | `ParameterTypeId.PhyMaterialParamExpCoeff` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamExpCoeff1 { get; }` | `ParameterTypeId.PhyMaterialParamExpCoeff1` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamExpCoeff2 { get; }` | `ParameterTypeId.PhyMaterialParamExpCoeff2` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamExpCoeff3 { get; }` | `ParameterTypeId.PhyMaterialParamExpCoeff3` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamExpCoeffn1 { get; }` | `ParameterTypeId.PhyMaterialParamExpCoeffn1` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamExpCoeffn2 { get; }` | `ParameterTypeId.PhyMaterialParamExpCoeffn2` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamFivepercentModulusOfElacticity { get; }` | `ParameterTypeId.PhyMaterialParamFivepercentModulusOfElacticity` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamGrade { get; }` | `ParameterTypeId.PhyMaterialParamGrade` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamLightWeight { get; }` | `ParameterTypeId.PhyMaterialParamLightWeight` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamMinimumTensileStrength { get; }` | `ParameterTypeId.PhyMaterialParamMinimumTensileStrength` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamMinimumYieldStress { get; }` | `ParameterTypeId.PhyMaterialParamMinimumYieldStress` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamPoissonMod { get; }` | `ParameterTypeId.PhyMaterialParamPoissonMod` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamPoissonMod1 { get; }` | `ParameterTypeId.PhyMaterialParamPoissonMod1` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamPoissonMod12 { get; }` | `ParameterTypeId.PhyMaterialParamPoissonMod12` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamPoissonMod2 { get; }` | `ParameterTypeId.PhyMaterialParamPoissonMod2` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamPoissonMod23 { get; }` | `ParameterTypeId.PhyMaterialParamPoissonMod23` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamPoissonMod3 { get; }` | `ParameterTypeId.PhyMaterialParamPoissonMod3` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamReductionFactor { get; }` | `ParameterTypeId.PhyMaterialParamReductionFactor` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamResistanceCalcStrength { get; }` | `ParameterTypeId.PhyMaterialParamResistanceCalcStrength` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearMod { get; }` | `ParameterTypeId.PhyMaterialParamShearMod` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearMod1 { get; }` | `ParameterTypeId.PhyMaterialParamShearMod1` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearMod12 { get; }` | `ParameterTypeId.PhyMaterialParamShearMod12` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearMod2 { get; }` | `ParameterTypeId.PhyMaterialParamShearMod2` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearMod3 { get; }` | `ParameterTypeId.PhyMaterialParamShearMod3` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearParallel { get; }` | `ParameterTypeId.PhyMaterialParamShearParallel` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearPerpendicular { get; }` | `ParameterTypeId.PhyMaterialParamShearPerpendicular` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearReinforcement { get; }` | `ParameterTypeId.PhyMaterialParamShearReinforcement` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamShearStrengthReduction { get; }` | `ParameterTypeId.PhyMaterialParamShearStrengthReduction` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamSpecies { get; }` | `ParameterTypeId.PhyMaterialParamSpecies` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamStructuralDensity { get; }` | `ParameterTypeId.PhyMaterialParamStructuralDensity` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamStructuralSpecificHeat { get; }` | `ParameterTypeId.PhyMaterialParamStructuralSpecificHeat` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamStructuralThermalTreated { get; }` | `ParameterTypeId.PhyMaterialParamStructuralThermalTreated` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamSubclass { get; }` | `ParameterTypeId.PhyMaterialParamSubclass` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamTensionParallel { get; }` | `ParameterTypeId.PhyMaterialParamTensionParallel` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamTensionPerpendicular { get; }` | `ParameterTypeId.PhyMaterialParamTensionPerpendicular` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamThermalConductivity { get; }` | `ParameterTypeId.PhyMaterialParamThermalConductivity` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamThermalConductivityX { get; }` | `ParameterTypeId.PhyMaterialParamThermalConductivityX` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamThermalConductivityY { get; }` | `ParameterTypeId.PhyMaterialParamThermalConductivityY` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamThermalConductivityZ { get; }` | `ParameterTypeId.PhyMaterialParamThermalConductivityZ` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamType { get; }` | `ParameterTypeId.PhyMaterialParamType` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamUnitWeight { get; }` | `ParameterTypeId.PhyMaterialParamUnitWeight` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamWoodConstruction { get; }` | `ParameterTypeId.PhyMaterialParamWoodConstruction` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamYoungMod { get; }` | `ParameterTypeId.PhyMaterialParamYoungMod` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamYoungMod1 { get; }` | `ParameterTypeId.PhyMaterialParamYoungMod1` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamYoungMod2 { get; }` | `ParameterTypeId.PhyMaterialParamYoungMod2` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamYoungMod3 { get; }` | `ParameterTypeId.PhyMaterialParamYoungMod3` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamYoungModn1 { get; }` | `ParameterTypeId.PhyMaterialParamYoungModn1` | ForgeTypeId |
| `ForgeTypeId PhyMaterialParamYoungModn2 { get; }` | `ParameterTypeId.PhyMaterialParamYoungModn2` | ForgeTypeId |
| `ForgeTypeId PhyMaterialProperties { get; }` | `ParameterTypeId.PhyMaterialProperties` | ForgeTypeId |
| `ForgeTypeId PipeInsulationThickness { get; }` | `ParameterTypeId.PipeInsulationThickness` | ForgeTypeId |
| `ForgeTypeId PipeRoughness { get; }` | `ParameterTypeId.PipeRoughness` | ForgeTypeId |
| `ForgeTypeId PipeVelocityPressure { get; }` | `ParameterTypeId.PipeVelocityPressure` | ForgeTypeId |
| `ForgeTypeId PipingConnectionType { get; }` | `ParameterTypeId.PipingConnectionType` | ForgeTypeId |
| `ForgeTypeId PipingGenderType { get; }` | `ParameterTypeId.PipingGenderType` | ForgeTypeId |
| `ForgeTypeId PlacementBottom { get; }` | `ParameterTypeId.PlacementBottom` | ForgeTypeId |
| `ForgeTypeId PlacementCenterX { get; }` | `ParameterTypeId.PlacementCenterX` | ForgeTypeId |
| `ForgeTypeId PlacementCenterY { get; }` | `ParameterTypeId.PlacementCenterY` | ForgeTypeId |
| `ForgeTypeId PlacementLeft { get; }` | `ParameterTypeId.PlacementLeft` | ForgeTypeId |
| `ForgeTypeId PlacementParamsShow { get; }` | `ParameterTypeId.PlacementParamsShow` | ForgeTypeId |
| `ForgeTypeId PlacementRight { get; }` | `ParameterTypeId.PlacementRight` | ForgeTypeId |
| `ForgeTypeId PlacementTop { get; }` | `ParameterTypeId.PlacementTop` | ForgeTypeId |
| `ForgeTypeId PlanRegionViewRange { get; }` | `ParameterTypeId.PlanRegionViewRange` | ForgeTypeId |
| `ForgeTypeId PlanViewCutPlaneHeight { get; }` | `ParameterTypeId.PlanViewCutPlaneHeight` | ForgeTypeId |
| `ForgeTypeId PlanViewLevel { get; }` | `ParameterTypeId.PlanViewLevel` | ForgeTypeId |
| `ForgeTypeId PlanViewNorth { get; }` | `ParameterTypeId.PlanViewNorth` | ForgeTypeId |
| `ForgeTypeId PlanViewRange { get; }` | `ParameterTypeId.PlanViewRange` | ForgeTypeId |
| `ForgeTypeId PlanViewTopClipHeight { get; }` | `ParameterTypeId.PlanViewTopClipHeight` | ForgeTypeId |
| `ForgeTypeId PlanViewViewDir { get; }` | `ParameterTypeId.PlanViewViewDir` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesCwConnection { get; }` | `ParameterTypeId.PlumbingFixturesCwConnection` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesDrain { get; }` | `ParameterTypeId.PlumbingFixturesDrain` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesHwConnection { get; }` | `ParameterTypeId.PlumbingFixturesHwConnection` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesSupplyFitting { get; }` | `ParameterTypeId.PlumbingFixturesSupplyFitting` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesSupplyPipe { get; }` | `ParameterTypeId.PlumbingFixturesSupplyPipe` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesTrap { get; }` | `ParameterTypeId.PlumbingFixturesTrap` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesVentConnection { get; }` | `ParameterTypeId.PlumbingFixturesVentConnection` | ForgeTypeId |
| `ForgeTypeId PlumbingFixturesWasteConnection { get; }` | `ParameterTypeId.PlumbingFixturesWasteConnection` | ForgeTypeId |
| `ForgeTypeId PocheMatId { get; }` | `ParameterTypeId.PocheMatId` | ForgeTypeId |
| `ForgeTypeId PointAdaptiveConstrained { get; }` | `ParameterTypeId.PointAdaptiveConstrained` | ForgeTypeId |
| `ForgeTypeId PointAdaptiveNumParam { get; }` | `ParameterTypeId.PointAdaptiveNumParam` | ForgeTypeId |
| `ForgeTypeId PointAdaptiveOrientationType { get; }` | `ParameterTypeId.PointAdaptiveOrientationType` | ForgeTypeId |
| `ForgeTypeId PointAdaptiveShowNumber { get; }` | `ParameterTypeId.PointAdaptiveShowNumber` | ForgeTypeId |
| `ForgeTypeId PointAdaptiveTypeParam { get; }` | `ParameterTypeId.PointAdaptiveTypeParam` | ForgeTypeId |
| `ForgeTypeId PointcloudinstanceName { get; }` | `ParameterTypeId.PointcloudinstanceName` | ForgeTypeId |
| `ForgeTypeId PointcloudtypeScale { get; }` | `ParameterTypeId.PointcloudtypeScale` | ForgeTypeId |
| `ForgeTypeId PointElementAngle { get; }` | `ParameterTypeId.PointElementAngle` | ForgeTypeId |
| `ForgeTypeId PointElementChordLength { get; }` | `ParameterTypeId.PointElementChordLength` | ForgeTypeId |
| `ForgeTypeId PointElementDriven { get; }` | `ParameterTypeId.PointElementDriven` | ForgeTypeId |
| `ForgeTypeId PointElementDriving { get; }` | `ParameterTypeId.PointElementDriving` | ForgeTypeId |
| `ForgeTypeId PointElementHostedOnFaceUParam { get; }` | `ParameterTypeId.PointElementHostedOnFaceUParam` | ForgeTypeId |
| `ForgeTypeId PointElementHostedOnFaceVParam { get; }` | `ParameterTypeId.PointElementHostedOnFaceVParam` | ForgeTypeId |
| `ForgeTypeId PointElementHostedParam { get; }` | `ParameterTypeId.PointElementHostedParam` | ForgeTypeId |
| `ForgeTypeId PointElementMeasureFrom { get; }` | `ParameterTypeId.PointElementMeasureFrom` | ForgeTypeId |
| `ForgeTypeId PointElementMeasurementType { get; }` | `ParameterTypeId.PointElementMeasurementType` | ForgeTypeId |
| `ForgeTypeId PointElementMirrored { get; }` | `ParameterTypeId.PointElementMirrored` | ForgeTypeId |
| `ForgeTypeId PointElementNonNormalizedCurveParamater { get; }` | `ParameterTypeId.PointElementNonNormalizedCurveParamater` | ForgeTypeId |
| `ForgeTypeId PointElementNormalizedCurveParamater { get; }` | `ParameterTypeId.PointElementNormalizedCurveParamater` | ForgeTypeId |
| `ForgeTypeId PointElementNormalizedSegmentLength { get; }` | `ParameterTypeId.PointElementNormalizedSegmentLength` | ForgeTypeId |
| `ForgeTypeId PointElementOffset { get; }` | `ParameterTypeId.PointElementOffset` | ForgeTypeId |
| `ForgeTypeId PointElementRotationAngle { get; }` | `ParameterTypeId.PointElementRotationAngle` | ForgeTypeId |
| `ForgeTypeId PointElementSegmentLength { get; }` | `ParameterTypeId.PointElementSegmentLength` | ForgeTypeId |
| `ForgeTypeId PointElementShowNormalPlaneOnly { get; }` | `ParameterTypeId.PointElementShowNormalPlaneOnly` | ForgeTypeId |
| `ForgeTypeId PointElementShowPlanes { get; }` | `ParameterTypeId.PointElementShowPlanes` | ForgeTypeId |
| `ForgeTypeId PointElementZflipped { get; }` | `ParameterTypeId.PointElementZflipped` | ForgeTypeId |
| `ForgeTypeId PointElevation { get; }` | `ParameterTypeId.PointElevation` | ForgeTypeId |
| `ForgeTypeId PointFlexibleConstrained { get; }` | `ParameterTypeId.PointFlexibleConstrained` | ForgeTypeId |
| `ForgeTypeId PointFlexibleNumParam { get; }` | `ParameterTypeId.PointFlexibleNumParam` | ForgeTypeId |
| `ForgeTypeId PointFlexibleOrientationType { get; }` | `ParameterTypeId.PointFlexibleOrientationType` | ForgeTypeId |
| `ForgeTypeId PointFlexibleShowNumber { get; }` | `ParameterTypeId.PointFlexibleShowNumber` | ForgeTypeId |
| `ForgeTypeId PointNameParam { get; }` | `ParameterTypeId.PointNameParam` | ForgeTypeId |
| `ForgeTypeId PointVisibilityParam { get; }` | `ParameterTypeId.PointVisibilityParam` | ForgeTypeId |
| `ForgeTypeId PreferDimSideUiFilter { get; }` | `ParameterTypeId.PreferDimSideUiFilter` | ForgeTypeId |
| `ForgeTypeId PreferPatternAlignUiFilter { get; }` | `ParameterTypeId.PreferPatternAlignUiFilter` | ForgeTypeId |
| `ForgeTypeId PrimaryOptionId { get; }` | `ParameterTypeId.PrimaryOptionId` | ForgeTypeId |
| `ForgeTypeId Profile1Angle { get; }` | `ParameterTypeId.Profile1Angle` | ForgeTypeId |
| `ForgeTypeId Profile1FamType { get; }` | `ParameterTypeId.Profile1FamType` | ForgeTypeId |
| `ForgeTypeId Profile1FlippedHor { get; }` | `ParameterTypeId.Profile1FlippedHor` | ForgeTypeId |
| `ForgeTypeId Profile1OffsetX { get; }` | `ParameterTypeId.Profile1OffsetX` | ForgeTypeId |
| `ForgeTypeId Profile1OffsetY { get; }` | `ParameterTypeId.Profile1OffsetY` | ForgeTypeId |
| `ForgeTypeId Profile2Angle { get; }` | `ParameterTypeId.Profile2Angle` | ForgeTypeId |
| `ForgeTypeId Profile2FamType { get; }` | `ParameterTypeId.Profile2FamType` | ForgeTypeId |
| `ForgeTypeId Profile2FlippedHor { get; }` | `ParameterTypeId.Profile2FlippedHor` | ForgeTypeId |
| `ForgeTypeId Profile2OffsetX { get; }` | `ParameterTypeId.Profile2OffsetX` | ForgeTypeId |
| `ForgeTypeId Profile2OffsetY { get; }` | `ParameterTypeId.Profile2OffsetY` | ForgeTypeId |
| `ForgeTypeId ProfileAngle { get; }` | `ParameterTypeId.ProfileAngle` | ForgeTypeId |
| `ForgeTypeId ProfileFamType { get; }` | `ParameterTypeId.ProfileFamType` | ForgeTypeId |
| `ForgeTypeId ProfileFamTypePlusNone { get; }` | `ParameterTypeId.ProfileFamTypePlusNone` | ForgeTypeId |
| `ForgeTypeId ProfileFlippedHor { get; }` | `ParameterTypeId.ProfileFlippedHor` | ForgeTypeId |
| `ForgeTypeId ProfileOffsetX { get; }` | `ParameterTypeId.ProfileOffsetX` | ForgeTypeId |
| `ForgeTypeId ProfileOffsetY { get; }` | `ParameterTypeId.ProfileOffsetY` | ForgeTypeId |
| `ForgeTypeId ProfileParamAlongPath { get; }` | `ParameterTypeId.ProfileParamAlongPath` | ForgeTypeId |
| `ForgeTypeId ProjectAddress { get; }` | `ParameterTypeId.ProjectAddress` | ForgeTypeId |
| `ForgeTypeId ProjectAuthor { get; }` | `ParameterTypeId.ProjectAuthor` | ForgeTypeId |
| `ForgeTypeId ProjectBuildingName { get; }` | `ParameterTypeId.ProjectBuildingName` | ForgeTypeId |
| `ForgeTypeId ProjectBuildingType { get; }` | `ParameterTypeId.ProjectBuildingType` | ForgeTypeId |
| `ForgeTypeId ProjectedSurfaceArea { get; }` | `ParameterTypeId.ProjectedSurfaceArea` | ForgeTypeId |
| `ForgeTypeId ProjectIssueDate { get; }` | `ParameterTypeId.ProjectIssueDate` | ForgeTypeId |
| `ForgeTypeId ProjectName { get; }` | `ParameterTypeId.ProjectName` | ForgeTypeId |
| `ForgeTypeId ProjectNumber { get; }` | `ParameterTypeId.ProjectNumber` | ForgeTypeId |
| `ForgeTypeId ProjectOrganizationDescription { get; }` | `ParameterTypeId.ProjectOrganizationDescription` | ForgeTypeId |
| `ForgeTypeId ProjectOrganizationName { get; }` | `ParameterTypeId.ProjectOrganizationName` | ForgeTypeId |
| `ForgeTypeId ProjectPostalCode { get; }` | `ParameterTypeId.ProjectPostalCode` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionEnumeration { get; }` | `ParameterTypeId.ProjectRevisionEnumeration` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionRevisionDate { get; }` | `ParameterTypeId.ProjectRevisionRevisionDate` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionRevisionDescription { get; }` | `ParameterTypeId.ProjectRevisionRevisionDescription` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionRevisionIssued { get; }` | `ParameterTypeId.ProjectRevisionRevisionIssued` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionRevisionIssuedBy { get; }` | `ParameterTypeId.ProjectRevisionRevisionIssuedBy` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionRevisionIssuedTo { get; }` | `ParameterTypeId.ProjectRevisionRevisionIssuedTo` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionRevisionNum { get; }` | `ParameterTypeId.ProjectRevisionRevisionNum` | ForgeTypeId |
| `ForgeTypeId ProjectRevisionSequenceNum { get; }` | `ParameterTypeId.ProjectRevisionSequenceNum` | ForgeTypeId |
| `ForgeTypeId ProjectStatus { get; }` | `ParameterTypeId.ProjectStatus` | ForgeTypeId |
| `ForgeTypeId PropertyArea { get; }` | `ParameterTypeId.PropertyArea` | ForgeTypeId |
| `ForgeTypeId PropertyAreaOpen { get; }` | `ParameterTypeId.PropertyAreaOpen` | ForgeTypeId |
| `ForgeTypeId PropertyAreaUnits { get; }` | `ParameterTypeId.PropertyAreaUnits` | ForgeTypeId |
| `ForgeTypeId PropertyLengthUnits { get; }` | `ParameterTypeId.PropertyLengthUnits` | ForgeTypeId |
| `ForgeTypeId PropertySegmentBearing { get; }` | `ParameterTypeId.PropertySegmentBearing` | ForgeTypeId |
| `ForgeTypeId PropertySegmentDistance { get; }` | `ParameterTypeId.PropertySegmentDistance` | ForgeTypeId |
| `ForgeTypeId PropertySegmentEW { get; }` | `ParameterTypeId.PropertySegmentEW` | ForgeTypeId |
| `ForgeTypeId PropertySegmentLR { get; }` | `ParameterTypeId.PropertySegmentLR` | ForgeTypeId |
| `ForgeTypeId PropertySegmentNS { get; }` | `ParameterTypeId.PropertySegmentNS` | ForgeTypeId |
| `ForgeTypeId PropertySegmentRadius { get; }` | `ParameterTypeId.PropertySegmentRadius` | ForgeTypeId |
| `ForgeTypeId PropertySegmentSubcategoryId { get; }` | `ParameterTypeId.PropertySegmentSubcategoryId` | ForgeTypeId |
| `ForgeTypeId PropertySetDescription { get; }` | `ParameterTypeId.PropertySetDescription` | ForgeTypeId |
| `ForgeTypeId PropertySetKeywords { get; }` | `ParameterTypeId.PropertySetKeywords` | ForgeTypeId |
| `ForgeTypeId PropertySetMaterialAspect { get; }` | `ParameterTypeId.PropertySetMaterialAspect` | ForgeTypeId |
| `ForgeTypeId PropertySetName { get; }` | `ParameterTypeId.PropertySetName` | ForgeTypeId |
| `ForgeTypeId PropertySubcategoryId { get; }` | `ParameterTypeId.PropertySubcategoryId` | ForgeTypeId |
| `ForgeTypeId RadialArrayArcRadius { get; }` | `ParameterTypeId.RadialArrayArcRadius` | ForgeTypeId |
| `ForgeTypeId RadiusSymbolLocation { get; }` | `ParameterTypeId.RadiusSymbolLocation` | ForgeTypeId |
| `ForgeTypeId RadiusSymbolText { get; }` | `ParameterTypeId.RadiusSymbolText` | ForgeTypeId |
| `ForgeTypeId RailingSystemHandrailsHeightParam { get; }` | `ParameterTypeId.RailingSystemHandrailsHeightParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemHandrailsLatteralOffset { get; }` | `ParameterTypeId.RailingSystemHandrailsLatteralOffset` | ForgeTypeId |
| `ForgeTypeId RailingSystemHandrailsPositionParam { get; }` | `ParameterTypeId.RailingSystemHandrailsPositionParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemHandrailsTypesParam { get; }` | `ParameterTypeId.RailingSystemHandrailsTypesParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemHasTopRail { get; }` | `ParameterTypeId.RailingSystemHasTopRail` | ForgeTypeId |
| `ForgeTypeId RailingSystemSecondaryHandrailsHeightParam { get; }` | `ParameterTypeId.RailingSystemSecondaryHandrailsHeightParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemSecondaryHandrailsLatteralOffset { get; }` | `ParameterTypeId.RailingSystemSecondaryHandrailsLatteralOffset` | ForgeTypeId |
| `ForgeTypeId RailingSystemSecondaryHandrailsPositionParam { get; }` | `ParameterTypeId.RailingSystemSecondaryHandrailsPositionParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemSecondaryHandrailsTypesParam { get; }` | `ParameterTypeId.RailingSystemSecondaryHandrailsTypesParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemTopRailHeightParam { get; }` | `ParameterTypeId.RailingSystemTopRailHeightParam` | ForgeTypeId |
| `ForgeTypeId RailingSystemTopRailTypesParam { get; }` | `ParameterTypeId.RailingSystemTopRailTypesParam` | ForgeTypeId |
| `ForgeTypeId RampAttrLeftBalusterAttachPt { get; }` | `ParameterTypeId.RampAttrLeftBalusterAttachPt` | ForgeTypeId |
| `ForgeTypeId RampAttrMaterial { get; }` | `ParameterTypeId.RampAttrMaterial` | ForgeTypeId |
| `ForgeTypeId RampAttrMinInvSlope { get; }` | `ParameterTypeId.RampAttrMinInvSlope` | ForgeTypeId |
| `ForgeTypeId RampAttrRightBalusterAttachPt { get; }` | `ParameterTypeId.RampAttrRightBalusterAttachPt` | ForgeTypeId |
| `ForgeTypeId RampAttrShape { get; }` | `ParameterTypeId.RampAttrShape` | ForgeTypeId |
| `ForgeTypeId RampAttrTextFont { get; }` | `ParameterTypeId.RampAttrTextFont` | ForgeTypeId |
| `ForgeTypeId RampAttrTextSize { get; }` | `ParameterTypeId.RampAttrTextSize` | ForgeTypeId |
| `ForgeTypeId RampAttrThickness { get; }` | `ParameterTypeId.RampAttrThickness` | ForgeTypeId |
| `ForgeTypeId RampMaxRunLength { get; }` | `ParameterTypeId.RampMaxRunLength` | ForgeTypeId |
| `ForgeTypeId RasterEnableSnaps { get; }` | `ParameterTypeId.RasterEnableSnaps` | ForgeTypeId |
| `ForgeTypeId RasterHorizontalScale { get; }` | `ParameterTypeId.RasterHorizontalScale` | ForgeTypeId |
| `ForgeTypeId RasterLockProportions { get; }` | `ParameterTypeId.RasterLockProportions` | ForgeTypeId |
| `ForgeTypeId RasterSheetheight { get; }` | `ParameterTypeId.RasterSheetheight` | ForgeTypeId |
| `ForgeTypeId RasterSheetwidth { get; }` | `ParameterTypeId.RasterSheetwidth` | ForgeTypeId |
| `ForgeTypeId RasterSymbolFilename { get; }` | `ParameterTypeId.RasterSymbolFilename` | ForgeTypeId |
| `ForgeTypeId RasterSymbolHeight { get; }` | `ParameterTypeId.RasterSymbolHeight` | ForgeTypeId |
| `ForgeTypeId RasterSymbolLinkloadStatus { get; }` | `ParameterTypeId.RasterSymbolLinkloadStatus` | ForgeTypeId |
| `ForgeTypeId RasterSymbolPagenumber { get; }` | `ParameterTypeId.RasterSymbolPagenumber` | ForgeTypeId |
| `ForgeTypeId RasterSymbolPixelheight { get; }` | `ParameterTypeId.RasterSymbolPixelheight` | ForgeTypeId |
| `ForgeTypeId RasterSymbolPixelwidth { get; }` | `ParameterTypeId.RasterSymbolPixelwidth` | ForgeTypeId |
| `ForgeTypeId RasterSymbolResolution { get; }` | `ParameterTypeId.RasterSymbolResolution` | ForgeTypeId |
| `ForgeTypeId RasterSymbolViewname { get; }` | `ParameterTypeId.RasterSymbolViewname` | ForgeTypeId |
| `ForgeTypeId RasterSymbolWidth { get; }` | `ParameterTypeId.RasterSymbolWidth` | ForgeTypeId |
| `ForgeTypeId RasterVerticalScale { get; }` | `ParameterTypeId.RasterVerticalScale` | ForgeTypeId |
| `ForgeTypeId RbsAdditionalFlow { get; }` | `ParameterTypeId.RbsAdditionalFlow` | ForgeTypeId |
| `ForgeTypeId RbsAdjustableConnector { get; }` | `ParameterTypeId.RbsAdjustableConnector` | ForgeTypeId |
| `ForgeTypeId RbsAreaBasedLoadType { get; }` | `ParameterTypeId.RbsAreaBasedLoadType` | ForgeTypeId |
| `ForgeTypeId RbsBuildingConstructionclass { get; }` | `ParameterTypeId.RbsBuildingConstructionclass` | ForgeTypeId |
| `ForgeTypeId RbsBuildingUseloadcredits { get; }` | `ParameterTypeId.RbsBuildingUseloadcredits` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayBendradius { get; }` | `ParameterTypeId.RbsCabletrayBendradius` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayconduitBendorfitting { get; }` | `ParameterTypeId.RbsCabletrayconduitBendorfitting` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayconduitConnectorelemType { get; }` | `ParameterTypeId.RbsCabletrayconduitConnectorelemType` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayconduitrunLengthParam { get; }` | `ParameterTypeId.RbsCabletrayconduitrunLengthParam` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayconduitSystemType { get; }` | `ParameterTypeId.RbsCabletrayconduitSystemType` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayHeightParam { get; }` | `ParameterTypeId.RbsCabletrayHeightParam` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayRungheight { get; }` | `ParameterTypeId.RbsCabletrayRungheight` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayRungspace { get; }` | `ParameterTypeId.RbsCabletrayRungspace` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayRungwidth { get; }` | `ParameterTypeId.RbsCabletrayRungwidth` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayrunHeightParam { get; }` | `ParameterTypeId.RbsCabletrayrunHeightParam` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayrunWidthParam { get; }` | `ParameterTypeId.RbsCabletrayrunWidthParam` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayShapetype { get; }` | `ParameterTypeId.RbsCabletrayShapetype` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayThickness { get; }` | `ParameterTypeId.RbsCabletrayThickness` | ForgeTypeId |
| `ForgeTypeId RbsCabletrayWidthParam { get; }` | `ParameterTypeId.RbsCabletrayWidthParam` | ForgeTypeId |
| `ForgeTypeId RbsCalculatedSize { get; }` | `ParameterTypeId.RbsCalculatedSize` | ForgeTypeId |
| `ForgeTypeId RbsComponentClassificationParam { get; }` | `ParameterTypeId.RbsComponentClassificationParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitBendradius { get; }` | `ParameterTypeId.RbsConduitBendradius` | ForgeTypeId |
| `ForgeTypeId RbsConduitDiameterParam { get; }` | `ParameterTypeId.RbsConduitDiameterParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitInnerDiamParam { get; }` | `ParameterTypeId.RbsConduitInnerDiamParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitOuterDiamParam { get; }` | `ParameterTypeId.RbsConduitOuterDiamParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitrunDiameterParam { get; }` | `ParameterTypeId.RbsConduitrunDiameterParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitrunInnerDiamParam { get; }` | `ParameterTypeId.RbsConduitrunInnerDiamParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitrunOuterDiamParam { get; }` | `ParameterTypeId.RbsConduitrunOuterDiamParam` | ForgeTypeId |
| `ForgeTypeId RbsConduitTradesize { get; }` | `ParameterTypeId.RbsConduitTradesize` | ForgeTypeId |
| `ForgeTypeId RbsConnectorDescription { get; }` | `ParameterTypeId.RbsConnectorDescription` | ForgeTypeId |
| `ForgeTypeId RbsConnectorIsprimary { get; }` | `ParameterTypeId.RbsConnectorIsprimary` | ForgeTypeId |
| `ForgeTypeId RbsConnectorOffsetObsolete { get; }` | `ParameterTypeId.RbsConnectorOffsetObsolete` | ForgeTypeId |
| `ForgeTypeId RbsConstructionSetParam { get; }` | `ParameterTypeId.RbsConstructionSetParam` | ForgeTypeId |
| `ForgeTypeId RbsConstructionTypeShadingfactorParam { get; }` | `ParameterTypeId.RbsConstructionTypeShadingfactorParam` | ForgeTypeId |
| `ForgeTypeId RbsCtcBottomElevation { get; }` | `ParameterTypeId.RbsCtcBottomElevation` | ForgeTypeId |
| `ForgeTypeId RbsCtcServiceType { get; }` | `ParameterTypeId.RbsCtcServiceType` | ForgeTypeId |
| `ForgeTypeId RbsCtcTopElevation { get; }` | `ParameterTypeId.RbsCtcTopElevation` | ForgeTypeId |
| `ForgeTypeId RbsCurveDiameterParam { get; }` | `ParameterTypeId.RbsCurveDiameterParam` | ForgeTypeId |
| `ForgeTypeId RbsCurveHeightParam { get; }` | `ParameterTypeId.RbsCurveHeightParam` | ForgeTypeId |
| `ForgeTypeId RbsCurveHorOffsetParam { get; }` | `ParameterTypeId.RbsCurveHorOffsetParam` | ForgeTypeId |
| `ForgeTypeId RbsCurveSlope { get; }` | `ParameterTypeId.RbsCurveSlope` | ForgeTypeId |
| `ForgeTypeId RbsCurveSurfaceArea { get; }` | `ParameterTypeId.RbsCurveSurfaceArea` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultBendParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultBendParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultCapParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultCapParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultCrossParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultCrossParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultElbowdownParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultElbowdownParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultElbowParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultElbowParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultElbowupParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultElbowupParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultHorizontalBendParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultHorizontalBendParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultMechjointParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultMechjointParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultTakeoffParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultTakeoffParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultTeedownParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultTeedownParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultTeeParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultTeeParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultTeeupParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultTeeupParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultTransitionParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultTransitionParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeDefaultUnionParam { get; }` | `ParameterTypeId.RbsCurvetypeDefaultUnionParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeMaxHeightParam { get; }` | `ParameterTypeId.RbsCurvetypeMaxHeightParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeMaxWidthParam { get; }` | `ParameterTypeId.RbsCurvetypeMaxWidthParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeMultishapeTransitionOvalroundParam { get; }` | `ParameterTypeId.RbsCurvetypeMultishapeTransitionOvalroundParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeMultishapeTransitionParam { get; }` | `ParameterTypeId.RbsCurvetypeMultishapeTransitionParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypeMultishapeTransitionRectovalParam { get; }` | `ParameterTypeId.RbsCurvetypeMultishapeTransitionRectovalParam` | ForgeTypeId |
| `ForgeTypeId RbsCurvetypePreferredBranchParam { get; }` | `ParameterTypeId.RbsCurvetypePreferredBranchParam` | ForgeTypeId |
| `ForgeTypeId RbsCurveUtslope { get; }` | `ParameterTypeId.RbsCurveUtslope` | ForgeTypeId |
| `ForgeTypeId RbsCurveVertOffsetParam { get; }` | `ParameterTypeId.RbsCurveVertOffsetParam` | ForgeTypeId |
| `ForgeTypeId RbsCurveWidthParam { get; }` | `ParameterTypeId.RbsCurveWidthParam` | ForgeTypeId |
| `ForgeTypeId RbsDistributionsysConfigParam { get; }` | `ParameterTypeId.RbsDistributionsysConfigParam` | ForgeTypeId |
| `ForgeTypeId RbsDistributionsysHlPhaseParam { get; }` | `ParameterTypeId.RbsDistributionsysHlPhaseParam` | ForgeTypeId |
| `ForgeTypeId RbsDistributionsysNumwiresParam { get; }` | `ParameterTypeId.RbsDistributionsysNumwiresParam` | ForgeTypeId |
| `ForgeTypeId RbsDistributionsysPhaseParam { get; }` | `ParameterTypeId.RbsDistributionsysPhaseParam` | ForgeTypeId |
| `ForgeTypeId RbsDistributionsysVlgParam { get; }` | `ParameterTypeId.RbsDistributionsysVlgParam` | ForgeTypeId |
| `ForgeTypeId RbsDistributionsysVllParam { get; }` | `ParameterTypeId.RbsDistributionsysVllParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctBottomElevation { get; }` | `ParameterTypeId.RbsDuctBottomElevation` | ForgeTypeId |
| `ForgeTypeId RbsDuctCalculatedSize { get; }` | `ParameterTypeId.RbsDuctCalculatedSize` | ForgeTypeId |
| `ForgeTypeId RbsDuctConnectorSystemClassificationParam { get; }` | `ParameterTypeId.RbsDuctConnectorSystemClassificationParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctFittingLossMethodParam { get; }` | `ParameterTypeId.RbsDuctFittingLossMethodParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctFittingLossMethodServerParam { get; }` | `ParameterTypeId.RbsDuctFittingLossMethodServerParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctFittingLossMethodSettings { get; }` | `ParameterTypeId.RbsDuctFittingLossMethodSettings` | ForgeTypeId |
| `ForgeTypeId RbsDuctFittingLossTableParam { get; }` | `ParameterTypeId.RbsDuctFittingLossTableParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctFlowConfigurationParam { get; }` | `ParameterTypeId.RbsDuctFlowConfigurationParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctFlowDirectionParam { get; }` | `ParameterTypeId.RbsDuctFlowDirectionParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctFlowParam { get; }` | `ParameterTypeId.RbsDuctFlowParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctPipeSystemAbbreviationParam { get; }` | `ParameterTypeId.RbsDuctPipeSystemAbbreviationParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctPressureDrop { get; }` | `ParameterTypeId.RbsDuctPressureDrop` | ForgeTypeId |
| `ForgeTypeId RbsDuctRoutingPreferenceParam { get; }` | `ParameterTypeId.RbsDuctRoutingPreferenceParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctSizeFormattedParam { get; }` | `ParameterTypeId.RbsDuctSizeFormattedParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctSlope { get; }` | `ParameterTypeId.RbsDuctSlope` | ForgeTypeId |
| `ForgeTypeId RbsDuctStaticPressure { get; }` | `ParameterTypeId.RbsDuctStaticPressure` | ForgeTypeId |
| `ForgeTypeId RbsDuctSystemCalculationParam { get; }` | `ParameterTypeId.RbsDuctSystemCalculationParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctSystemTypeParam { get; }` | `ParameterTypeId.RbsDuctSystemTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsDuctTopElevation { get; }` | `ParameterTypeId.RbsDuctTopElevation` | ForgeTypeId |
| `ForgeTypeId RbsDuctTypeParam { get; }` | `ParameterTypeId.RbsDuctTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecAmbientTemperature { get; }` | `ParameterTypeId.RbsElecAmbientTemperature` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalArea { get; }` | `ParameterTypeId.RbsElecAnalyticalArea` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalConnectedPhase { get; }` | `ParameterTypeId.RbsElecAnalyticalConnectedPhase` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalDownstreamConnectedPhases { get; }` | `ParameterTypeId.RbsElecAnalyticalDownstreamConnectedPhases` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalFeederLength { get; }` | `ParameterTypeId.RbsElecAnalyticalFeederLength` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalHighLegPhase { get; }` | `ParameterTypeId.RbsElecAnalyticalHighLegPhase` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLevelId { get; }` | `ParameterTypeId.RbsElecAnalyticalLevelId` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadDensity { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadDensity` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadNameParam { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadNameParam` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadSetOnDuty { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadSetOnDuty` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadSetOnStandby { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadSetOnStandby` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadSetOnTotal { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadSetOnTotal` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadsInSet { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadsInSet` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalLoadTypeParam { get; }` | `ParameterTypeId.RbsElecAnalyticalLoadTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalNumphases { get; }` | `ParameterTypeId.RbsElecAnalyticalNumphases` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalSecondaryHighLegPhase { get; }` | `ParameterTypeId.RbsElecAnalyticalSecondaryHighLegPhase` | ForgeTypeId |
| `ForgeTypeId RbsElecAnalyticalTotalCoincidentLoad { get; }` | `ParameterTypeId.RbsElecAnalyticalTotalCoincidentLoad` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentCurrentParam { get; }` | `ParameterTypeId.RbsElecApparentCurrentParam` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentCurrentPhaseaParam { get; }` | `ParameterTypeId.RbsElecApparentCurrentPhaseaParam` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentCurrentPhasebParam { get; }` | `ParameterTypeId.RbsElecApparentCurrentPhasebParam` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentCurrentPhasecParam { get; }` | `ParameterTypeId.RbsElecApparentCurrentPhasecParam` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoad { get; }` | `ParameterTypeId.RbsElecApparentLoad` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoadPhase1 { get; }` | `ParameterTypeId.RbsElecApparentLoadPhase1` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoadPhase2 { get; }` | `ParameterTypeId.RbsElecApparentLoadPhase2` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoadPhase3 { get; }` | `ParameterTypeId.RbsElecApparentLoadPhase3` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoadPhasea { get; }` | `ParameterTypeId.RbsElecApparentLoadPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoadPhaseb { get; }` | `ParameterTypeId.RbsElecApparentLoadPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentLoadPhasec { get; }` | `ParameterTypeId.RbsElecApparentLoadPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecApparentPowerDensity { get; }` | `ParameterTypeId.RbsElecApparentPowerDensity` | ForgeTypeId |
| `ForgeTypeId RbsElecBalancedLoad { get; }` | `ParameterTypeId.RbsElecBalancedLoad` | ForgeTypeId |
| `ForgeTypeId RbsElecCalcCoefficientUtilization { get; }` | `ParameterTypeId.RbsElecCalcCoefficientUtilization` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitConnectionTypeParam { get; }` | `ParameterTypeId.RbsElecCircuitConnectionTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitFrameParam { get; }` | `ParameterTypeId.RbsElecCircuitFrameParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitLengthParam { get; }` | `ParameterTypeId.RbsElecCircuitLengthParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitName { get; }` | `ParameterTypeId.RbsElecCircuitName` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitNaming { get; }` | `ParameterTypeId.RbsElecCircuitNaming` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitNamingIndex { get; }` | `ParameterTypeId.RbsElecCircuitNamingIndex` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitNotesParam { get; }` | `ParameterTypeId.RbsElecCircuitNotesParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitNumber { get; }` | `ParameterTypeId.RbsElecCircuitNumber` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitNumberingType { get; }` | `ParameterTypeId.RbsElecCircuitNumberingType` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitNumberOfElementsParam { get; }` | `ParameterTypeId.RbsElecCircuitNumberOfElementsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitPanelParam { get; }` | `ParameterTypeId.RbsElecCircuitPanelParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitPathModeParam { get; }` | `ParameterTypeId.RbsElecCircuitPathModeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitPathOffsetParam { get; }` | `ParameterTypeId.RbsElecCircuitPathOffsetParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitPrefix { get; }` | `ParameterTypeId.RbsElecCircuitPrefix` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitPrefixSeparator { get; }` | `ParameterTypeId.RbsElecCircuitPrefixSeparator` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitRatingParam { get; }` | `ParameterTypeId.RbsElecCircuitRatingParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitSlotIndex { get; }` | `ParameterTypeId.RbsElecCircuitSlotIndex` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitStartSlot { get; }` | `ParameterTypeId.RbsElecCircuitStartSlot` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitType { get; }` | `ParameterTypeId.RbsElecCircuitType` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitWireNumGroundsParam { get; }` | `ParameterTypeId.RbsElecCircuitWireNumGroundsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitWireNumHotsParam { get; }` | `ParameterTypeId.RbsElecCircuitWireNumHotsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitWireNumNeutralsParam { get; }` | `ParameterTypeId.RbsElecCircuitWireNumNeutralsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitWireNumRunsParam { get; }` | `ParameterTypeId.RbsElecCircuitWireNumRunsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitWireSizeParam { get; }` | `ParameterTypeId.RbsElecCircuitWireSizeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecCircuitWireTypeParam { get; }` | `ParameterTypeId.RbsElecCircuitWireTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandCurrentPhasea { get; }` | `ParameterTypeId.RbsElecDemandCurrentPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandCurrentPhaseb { get; }` | `ParameterTypeId.RbsElecDemandCurrentPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandCurrentPhasec { get; }` | `ParameterTypeId.RbsElecDemandCurrentPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandfactorDemandloadParam { get; }` | `ParameterTypeId.RbsElecDemandfactorDemandloadParam` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandfactorLoadclassificationParam { get; }` | `ParameterTypeId.RbsElecDemandfactorLoadclassificationParam` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandfactorLoadParam { get; }` | `ParameterTypeId.RbsElecDemandfactorLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandLoadPhasea { get; }` | `ParameterTypeId.RbsElecDemandLoadPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandLoadPhaseb { get; }` | `ParameterTypeId.RbsElecDemandLoadPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecDemandLoadPhasec { get; }` | `ParameterTypeId.RbsElecDemandLoadPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecDistributionNodeLoadSet { get; }` | `ParameterTypeId.RbsElecDistributionNodeLoadSet` | ForgeTypeId |
| `ForgeTypeId RbsElecDistributionNodeSupplyFrom { get; }` | `ParameterTypeId.RbsElecDistributionNodeSupplyFrom` | ForgeTypeId |
| `ForgeTypeId RbsElecDistributionNodeSupplyFrom1 { get; }` | `ParameterTypeId.RbsElecDistributionNodeSupplyFrom1` | ForgeTypeId |
| `ForgeTypeId RbsElecDistributionNodeSupplyFrom2 { get; }` | `ParameterTypeId.RbsElecDistributionNodeSupplyFrom2` | ForgeTypeId |
| `ForgeTypeId RbsElecDistributionNodeSupplyTo { get; }` | `ParameterTypeId.RbsElecDistributionNodeSupplyTo` | ForgeTypeId |
| `ForgeTypeId RbsElecEditCircuitNamingSettingsParam { get; }` | `ParameterTypeId.RbsElecEditCircuitNamingSettingsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecEnclosure { get; }` | `ParameterTypeId.RbsElecEnclosure` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadClassification { get; }` | `ParameterTypeId.RbsElecLoadClassification` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryConnectedCurrentParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryConnectedCurrentParam` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryConnectedLoadParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryConnectedLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryDemandCurrentParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryDemandCurrentParam` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryDemandFactorParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryDemandFactorParam` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryDemandFactorRuleParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryDemandFactorRuleParam` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryDemandLoadParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryDemandLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsElecLoadsummaryLoadclassificationParam { get; }` | `ParameterTypeId.RbsElecLoadsummaryLoadclassificationParam` | ForgeTypeId |
| `ForgeTypeId RbsElecMains { get; }` | `ParameterTypeId.RbsElecMains` | ForgeTypeId |
| `ForgeTypeId RbsElecMaxCircuitsDataPanel { get; }` | `ParameterTypeId.RbsElecMaxCircuitsDataPanel` | ForgeTypeId |
| `ForgeTypeId RbsElecMaxPoleBreakers { get; }` | `ParameterTypeId.RbsElecMaxPoleBreakers` | ForgeTypeId |
| `ForgeTypeId RbsElecModifications { get; }` | `ParameterTypeId.RbsElecModifications` | ForgeTypeId |
| `ForgeTypeId RbsElecMounting { get; }` | `ParameterTypeId.RbsElecMounting` | ForgeTypeId |
| `ForgeTypeId RbsElecNumberOfCircuits { get; }` | `ParameterTypeId.RbsElecNumberOfCircuits` | ForgeTypeId |
| `ForgeTypeId RbsElecNumberOfPoles { get; }` | `ParameterTypeId.RbsElecNumberOfPoles` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasea { get; }` | `ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhaseb { get; }` | `ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasec { get; }` | `ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasea { get; }` | `ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBranchCircuitCurrentPhaseb { get; }` | `ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasec { get; }` | `ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelBussingParam { get; }` | `ParameterTypeId.RbsElecPanelBussingParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelConfigurationParam { get; }` | `ParameterTypeId.RbsElecPanelConfigurationParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelCurrentPhaseaParam { get; }` | `ParameterTypeId.RbsElecPanelCurrentPhaseaParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelCurrentPhasebParam { get; }` | `ParameterTypeId.RbsElecPanelCurrentPhasebParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelCurrentPhasecParam { get; }` | `ParameterTypeId.RbsElecPanelCurrentPhasecParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedParam { get; }` | `ParameterTypeId.RbsElecPanelFeedParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhasea { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhaseb { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhasec { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasea { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhaseb { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasec { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelFeedThruLugsParam { get; }` | `ParameterTypeId.RbsElecPanelFeedThruLugsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelGroundBusParam { get; }` | `ParameterTypeId.RbsElecPanelGroundBusParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelLocationParam { get; }` | `ParameterTypeId.RbsElecPanelLocationParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelMainstypeParam { get; }` | `ParameterTypeId.RbsElecPanelMainstypeParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelMcbRatingParam { get; }` | `ParameterTypeId.RbsElecPanelMcbRatingParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelName { get; }` | `ParameterTypeId.RbsElecPanelName` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelNeutralBusParam { get; }` | `ParameterTypeId.RbsElecPanelNeutralBusParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelNeutralRatingParam { get; }` | `ParameterTypeId.RbsElecPanelNeutralRatingParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelNumphasesParam { get; }` | `ParameterTypeId.RbsElecPanelNumphasesParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelNumwiresParam { get; }` | `ParameterTypeId.RbsElecPanelNumwiresParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelScheduleFooterNotesParam { get; }` | `ParameterTypeId.RbsElecPanelScheduleFooterNotesParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelScheduleHeaderNotesParam { get; }` | `ParameterTypeId.RbsElecPanelScheduleHeaderNotesParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelSubfeedLugsParam { get; }` | `ParameterTypeId.RbsElecPanelSubfeedLugsParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelSupplyFromParam { get; }` | `ParameterTypeId.RbsElecPanelSupplyFromParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalConnectedCurrentParam { get; }` | `ParameterTypeId.RbsElecPanelTotalConnectedCurrentParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalDemandCurrentParam { get; }` | `ParameterTypeId.RbsElecPanelTotalDemandCurrentParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalDemandFactorParam { get; }` | `ParameterTypeId.RbsElecPanelTotalDemandFactorParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalestloadHvacParam { get; }` | `ParameterTypeId.RbsElecPanelTotalestloadHvacParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalestloadLightParam { get; }` | `ParameterTypeId.RbsElecPanelTotalestloadLightParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalestloadOtherParam { get; }` | `ParameterTypeId.RbsElecPanelTotalestloadOtherParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalestloadParam { get; }` | `ParameterTypeId.RbsElecPanelTotalestloadParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalestloadPowerParam { get; }` | `ParameterTypeId.RbsElecPanelTotalestloadPowerParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalloadHvacParam { get; }` | `ParameterTypeId.RbsElecPanelTotalloadHvacParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalloadLightParam { get; }` | `ParameterTypeId.RbsElecPanelTotalloadLightParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalloadOtherParam { get; }` | `ParameterTypeId.RbsElecPanelTotalloadOtherParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalloadParam { get; }` | `ParameterTypeId.RbsElecPanelTotalloadParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPanelTotalloadPowerParam { get; }` | `ParameterTypeId.RbsElecPanelTotalloadPowerParam` | ForgeTypeId |
| `ForgeTypeId RbsElecPowerFactor { get; }` | `ParameterTypeId.RbsElecPowerFactor` | ForgeTypeId |
| `ForgeTypeId RbsElecPowerFactorState { get; }` | `ParameterTypeId.RbsElecPowerFactorState` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomAverageIllumination { get; }` | `ParameterTypeId.RbsElecRoomAverageIllumination` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomCavityRatio { get; }` | `ParameterTypeId.RbsElecRoomCavityRatio` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomLightingCalcLuminaireplane { get; }` | `ParameterTypeId.RbsElecRoomLightingCalcLuminaireplane` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomLightingCalcWorkplane { get; }` | `ParameterTypeId.RbsElecRoomLightingCalcWorkplane` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomReflectivityCeiling { get; }` | `ParameterTypeId.RbsElecRoomReflectivityCeiling` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomReflectivityFloor { get; }` | `ParameterTypeId.RbsElecRoomReflectivityFloor` | ForgeTypeId |
| `ForgeTypeId RbsElecRoomReflectivityWalls { get; }` | `ParameterTypeId.RbsElecRoomReflectivityWalls` | ForgeTypeId |
| `ForgeTypeId RbsElecShortCircuitRating { get; }` | `ParameterTypeId.RbsElecShortCircuitRating` | ForgeTypeId |
| `ForgeTypeId RbsElecSwitchIdParam { get; }` | `ParameterTypeId.RbsElecSwitchIdParam` | ForgeTypeId |
| `ForgeTypeId RbsElectricalData { get; }` | `ParameterTypeId.RbsElectricalData` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueCurrentParam { get; }` | `ParameterTypeId.RbsElecTrueCurrentParam` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueCurrentPhaseaParam { get; }` | `ParameterTypeId.RbsElecTrueCurrentPhaseaParam` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueCurrentPhasebParam { get; }` | `ParameterTypeId.RbsElecTrueCurrentPhasebParam` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueCurrentPhasecParam { get; }` | `ParameterTypeId.RbsElecTrueCurrentPhasecParam` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoad { get; }` | `ParameterTypeId.RbsElecTrueLoad` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoadPhase1 { get; }` | `ParameterTypeId.RbsElecTrueLoadPhase1` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoadPhase2 { get; }` | `ParameterTypeId.RbsElecTrueLoadPhase2` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoadPhase3 { get; }` | `ParameterTypeId.RbsElecTrueLoadPhase3` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoadPhasea { get; }` | `ParameterTypeId.RbsElecTrueLoadPhasea` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoadPhaseb { get; }` | `ParameterTypeId.RbsElecTrueLoadPhaseb` | ForgeTypeId |
| `ForgeTypeId RbsElecTrueLoadPhasec { get; }` | `ParameterTypeId.RbsElecTrueLoadPhasec` | ForgeTypeId |
| `ForgeTypeId RbsElecVoltage { get; }` | `ParameterTypeId.RbsElecVoltage` | ForgeTypeId |
| `ForgeTypeId RbsElecVoltageDropParam { get; }` | `ParameterTypeId.RbsElecVoltageDropParam` | ForgeTypeId |
| `ForgeTypeId RbsElecWireCircuits { get; }` | `ParameterTypeId.RbsElecWireCircuits` | ForgeTypeId |
| `ForgeTypeId RbsElecWireElevation { get; }` | `ParameterTypeId.RbsElecWireElevation` | ForgeTypeId |
| `ForgeTypeId RbsElecWireGroundAdjustment { get; }` | `ParameterTypeId.RbsElecWireGroundAdjustment` | ForgeTypeId |
| `ForgeTypeId RbsElecWireHotAdjustment { get; }` | `ParameterTypeId.RbsElecWireHotAdjustment` | ForgeTypeId |
| `ForgeTypeId RbsElecWireNeutralAdjustment { get; }` | `ParameterTypeId.RbsElecWireNeutralAdjustment` | ForgeTypeId |
| `ForgeTypeId RbsElecWireShareGround { get; }` | `ParameterTypeId.RbsElecWireShareGround` | ForgeTypeId |
| `ForgeTypeId RbsElecWireShareNeutral { get; }` | `ParameterTypeId.RbsElecWireShareNeutral` | ForgeTypeId |
| `ForgeTypeId RbsElecWireTickmarkState { get; }` | `ParameterTypeId.RbsElecWireTickmarkState` | ForgeTypeId |
| `ForgeTypeId RbsElecWireType { get; }` | `ParameterTypeId.RbsElecWireType` | ForgeTypeId |
| `ForgeTypeId RbsEndLevelParam { get; }` | `ParameterTypeId.RbsEndLevelParam` | ForgeTypeId |
| `ForgeTypeId RbsEndOffsetParam { get; }` | `ParameterTypeId.RbsEndOffsetParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize { get; }` | `ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution { get; }` | `ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution { get; }` | `ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeDeterminationParam { get; }` | `ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeDeterminationParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisExportCategoryParam { get; }` | `ParameterTypeId.RbsEnergyAnalysisExportCategoryParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisExportComplexityParam { get; }` | `ParameterTypeId.RbsEnergyAnalysisExportComplexityParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisExportGbxmlDefaultsParam { get; }` | `ParameterTypeId.RbsEnergyAnalysisExportGbxmlDefaultsParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisGroundPlaneParam { get; }` | `ParameterTypeId.RbsEnergyAnalysisGroundPlaneParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisIncludeThermalProperties { get; }` | `ParameterTypeId.RbsEnergyAnalysisIncludeThermalProperties` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisProjectPhaseParam { get; }` | `ParameterTypeId.RbsEnergyAnalysisProjectPhaseParam` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSliverSpaceTolerance { get; }` | `ParameterTypeId.RbsEnergyAnalysisSliverSpaceTolerance` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId1 { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId1` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId2 { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId2` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceAzimuth { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceAzimuth` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceCadobjectid { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceCadobjectid` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceOriginX { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceOriginX` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceOriginY { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceOriginY` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceOriginZ { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceOriginZ` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisSurfaceTilt { get; }` | `ParameterTypeId.RbsEnergyAnalysisSurfaceTilt` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewBuildingShellMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewBuildingShellMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewCoordAxisMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewCoordAxisMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewInnerShellMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewInnerShellMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewOuterShellMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewOuterShellMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewRbeMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewRbeMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewShadingSurfacesMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewShadingSurfacesMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewSurfacesMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewSurfacesMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewTransparentMode { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewTransparentMode` | ForgeTypeId |
| `ForgeTypeId RbsEnergyAnalysisViewUpdateSurfaces { get; }` | `ParameterTypeId.RbsEnergyAnalysisViewUpdateSurfaces` | ForgeTypeId |
| `ForgeTypeId RbsEqDiameterParam { get; }` | `ParameterTypeId.RbsEqDiameterParam` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentAnnotationDisplay { get; }` | `ParameterTypeId.RbsFamilyContentAnnotationDisplay` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentDistributionSystem { get; }` | `ParameterTypeId.RbsFamilyContentDistributionSystem` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentOffsetHeight { get; }` | `ParameterTypeId.RbsFamilyContentOffsetHeight` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentOffsetWidth { get; }` | `ParameterTypeId.RbsFamilyContentOffsetWidth` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentSecondaryDistribsys { get; }` | `ParameterTypeId.RbsFamilyContentSecondaryDistribsys` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentTakeoffFixedLength { get; }` | `ParameterTypeId.RbsFamilyContentTakeoffFixedLength` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentTakeoffLength { get; }` | `ParameterTypeId.RbsFamilyContentTakeoffLength` | ForgeTypeId |
| `ForgeTypeId RbsFamilyContentTakeoffProjlength { get; }` | `ParameterTypeId.RbsFamilyContentTakeoffProjlength` | ForgeTypeId |
| `ForgeTypeId RbsFlexductRoundtypeParam { get; }` | `ParameterTypeId.RbsFlexductRoundtypeParam` | ForgeTypeId |
| `ForgeTypeId RbsFlexDuctTypeParam { get; }` | `ParameterTypeId.RbsFlexDuctTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsFlexPatternParam { get; }` | `ParameterTypeId.RbsFlexPatternParam` | ForgeTypeId |
| `ForgeTypeId RbsFlexPipeTypeParam { get; }` | `ParameterTypeId.RbsFlexPipeTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsFlowFactorParam { get; }` | `ParameterTypeId.RbsFlowFactorParam` | ForgeTypeId |
| `ForgeTypeId RbsFlowObsolete { get; }` | `ParameterTypeId.RbsFlowObsolete` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerCoverageParam { get; }` | `ParameterTypeId.RbsFpSprinklerCoverageParam` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerKFactorParam { get; }` | `ParameterTypeId.RbsFpSprinklerKFactorParam` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerOrificeParam { get; }` | `ParameterTypeId.RbsFpSprinklerOrificeParam` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerOrificeSizeParam { get; }` | `ParameterTypeId.RbsFpSprinklerOrificeSizeParam` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerPressureClassParam { get; }` | `ParameterTypeId.RbsFpSprinklerPressureClassParam` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerResponseParam { get; }` | `ParameterTypeId.RbsFpSprinklerResponseParam` | ForgeTypeId |
| `ForgeTypeId RbsFpSprinklerTemperatureRatingParam { get; }` | `ParameterTypeId.RbsFpSprinklerTemperatureRatingParam` | ForgeTypeId |
| `ForgeTypeId RbsFriction { get; }` | `ParameterTypeId.RbsFriction` | ForgeTypeId |
| `ForgeTypeId RbsGbxmlOpeningType { get; }` | `ParameterTypeId.RbsGbxmlOpeningType` | ForgeTypeId |
| `ForgeTypeId RbsGbxmlSurfaceArea { get; }` | `ParameterTypeId.RbsGbxmlSurfaceArea` | ForgeTypeId |
| `ForgeTypeId RbsGbxmlSurfaceName { get; }` | `ParameterTypeId.RbsGbxmlSurfaceName` | ForgeTypeId |
| `ForgeTypeId RbsGbxmlSurfaceType { get; }` | `ParameterTypeId.RbsGbxmlSurfaceType` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadDoorAreaParam { get; }` | `ParameterTypeId.RbsHvacloadDoorAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadDoorCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadDoorCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadFloorAreaParam { get; }` | `ParameterTypeId.RbsHvacloadFloorAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadPartitionAreaParam { get; }` | `ParameterTypeId.RbsHvacloadPartitionAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadPartitionCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadPartitionCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadPlenumCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadPlenumCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadRoofAreaParam { get; }` | `ParameterTypeId.RbsHvacloadRoofAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadRoofCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadRoofCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadSkylightAreaParam { get; }` | `ParameterTypeId.RbsHvacloadSkylightAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadSkylightCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadSkylightCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadWallAreaParam { get; }` | `ParameterTypeId.RbsHvacloadWallAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadWallCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadWallCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadWindowAreaParam { get; }` | `ParameterTypeId.RbsHvacloadWindowAreaParam` | ForgeTypeId |
| `ForgeTypeId RbsHvacloadWindowCoolingLoadParam { get; }` | `ParameterTypeId.RbsHvacloadWindowCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsHydraulicDiameterParam { get; }` | `ParameterTypeId.RbsHydraulicDiameterParam` | ForgeTypeId |
| `ForgeTypeId RbsInsulationLiningVolume { get; }` | `ParameterTypeId.RbsInsulationLiningVolume` | ForgeTypeId |
| `ForgeTypeId RbsInsulationThickness { get; }` | `ParameterTypeId.RbsInsulationThickness` | ForgeTypeId |
| `ForgeTypeId RbsInsulationThicknessForDuct { get; }` | `ParameterTypeId.RbsInsulationThicknessForDuct` | ForgeTypeId |
| `ForgeTypeId RbsInsulationThicknessForPipe { get; }` | `ParameterTypeId.RbsInsulationThicknessForPipe` | ForgeTypeId |
| `ForgeTypeId RbsIsCustomFitting { get; }` | `ParameterTypeId.RbsIsCustomFitting` | ForgeTypeId |
| `ForgeTypeId RbsLiningThickness { get; }` | `ParameterTypeId.RbsLiningThickness` | ForgeTypeId |
| `ForgeTypeId RbsLiningThicknessForDuct { get; }` | `ParameterTypeId.RbsLiningThicknessForDuct` | ForgeTypeId |
| `ForgeTypeId RbsLoadSubClassificationMotor { get; }` | `ParameterTypeId.RbsLoadSubClassificationMotor` | ForgeTypeId |
| `ForgeTypeId RbsLookupTableName { get; }` | `ParameterTypeId.RbsLookupTableName` | ForgeTypeId |
| `ForgeTypeId RbsLossCoefficient { get; }` | `ParameterTypeId.RbsLossCoefficient` | ForgeTypeId |
| `ForgeTypeId RbsMaxFlow { get; }` | `ParameterTypeId.RbsMaxFlow` | ForgeTypeId |
| `ForgeTypeId RbsMinFlow { get; }` | `ParameterTypeId.RbsMinFlow` | ForgeTypeId |
| `ForgeTypeId RbsOffsetParam { get; }` | `ParameterTypeId.RbsOffsetParam` | ForgeTypeId |
| `ForgeTypeId RbsPanelScheduleSheetAppearanceInstParam { get; }` | `ParameterTypeId.RbsPanelScheduleSheetAppearanceInstParam` | ForgeTypeId |
| `ForgeTypeId RbsPanelScheduleSheetAppearanceParam { get; }` | `ParameterTypeId.RbsPanelScheduleSheetAppearanceParam` | ForgeTypeId |
| `ForgeTypeId RbsParallelconduitsHorizontalNumber { get; }` | `ParameterTypeId.RbsParallelconduitsHorizontalNumber` | ForgeTypeId |
| `ForgeTypeId RbsParallelconduitsHorizontalOffsetValue { get; }` | `ParameterTypeId.RbsParallelconduitsHorizontalOffsetValue` | ForgeTypeId |
| `ForgeTypeId RbsParallelconduitsVerticalNumber { get; }` | `ParameterTypeId.RbsParallelconduitsVerticalNumber` | ForgeTypeId |
| `ForgeTypeId RbsParallelconduitsVerticalOffsetValue { get; }` | `ParameterTypeId.RbsParallelconduitsVerticalOffsetValue` | ForgeTypeId |
| `ForgeTypeId RbsParallelpipesHorizontalNumber { get; }` | `ParameterTypeId.RbsParallelpipesHorizontalNumber` | ForgeTypeId |
| `ForgeTypeId RbsParallelpipesHorizontalOffsetValue { get; }` | `ParameterTypeId.RbsParallelpipesHorizontalOffsetValue` | ForgeTypeId |
| `ForgeTypeId RbsParallelpipesVerticalNumber { get; }` | `ParameterTypeId.RbsParallelpipesVerticalNumber` | ForgeTypeId |
| `ForgeTypeId RbsParallelpipesVerticalOffsetValue { get; }` | `ParameterTypeId.RbsParallelpipesVerticalOffsetValue` | ForgeTypeId |
| `ForgeTypeId RbsPartType { get; }` | `ParameterTypeId.RbsPartType` | ForgeTypeId |
| `ForgeTypeId RbsPipeAdditionalFlowParam { get; }` | `ParameterTypeId.RbsPipeAdditionalFlowParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeBottomElevation { get; }` | `ParameterTypeId.RbsPipeBottomElevation` | ForgeTypeId |
| `ForgeTypeId RbsPipeCalculatedSize { get; }` | `ParameterTypeId.RbsPipeCalculatedSize` | ForgeTypeId |
| `ForgeTypeId RbsPipeClassParam { get; }` | `ParameterTypeId.RbsPipeClassParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeConnectiontypeParam { get; }` | `ParameterTypeId.RbsPipeConnectiontypeParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeConnectorSystemClassificationParam { get; }` | `ParameterTypeId.RbsPipeConnectorSystemClassificationParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeCwfuParam { get; }` | `ParameterTypeId.RbsPipeCwfuParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeDiameterParam { get; }` | `ParameterTypeId.RbsPipeDiameterParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFittingLossKfactorParam { get; }` | `ParameterTypeId.RbsPipeFittingLossKfactorParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFittingLossMethodParam { get; }` | `ParameterTypeId.RbsPipeFittingLossMethodParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFittingLossMethodServerParam { get; }` | `ParameterTypeId.RbsPipeFittingLossMethodServerParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFittingLossMethodSettings { get; }` | `ParameterTypeId.RbsPipeFittingLossMethodSettings` | ForgeTypeId |
| `ForgeTypeId RbsPipeFittingLossTableParam { get; }` | `ParameterTypeId.RbsPipeFittingLossTableParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFixtureUnitsParam { get; }` | `ParameterTypeId.RbsPipeFixtureUnitsParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFlowConfigurationParam { get; }` | `ParameterTypeId.RbsPipeFlowConfigurationParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFlowDirectionParam { get; }` | `ParameterTypeId.RbsPipeFlowDirectionParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFlowParam { get; }` | `ParameterTypeId.RbsPipeFlowParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFlowStateParam { get; }` | `ParameterTypeId.RbsPipeFlowStateParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFluidDensityParam { get; }` | `ParameterTypeId.RbsPipeFluidDensityParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFluidTemperatureParam { get; }` | `ParameterTypeId.RbsPipeFluidTemperatureParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFluidTypeParam { get; }` | `ParameterTypeId.RbsPipeFluidTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFluidViscosityParam { get; }` | `ParameterTypeId.RbsPipeFluidViscosityParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeFrictionParam { get; }` | `ParameterTypeId.RbsPipeFrictionParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeHwfuParam { get; }` | `ParameterTypeId.RbsPipeHwfuParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeInnerDiamParam { get; }` | `ParameterTypeId.RbsPipeInnerDiamParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeInsulationThickness { get; }` | `ParameterTypeId.RbsPipeInsulationThickness` | ForgeTypeId |
| `ForgeTypeId RbsPipeInvertElevation { get; }` | `ParameterTypeId.RbsPipeInvertElevation` | ForgeTypeId |
| `ForgeTypeId RbsPipeJointtypeParam { get; }` | `ParameterTypeId.RbsPipeJointtypeParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeMaterialParam { get; }` | `ParameterTypeId.RbsPipeMaterialParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeOuterDiameter { get; }` | `ParameterTypeId.RbsPipeOuterDiameter` | ForgeTypeId |
| `ForgeTypeId RbsPipePressuredropParam { get; }` | `ParameterTypeId.RbsPipePressuredropParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeReynoldsNumberParam { get; }` | `ParameterTypeId.RbsPipeReynoldsNumberParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeSegmentParam { get; }` | `ParameterTypeId.RbsPipeSegmentParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeSizeFormattedParam { get; }` | `ParameterTypeId.RbsPipeSizeFormattedParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeSizeMaximum { get; }` | `ParameterTypeId.RbsPipeSizeMaximum` | ForgeTypeId |
| `ForgeTypeId RbsPipeSizeMinimum { get; }` | `ParameterTypeId.RbsPipeSizeMinimum` | ForgeTypeId |
| `ForgeTypeId RbsPipeSlope { get; }` | `ParameterTypeId.RbsPipeSlope` | ForgeTypeId |
| `ForgeTypeId RbsPipeSlopeDefParam { get; }` | `ParameterTypeId.RbsPipeSlopeDefParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeSlopeOptionsDefParam { get; }` | `ParameterTypeId.RbsPipeSlopeOptionsDefParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeStaticPressure { get; }` | `ParameterTypeId.RbsPipeStaticPressure` | ForgeTypeId |
| `ForgeTypeId RbsPipeSystemCalculationParam { get; }` | `ParameterTypeId.RbsPipeSystemCalculationParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeSystemFixtureUnitParam { get; }` | `ParameterTypeId.RbsPipeSystemFixtureUnitParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeTopElevation { get; }` | `ParameterTypeId.RbsPipeTopElevation` | ForgeTypeId |
| `ForgeTypeId RbsPipeTypeFittingLossKfactorParam { get; }` | `ParameterTypeId.RbsPipeTypeFittingLossKfactorParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeTypeFittingLossMethodParam { get; }` | `ParameterTypeId.RbsPipeTypeFittingLossMethodParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeTypeFittingLossTableParam { get; }` | `ParameterTypeId.RbsPipeTypeFittingLossTableParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeTypeParam { get; }` | `ParameterTypeId.RbsPipeTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeTypeValveLossCvfactorParam { get; }` | `ParameterTypeId.RbsPipeTypeValveLossCvfactorParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeValveLossCvfactorParam { get; }` | `ParameterTypeId.RbsPipeValveLossCvfactorParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeVelocityParam { get; }` | `ParameterTypeId.RbsPipeVelocityParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeVolumeParam { get; }` | `ParameterTypeId.RbsPipeVolumeParam` | ForgeTypeId |
| `ForgeTypeId RbsPipeWallThickness { get; }` | `ParameterTypeId.RbsPipeWallThickness` | ForgeTypeId |
| `ForgeTypeId RbsPipeWfuParam { get; }` | `ParameterTypeId.RbsPipeWfuParam` | ForgeTypeId |
| `ForgeTypeId RbsPipingSystemTypeParam { get; }` | `ParameterTypeId.RbsPipingSystemTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsPressureDrop { get; }` | `ParameterTypeId.RbsPressureDrop` | ForgeTypeId |
| `ForgeTypeId RbsProjectConstructionTypeShadingfactorParam { get; }` | `ParameterTypeId.RbsProjectConstructionTypeShadingfactorParam` | ForgeTypeId |
| `ForgeTypeId RbsProjectLocationParam { get; }` | `ParameterTypeId.RbsProjectLocationParam` | ForgeTypeId |
| `ForgeTypeId RbsProjectReporttypeParam { get; }` | `ParameterTypeId.RbsProjectReporttypeParam` | ForgeTypeId |
| `ForgeTypeId RbsReferenceFreesize { get; }` | `ParameterTypeId.RbsReferenceFreesize` | ForgeTypeId |
| `ForgeTypeId RbsReferenceInsulationThickness { get; }` | `ParameterTypeId.RbsReferenceInsulationThickness` | ForgeTypeId |
| `ForgeTypeId RbsReferenceInsulationType { get; }` | `ParameterTypeId.RbsReferenceInsulationType` | ForgeTypeId |
| `ForgeTypeId RbsReferenceLiningThickness { get; }` | `ParameterTypeId.RbsReferenceLiningThickness` | ForgeTypeId |
| `ForgeTypeId RbsReferenceLiningType { get; }` | `ParameterTypeId.RbsReferenceLiningType` | ForgeTypeId |
| `ForgeTypeId RbsReferenceOverallsize { get; }` | `ParameterTypeId.RbsReferenceOverallsize` | ForgeTypeId |
| `ForgeTypeId RbsReynoldsnumberParam { get; }` | `ParameterTypeId.RbsReynoldsnumberParam` | ForgeTypeId |
| `ForgeTypeId RbsRoomCoefficientUtilization { get; }` | `ParameterTypeId.RbsRoomCoefficientUtilization` | ForgeTypeId |
| `ForgeTypeId RbsRoutingPreferenceParam { get; }` | `ParameterTypeId.RbsRoutingPreferenceParam` | ForgeTypeId |
| `ForgeTypeId RbsSection { get; }` | `ParameterTypeId.RbsSection` | ForgeTypeId |
| `ForgeTypeId RbsSegmentDescriptionParam { get; }` | `ParameterTypeId.RbsSegmentDescriptionParam` | ForgeTypeId |
| `ForgeTypeId RbsServiceTypeParam { get; }` | `ParameterTypeId.RbsServiceTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsShowProfileType { get; }` | `ParameterTypeId.RbsShowProfileType` | ForgeTypeId |
| `ForgeTypeId RbsSizeLock { get; }` | `ParameterTypeId.RbsSizeLock` | ForgeTypeId |
| `ForgeTypeId RbsStartLevelParam { get; }` | `ParameterTypeId.RbsStartLevelParam` | ForgeTypeId |
| `ForgeTypeId RbsStartOffsetParam { get; }` | `ParameterTypeId.RbsStartOffsetParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemAbbreviationParam { get; }` | `ParameterTypeId.RbsSystemAbbreviationParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemBaseElementParam { get; }` | `ParameterTypeId.RbsSystemBaseElementParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemClassificationParam { get; }` | `ParameterTypeId.RbsSystemClassificationParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemFlowConversionMethodParam { get; }` | `ParameterTypeId.RbsSystemFlowConversionMethodParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemNameParam { get; }` | `ParameterTypeId.RbsSystemNameParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemNumElementsParam { get; }` | `ParameterTypeId.RbsSystemNumElementsParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedrop1linedropsymbolParam { get; }` | `ParameterTypeId.RbsSystemRisedrop1linedropsymbolParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedrop1linerisesymbolParam { get; }` | `ParameterTypeId.RbsSystemRisedrop1linerisesymbolParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedrop1lineteedownsymbolParam { get; }` | `ParameterTypeId.RbsSystemRisedrop1lineteedownsymbolParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedrop1lineteeupsymbolParam { get; }` | `ParameterTypeId.RbsSystemRisedrop1lineteeupsymbolParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedrop2linedropsymbolParam { get; }` | `ParameterTypeId.RbsSystemRisedrop2linedropsymbolParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedrop2linerisesymbolParam { get; }` | `ParameterTypeId.RbsSystemRisedrop2linerisesymbolParam` | ForgeTypeId |
| `ForgeTypeId RbsSystemRisedropParam { get; }` | `ParameterTypeId.RbsSystemRisedropParam` | ForgeTypeId |
| `ForgeTypeId RbsVelocity { get; }` | `ParameterTypeId.RbsVelocity` | ForgeTypeId |
| `ForgeTypeId RbsVelocityPressure { get; }` | `ParameterTypeId.RbsVelocityPressure` | ForgeTypeId |
| `ForgeTypeId RbsVoltagetypeMaxvoltageParam { get; }` | `ParameterTypeId.RbsVoltagetypeMaxvoltageParam` | ForgeTypeId |
| `ForgeTypeId RbsVoltagetypeMinvoltageParam { get; }` | `ParameterTypeId.RbsVoltagetypeMinvoltageParam` | ForgeTypeId |
| `ForgeTypeId RbsVoltagetypeVoltageParam { get; }` | `ParameterTypeId.RbsVoltagetypeVoltageParam` | ForgeTypeId |
| `ForgeTypeId RbsWireCircuitDescription { get; }` | `ParameterTypeId.RbsWireCircuitDescription` | ForgeTypeId |
| `ForgeTypeId RbsWireCircuitLoadName { get; }` | `ParameterTypeId.RbsWireCircuitLoadName` | ForgeTypeId |
| `ForgeTypeId RbsWireConduitTypeParam { get; }` | `ParameterTypeId.RbsWireConduitTypeParam` | ForgeTypeId |
| `ForgeTypeId RbsWireInsulationParam { get; }` | `ParameterTypeId.RbsWireInsulationParam` | ForgeTypeId |
| `ForgeTypeId RbsWireMaterialParam { get; }` | `ParameterTypeId.RbsWireMaterialParam` | ForgeTypeId |
| `ForgeTypeId RbsWireMaxConductorSizeParam { get; }` | `ParameterTypeId.RbsWireMaxConductorSizeParam` | ForgeTypeId |
| `ForgeTypeId RbsWireNeutralIncludedInBalancedLoadParam { get; }` | `ParameterTypeId.RbsWireNeutralIncludedInBalancedLoadParam` | ForgeTypeId |
| `ForgeTypeId RbsWireNeutralModeParam { get; }` | `ParameterTypeId.RbsWireNeutralModeParam` | ForgeTypeId |
| `ForgeTypeId RbsWireNeutralMultiplierParam { get; }` | `ParameterTypeId.RbsWireNeutralMultiplierParam` | ForgeTypeId |
| `ForgeTypeId RbsWireNumConductorsParam { get; }` | `ParameterTypeId.RbsWireNumConductorsParam` | ForgeTypeId |
| `ForgeTypeId RbsWireTemperatureRatingParam { get; }` | `ParameterTypeId.RbsWireTemperatureRatingParam` | ForgeTypeId |
| `ForgeTypeId RebarAlignmentOptions { get; }` | `ParameterTypeId.RebarAlignmentOptions` | ForgeTypeId |
| `ForgeTypeId RebarBarDeformationType { get; }` | `ParameterTypeId.RebarBarDeformationType` | ForgeTypeId |
| `ForgeTypeId RebarBarDiameter { get; }` | `ParameterTypeId.RebarBarDiameter` | ForgeTypeId |
| `ForgeTypeId RebarBarHookLengths { get; }` | `ParameterTypeId.RebarBarHookLengths` | ForgeTypeId |
| `ForgeTypeId RebarBarMaximumBendRadius { get; }` | `ParameterTypeId.RebarBarMaximumBendRadius` | ForgeTypeId |
| `ForgeTypeId RebarBarSpliceLengths { get; }` | `ParameterTypeId.RebarBarSpliceLengths` | ForgeTypeId |
| `ForgeTypeId RebarBarStirrupBendDiameter { get; }` | `ParameterTypeId.RebarBarStirrupBendDiameter` | ForgeTypeId |
| `ForgeTypeId RebarBarStyle { get; }` | `ParameterTypeId.RebarBarStyle` | ForgeTypeId |
| `ForgeTypeId RebarConstraintsStatus { get; }` | `ParameterTypeId.RebarConstraintsStatus` | ForgeTypeId |
| `ForgeTypeId RebarContainerBarType { get; }` | `ParameterTypeId.RebarContainerBarType` | ForgeTypeId |
| `ForgeTypeId RebarDistributionType { get; }` | `ParameterTypeId.RebarDistributionType` | ForgeTypeId |
| `ForgeTypeId RebarElemBarSpacing { get; }` | `ParameterTypeId.RebarElemBarSpacing` | ForgeTypeId |
| `ForgeTypeId RebarElemEndtreatmentEnd { get; }` | `ParameterTypeId.RebarElemEndtreatmentEnd` | ForgeTypeId |
| `ForgeTypeId RebarElemEndtreatmentStart { get; }` | `ParameterTypeId.RebarElemEndtreatmentStart` | ForgeTypeId |
| `ForgeTypeId RebarElementRounding { get; }` | `ParameterTypeId.RebarElementRounding` | ForgeTypeId |
| `ForgeTypeId RebarElementVisibility { get; }` | `ParameterTypeId.RebarElementVisibility` | ForgeTypeId |
| `ForgeTypeId RebarElemHookEndOrient { get; }` | `ParameterTypeId.RebarElemHookEndOrient` | ForgeTypeId |
| `ForgeTypeId RebarElemHookEndType { get; }` | `ParameterTypeId.RebarElemHookEndType` | ForgeTypeId |
| `ForgeTypeId RebarElemHookStartOrient { get; }` | `ParameterTypeId.RebarElemHookStartOrient` | ForgeTypeId |
| `ForgeTypeId RebarElemHookStartType { get; }` | `ParameterTypeId.RebarElemHookStartType` | ForgeTypeId |
| `ForgeTypeId RebarElemHookStyle { get; }` | `ParameterTypeId.RebarElemHookStyle` | ForgeTypeId |
| `ForgeTypeId RebarElemHostMark { get; }` | `ParameterTypeId.RebarElemHostMark` | ForgeTypeId |
| `ForgeTypeId RebarElemLayoutRule { get; }` | `ParameterTypeId.RebarElemLayoutRule` | ForgeTypeId |
| `ForgeTypeId RebarElemLength { get; }` | `ParameterTypeId.RebarElemLength` | ForgeTypeId |
| `ForgeTypeId RebarElemQuantityOfBars { get; }` | `ParameterTypeId.RebarElemQuantityOfBars` | ForgeTypeId |
| `ForgeTypeId RebarElemScheduleMark { get; }` | `ParameterTypeId.RebarElemScheduleMark` | ForgeTypeId |
| `ForgeTypeId RebarElemTotalLength { get; }` | `ParameterTypeId.RebarElemTotalLength` | ForgeTypeId |
| `ForgeTypeId RebarFreeFormHookEndPlaneAngle { get; }` | `ParameterTypeId.RebarFreeFormHookEndPlaneAngle` | ForgeTypeId |
| `ForgeTypeId RebarFreeFormHookStartPlaneAngle { get; }` | `ParameterTypeId.RebarFreeFormHookStartPlaneAngle` | ForgeTypeId |
| `ForgeTypeId RebarGeometryType { get; }` | `ParameterTypeId.RebarGeometryType` | ForgeTypeId |
| `ForgeTypeId RebarHookAngle { get; }` | `ParameterTypeId.RebarHookAngle` | ForgeTypeId |
| `ForgeTypeId RebarHookLengthOverride { get; }` | `ParameterTypeId.RebarHookLengthOverride` | ForgeTypeId |
| `ForgeTypeId RebarHookLineLenFactor { get; }` | `ParameterTypeId.RebarHookLineLenFactor` | ForgeTypeId |
| `ForgeTypeId RebarHookRotationAtEnd { get; }` | `ParameterTypeId.RebarHookRotationAtEnd` | ForgeTypeId |
| `ForgeTypeId RebarHookRotationAtEndSchedulesTagsFilters { get; }` | `ParameterTypeId.RebarHookRotationAtEndSchedulesTagsFilters` | ForgeTypeId |
| `ForgeTypeId RebarHookRotationAtStart { get; }` | `ParameterTypeId.RebarHookRotationAtStart` | ForgeTypeId |
| `ForgeTypeId RebarHookRotationAtStartSchedulesTagsFilters { get; }` | `ParameterTypeId.RebarHookRotationAtStartSchedulesTagsFilters` | ForgeTypeId |
| `ForgeTypeId RebarHookStyle { get; }` | `ParameterTypeId.RebarHookStyle` | ForgeTypeId |
| `ForgeTypeId RebarHostCategory { get; }` | `ParameterTypeId.RebarHostCategory` | ForgeTypeId |
| `ForgeTypeId RebarIncludeFirstBar { get; }` | `ParameterTypeId.RebarIncludeFirstBar` | ForgeTypeId |
| `ForgeTypeId RebarIncludeLastBar { get; }` | `ParameterTypeId.RebarIncludeLastBar` | ForgeTypeId |
| `ForgeTypeId RebarInstanceBarDiameter { get; }` | `ParameterTypeId.RebarInstanceBarDiameter` | ForgeTypeId |
| `ForgeTypeId RebarInstanceBarModelDiameter { get; }` | `ParameterTypeId.RebarInstanceBarModelDiameter` | ForgeTypeId |
| `ForgeTypeId RebarInstanceBendDiameter { get; }` | `ParameterTypeId.RebarInstanceBendDiameter` | ForgeTypeId |
| `ForgeTypeId RebarInstanceStirrupTieAttachment { get; }` | `ParameterTypeId.RebarInstanceStirrupTieAttachment` | ForgeTypeId |
| `ForgeTypeId RebarInternalMultiplanar { get; }` | `ParameterTypeId.RebarInternalMultiplanar` | ForgeTypeId |
| `ForgeTypeId RebarInternalMultiplanarArcConnector { get; }` | `ParameterTypeId.RebarInternalMultiplanarArcConnector` | ForgeTypeId |
| `ForgeTypeId RebarInternalMultiplanarDuplicate { get; }` | `ParameterTypeId.RebarInternalMultiplanarDuplicate` | ForgeTypeId |
| `ForgeTypeId RebarInternalMultiplanarEndConnector { get; }` | `ParameterTypeId.RebarInternalMultiplanarEndConnector` | ForgeTypeId |
| `ForgeTypeId RebarInternalMultiplanarStartConnector { get; }` | `ParameterTypeId.RebarInternalMultiplanarStartConnector` | ForgeTypeId |
| `ForgeTypeId RebarMaximSuffix { get; }` | `ParameterTypeId.RebarMaximSuffix` | ForgeTypeId |
| `ForgeTypeId RebarMaximumNumber { get; }` | `ParameterTypeId.RebarMaximumNumber` | ForgeTypeId |
| `ForgeTypeId RebarMaxLength { get; }` | `ParameterTypeId.RebarMaxLength` | ForgeTypeId |
| `ForgeTypeId RebarMinimSuffix { get; }` | `ParameterTypeId.RebarMinimSuffix` | ForgeTypeId |
| `ForgeTypeId RebarMinimumNumber { get; }` | `ParameterTypeId.RebarMinimumNumber` | ForgeTypeId |
| `ForgeTypeId RebarMinLength { get; }` | `ParameterTypeId.RebarMinLength` | ForgeTypeId |
| `ForgeTypeId RebarModelBarDiameter { get; }` | `ParameterTypeId.RebarModelBarDiameter` | ForgeTypeId |
| `ForgeTypeId RebarModifiedSet { get; }` | `ParameterTypeId.RebarModifiedSet` | ForgeTypeId |
| `ForgeTypeId RebarNumber { get; }` | `ParameterTypeId.RebarNumber` | ForgeTypeId |
| `ForgeTypeId RebarNumberSuffix { get; }` | `ParameterTypeId.RebarNumberSuffix` | ForgeTypeId |
| `ForgeTypeId RebarQuanityByDistrib { get; }` | `ParameterTypeId.RebarQuanityByDistrib` | ForgeTypeId |
| `ForgeTypeId RebarShape { get; }` | `ParameterTypeId.RebarShape` | ForgeTypeId |
| `ForgeTypeId RebarShapeAllowedBarTypes { get; }` | `ParameterTypeId.RebarShapeAllowedBarTypes` | ForgeTypeId |
| `ForgeTypeId RebarShapeEndHookLength { get; }` | `ParameterTypeId.RebarShapeEndHookLength` | ForgeTypeId |
| `ForgeTypeId RebarShapeEndHookOffset { get; }` | `ParameterTypeId.RebarShapeEndHookOffset` | ForgeTypeId |
| `ForgeTypeId RebarShapeEndtreatmentEndType { get; }` | `ParameterTypeId.RebarShapeEndtreatmentEndType` | ForgeTypeId |
| `ForgeTypeId RebarShapeEndtreatmentStartType { get; }` | `ParameterTypeId.RebarShapeEndtreatmentStartType` | ForgeTypeId |
| `ForgeTypeId RebarShapeHookEndType { get; }` | `ParameterTypeId.RebarShapeHookEndType` | ForgeTypeId |
| `ForgeTypeId RebarShapeHookRotationAtEnd { get; }` | `ParameterTypeId.RebarShapeHookRotationAtEnd` | ForgeTypeId |
| `ForgeTypeId RebarShapeHookRotationAtStart { get; }` | `ParameterTypeId.RebarShapeHookRotationAtStart` | ForgeTypeId |
| `ForgeTypeId RebarShapeHookStartType { get; }` | `ParameterTypeId.RebarShapeHookStartType` | ForgeTypeId |
| `ForgeTypeId RebarShapeHookStyle { get; }` | `ParameterTypeId.RebarShapeHookStyle` | ForgeTypeId |
| `ForgeTypeId RebarShapeImage { get; }` | `ParameterTypeId.RebarShapeImage` | ForgeTypeId |
| `ForgeTypeId RebarShapeOutOfPlaneBendDiameter { get; }` | `ParameterTypeId.RebarShapeOutOfPlaneBendDiameter` | ForgeTypeId |
| `ForgeTypeId RebarShapeParamEndHookTanLen { get; }` | `ParameterTypeId.RebarShapeParamEndHookTanLen` | ForgeTypeId |
| `ForgeTypeId RebarShapeParamStartHookTanLen { get; }` | `ParameterTypeId.RebarShapeParamStartHookTanLen` | ForgeTypeId |
| `ForgeTypeId RebarShapeSpiralBaseFinishingTurns { get; }` | `ParameterTypeId.RebarShapeSpiralBaseFinishingTurns` | ForgeTypeId |
| `ForgeTypeId RebarShapeSpiralHeight { get; }` | `ParameterTypeId.RebarShapeSpiralHeight` | ForgeTypeId |
| `ForgeTypeId RebarShapeSpiralPitch { get; }` | `ParameterTypeId.RebarShapeSpiralPitch` | ForgeTypeId |
| `ForgeTypeId RebarShapeSpiralTopFinishingTurns { get; }` | `ParameterTypeId.RebarShapeSpiralTopFinishingTurns` | ForgeTypeId |
| `ForgeTypeId RebarShapeStartHookLength { get; }` | `ParameterTypeId.RebarShapeStartHookLength` | ForgeTypeId |
| `ForgeTypeId RebarShapeStartHookOffset { get; }` | `ParameterTypeId.RebarShapeStartHookOffset` | ForgeTypeId |
| `ForgeTypeId RebarShapeStirrupTieAttachment { get; }` | `ParameterTypeId.RebarShapeStirrupTieAttachment` | ForgeTypeId |
| `ForgeTypeId RebarSpliceLapLengthMultiplier { get; }` | `ParameterTypeId.RebarSpliceLapLengthMultiplier` | ForgeTypeId |
| `ForgeTypeId RebarSpliceShiftBars { get; }` | `ParameterTypeId.RebarSpliceShiftBars` | ForgeTypeId |
| `ForgeTypeId RebarSpliceSpliceLinePosition { get; }` | `ParameterTypeId.RebarSpliceSpliceLinePosition` | ForgeTypeId |
| `ForgeTypeId RebarSpliceStaggerLengthMultiplier { get; }` | `ParameterTypeId.RebarSpliceStaggerLengthMultiplier` | ForgeTypeId |
| `ForgeTypeId RebarStaggeredSet { get; }` | `ParameterTypeId.RebarStaggeredSet` | ForgeTypeId |
| `ForgeTypeId RebarStaggerOffsetAtEnd { get; }` | `ParameterTypeId.RebarStaggerOffsetAtEnd` | ForgeTypeId |
| `ForgeTypeId RebarStaggerOffsetAtStart { get; }` | `ParameterTypeId.RebarStaggerOffsetAtStart` | ForgeTypeId |
| `ForgeTypeId RebarStandardBendDiameter { get; }` | `ParameterTypeId.RebarStandardBendDiameter` | ForgeTypeId |
| `ForgeTypeId RebarStandardHookBendDiameter { get; }` | `ParameterTypeId.RebarStandardHookBendDiameter` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveBackDirn1 { get; }` | `ParameterTypeId.RebarSystemActiveBackDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveBackDirn2 { get; }` | `ParameterTypeId.RebarSystemActiveBackDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveBottomDir1Generic { get; }` | `ParameterTypeId.RebarSystemActiveBottomDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveBottomDir2Generic { get; }` | `ParameterTypeId.RebarSystemActiveBottomDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveBottomDirn1 { get; }` | `ParameterTypeId.RebarSystemActiveBottomDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemActiveBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveFrontDirn1 { get; }` | `ParameterTypeId.RebarSystemActiveFrontDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveFrontDirn2 { get; }` | `ParameterTypeId.RebarSystemActiveFrontDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveTopDir1Generic { get; }` | `ParameterTypeId.RebarSystemActiveTopDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveTopDir2Generic { get; }` | `ParameterTypeId.RebarSystemActiveTopDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveTopDirn1 { get; }` | `ParameterTypeId.RebarSystemActiveTopDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemActiveTopDirn2 { get; }` | `ParameterTypeId.RebarSystemActiveTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemAddlBottomOffset { get; }` | `ParameterTypeId.RebarSystemAddlBottomOffset` | ForgeTypeId |
| `ForgeTypeId RebarSystemAddlExteriorOffset { get; }` | `ParameterTypeId.RebarSystemAddlExteriorOffset` | ForgeTypeId |
| `ForgeTypeId RebarSystemAddlInteriorOffset { get; }` | `ParameterTypeId.RebarSystemAddlInteriorOffset` | ForgeTypeId |
| `ForgeTypeId RebarSystemAddlTopOffset { get; }` | `ParameterTypeId.RebarSystemAddlTopOffset` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeBackDirn1 { get; }` | `ParameterTypeId.RebarSystemBarTypeBackDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeBackDirn2 { get; }` | `ParameterTypeId.RebarSystemBarTypeBackDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeBottomDir1Generic { get; }` | `ParameterTypeId.RebarSystemBarTypeBottomDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeBottomDir2Generic { get; }` | `ParameterTypeId.RebarSystemBarTypeBottomDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeBottomDirn1 { get; }` | `ParameterTypeId.RebarSystemBarTypeBottomDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemBarTypeBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeFrontDirn1 { get; }` | `ParameterTypeId.RebarSystemBarTypeFrontDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeFrontDirn2 { get; }` | `ParameterTypeId.RebarSystemBarTypeFrontDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeTopDir1Generic { get; }` | `ParameterTypeId.RebarSystemBarTypeTopDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeTopDir2Generic { get; }` | `ParameterTypeId.RebarSystemBarTypeTopDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeTopDirn1 { get; }` | `ParameterTypeId.RebarSystemBarTypeTopDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemBarTypeTopDirn2 { get; }` | `ParameterTypeId.RebarSystemBarTypeTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemBottomMajorMatchesBottomMinor { get; }` | `ParameterTypeId.RebarSystemBottomMajorMatchesBottomMinor` | ForgeTypeId |
| `ForgeTypeId RebarSystemCoverBottom { get; }` | `ParameterTypeId.RebarSystemCoverBottom` | ForgeTypeId |
| `ForgeTypeId RebarSystemCoverSide { get; }` | `ParameterTypeId.RebarSystemCoverSide` | ForgeTypeId |
| `ForgeTypeId RebarSystemCoverTop { get; }` | `ParameterTypeId.RebarSystemCoverTop` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientBackDirn1 { get; }` | `ParameterTypeId.RebarSystemHookOrientBackDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientBackDirn2 { get; }` | `ParameterTypeId.RebarSystemHookOrientBackDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientBottomDirn1 { get; }` | `ParameterTypeId.RebarSystemHookOrientBottomDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemHookOrientBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientFrontDirn1 { get; }` | `ParameterTypeId.RebarSystemHookOrientFrontDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientFrontDirn2 { get; }` | `ParameterTypeId.RebarSystemHookOrientFrontDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientTopDirn1 { get; }` | `ParameterTypeId.RebarSystemHookOrientTopDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookOrientTopDirn2 { get; }` | `ParameterTypeId.RebarSystemHookOrientTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeBackDirn1 { get; }` | `ParameterTypeId.RebarSystemHookTypeBackDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeBackDirn2 { get; }` | `ParameterTypeId.RebarSystemHookTypeBackDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeBottomDirn1 { get; }` | `ParameterTypeId.RebarSystemHookTypeBottomDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemHookTypeBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeFrontDirn1 { get; }` | `ParameterTypeId.RebarSystemHookTypeFrontDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeFrontDirn2 { get; }` | `ParameterTypeId.RebarSystemHookTypeFrontDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeTopDirn1 { get; }` | `ParameterTypeId.RebarSystemHookTypeTopDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemHookTypeTopDirn2 { get; }` | `ParameterTypeId.RebarSystemHookTypeTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryBottomDir1NoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryBottomDir1NoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryBottomDir1WithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryBottomDir1WithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryBottomDir2NoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryBottomDir2NoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryBottomDir2WithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryBottomDir2WithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryDir1NoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryDir1NoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryDir1WithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryDir1WithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryDir2NoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryDir2NoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryDir2WithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryDir2WithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryNoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryNoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryTopDir1NoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryTopDir1NoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryTopDir1WithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryTopDir1WithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryTopDir2NoSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryTopDir2NoSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryTopDir2WithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryTopDir2WithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayerSummaryWithSpacing { get; }` | `ParameterTypeId.RebarSystemLayerSummaryWithSpacing` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayoutRule { get; }` | `ParameterTypeId.RebarSystemLayoutRule` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesBackDirn1 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesBackDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesBackDirn2 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesBackDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesBottomDir1Generic { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesBottomDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesBottomDir2Generic { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesBottomDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesBottomDirn1 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesBottomDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesFrontDirn1 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesFrontDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesFrontDirn2 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesFrontDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesTopDir1Generic { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesTopDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesTopDir2Generic { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesTopDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesTopDirn1 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesTopDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemNumberOfLinesTopDirn2 { get; }` | `ParameterTypeId.RebarSystemNumberOfLinesTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemOverride { get; }` | `ParameterTypeId.RebarSystemOverride` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingBackDirn1 { get; }` | `ParameterTypeId.RebarSystemSpacingBackDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingBackDirn2 { get; }` | `ParameterTypeId.RebarSystemSpacingBackDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingBottomDir1Generic { get; }` | `ParameterTypeId.RebarSystemSpacingBottomDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingBottomDir2Generic { get; }` | `ParameterTypeId.RebarSystemSpacingBottomDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingBottomDirn1 { get; }` | `ParameterTypeId.RebarSystemSpacingBottomDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemSpacingBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingFrontDirn1 { get; }` | `ParameterTypeId.RebarSystemSpacingFrontDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingFrontDirn2 { get; }` | `ParameterTypeId.RebarSystemSpacingFrontDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingTopDir1Generic { get; }` | `ParameterTypeId.RebarSystemSpacingTopDir1Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingTopDir2Generic { get; }` | `ParameterTypeId.RebarSystemSpacingTopDir2Generic` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingTopDirn1 { get; }` | `ParameterTypeId.RebarSystemSpacingTopDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpacingTopDirn2 { get; }` | `ParameterTypeId.RebarSystemSpacingTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpanactiveDirn1 { get; }` | `ParameterTypeId.RebarSystemSpanactiveDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpanactiveDirn2 { get; }` | `ParameterTypeId.RebarSystemSpanactiveDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpanhookBottomDirn2 { get; }` | `ParameterTypeId.RebarSystemSpanhookBottomDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpanhookLeftDirn1 { get; }` | `ParameterTypeId.RebarSystemSpanhookLeftDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpanhookRightDirn1 { get; }` | `ParameterTypeId.RebarSystemSpanhookRightDirn1` | ForgeTypeId |
| `ForgeTypeId RebarSystemSpanhookTopDirn2 { get; }` | `ParameterTypeId.RebarSystemSpanhookTopDirn2` | ForgeTypeId |
| `ForgeTypeId RebarSystemTopMajorMatchesBottomMajor { get; }` | `ParameterTypeId.RebarSystemTopMajorMatchesBottomMajor` | ForgeTypeId |
| `ForgeTypeId RebarSystemTopMajorMatchesTopMinor { get; }` | `ParameterTypeId.RebarSystemTopMajorMatchesTopMinor` | ForgeTypeId |
| `ForgeTypeId RebarSystemTopMinorMatchesBottomMinor { get; }` | `ParameterTypeId.RebarSystemTopMinorMatchesBottomMinor` | ForgeTypeId |
| `ForgeTypeId RebarWorkshopInstructions { get; }` | `ParameterTypeId.RebarWorkshopInstructions` | ForgeTypeId |
| `ForgeTypeId RectMullionThick { get; }` | `ParameterTypeId.RectMullionThick` | ForgeTypeId |
| `ForgeTypeId RectMullionWidth1 { get; }` | `ParameterTypeId.RectMullionWidth1` | ForgeTypeId |
| `ForgeTypeId RectMullionWidth2 { get; }` | `ParameterTypeId.RectMullionWidth2` | ForgeTypeId |
| `ForgeTypeId ReferenceBaseOnHost { get; }` | `ParameterTypeId.ReferenceBaseOnHost` | ForgeTypeId |
| `ForgeTypeId ReferencedView { get; }` | `ParameterTypeId.ReferencedView` | ForgeTypeId |
| `ForgeTypeId ReferenceLineSubcategory { get; }` | `ParameterTypeId.ReferenceLineSubcategory` | ForgeTypeId |
| `ForgeTypeId ReferenceOtherViewUiRefView { get; }` | `ParameterTypeId.ReferenceOtherViewUiRefView` | ForgeTypeId |
| `ForgeTypeId ReferenceOtherViewUiToggle { get; }` | `ParameterTypeId.ReferenceOtherViewUiToggle` | ForgeTypeId |
| `ForgeTypeId ReferenceViewerAttrTag { get; }` | `ParameterTypeId.ReferenceViewerAttrTag` | ForgeTypeId |
| `ForgeTypeId ReferenceViewerTargetView { get; }` | `ParameterTypeId.ReferenceViewerTargetView` | ForgeTypeId |
| `ForgeTypeId ReferenceViewerUiTargetFilter { get; }` | `ParameterTypeId.ReferenceViewerUiTargetFilter` | ForgeTypeId |
| `ForgeTypeId ReferenceViewerUiTargetView { get; }` | `ParameterTypeId.ReferenceViewerUiTargetView` | ForgeTypeId |
| `ForgeTypeId RefTableElemName { get; }` | `ParameterTypeId.RefTableElemName` | ForgeTypeId |
| `ForgeTypeId RefTableParamName { get; }` | `ParameterTypeId.RefTableParamName` | ForgeTypeId |
| `ForgeTypeId ReinEstBarLength { get; }` | `ParameterTypeId.ReinEstBarLength` | ForgeTypeId |
| `ForgeTypeId ReinEstBarVolume { get; }` | `ParameterTypeId.ReinEstBarVolume` | ForgeTypeId |
| `ForgeTypeId ReinEstNumberOfBars { get; }` | `ParameterTypeId.ReinEstNumberOfBars` | ForgeTypeId |
| `ForgeTypeId ReinforcementVolume { get; }` | `ParameterTypeId.ReinforcementVolume` | ForgeTypeId |
| `ForgeTypeId RelatedToMass { get; }` | `ParameterTypeId.RelatedToMass` | ForgeTypeId |
| `ForgeTypeId RelativeRoughness { get; }` | `ParameterTypeId.RelativeRoughness` | ForgeTypeId |
| `ForgeTypeId RenderPlantHeight { get; }` | `ParameterTypeId.RenderPlantHeight` | ForgeTypeId |
| `ForgeTypeId RenderPlantName { get; }` | `ParameterTypeId.RenderPlantName` | ForgeTypeId |
| `ForgeTypeId RenderPlantTrimHeight { get; }` | `ParameterTypeId.RenderPlantTrimHeight` | ForgeTypeId |
| `ForgeTypeId RenderRpcFilename { get; }` | `ParameterTypeId.RenderRpcFilename` | ForgeTypeId |
| `ForgeTypeId RenderRpcProperties { get; }` | `ParameterTypeId.RenderRpcProperties` | ForgeTypeId |
| `ForgeTypeId RepeatingDetailElement { get; }` | `ParameterTypeId.RepeatingDetailElement` | ForgeTypeId |
| `ForgeTypeId RepeatingDetailInside { get; }` | `ParameterTypeId.RepeatingDetailInside` | ForgeTypeId |
| `ForgeTypeId RepeatingDetailLayout { get; }` | `ParameterTypeId.RepeatingDetailLayout` | ForgeTypeId |
| `ForgeTypeId RepeatingDetailNumber { get; }` | `ParameterTypeId.RepeatingDetailNumber` | ForgeTypeId |
| `ForgeTypeId RepeatingDetailRotation { get; }` | `ParameterTypeId.RepeatingDetailRotation` | ForgeTypeId |
| `ForgeTypeId RepeatingDetailSpacing { get; }` | `ParameterTypeId.RepeatingDetailSpacing` | ForgeTypeId |
| `ForgeTypeId RevealProfileParam { get; }` | `ParameterTypeId.RevealProfileParam` | ForgeTypeId |
| `ForgeTypeId RevisionCloudRevision { get; }` | `ParameterTypeId.RevisionCloudRevision` | ForgeTypeId |
| `ForgeTypeId RevisionCloudRevisionDate { get; }` | `ParameterTypeId.RevisionCloudRevisionDate` | ForgeTypeId |
| `ForgeTypeId RevisionCloudRevisionDescription { get; }` | `ParameterTypeId.RevisionCloudRevisionDescription` | ForgeTypeId |
| `ForgeTypeId RevisionCloudRevisionIssuedBy { get; }` | `ParameterTypeId.RevisionCloudRevisionIssuedBy` | ForgeTypeId |
| `ForgeTypeId RevisionCloudRevisionIssuedTo { get; }` | `ParameterTypeId.RevisionCloudRevisionIssuedTo` | ForgeTypeId |
| `ForgeTypeId RevisionCloudRevisionNum { get; }` | `ParameterTypeId.RevisionCloudRevisionNum` | ForgeTypeId |
| `ForgeTypeId RevolutionEndAngle { get; }` | `ParameterTypeId.RevolutionEndAngle` | ForgeTypeId |
| `ForgeTypeId RevolutionStartAngle { get; }` | `ParameterTypeId.RevolutionStartAngle` | ForgeTypeId |
| `ForgeTypeId RgbBParam { get; }` | `ParameterTypeId.RgbBParam` | ForgeTypeId |
| `ForgeTypeId RgbGParam { get; }` | `ParameterTypeId.RgbGParam` | ForgeTypeId |
| `ForgeTypeId RgbRParam { get; }` | `ParameterTypeId.RgbRParam` | ForgeTypeId |
| `ForgeTypeId RoofAttrDefaultThicknessParam { get; }` | `ParameterTypeId.RoofAttrDefaultThicknessParam` | ForgeTypeId |
| `ForgeTypeId RoofAttrThicknessParam { get; }` | `ParameterTypeId.RoofAttrThicknessParam` | ForgeTypeId |
| `ForgeTypeId RoofBaseLevelParam { get; }` | `ParameterTypeId.RoofBaseLevelParam` | ForgeTypeId |
| `ForgeTypeId RoofConstraintLevelParam { get; }` | `ParameterTypeId.RoofConstraintLevelParam` | ForgeTypeId |
| `ForgeTypeId RoofConstraintOffsetParam { get; }` | `ParameterTypeId.RoofConstraintOffsetParam` | ForgeTypeId |
| `ForgeTypeId RoofCurveHeightAtWall { get; }` | `ParameterTypeId.RoofCurveHeightAtWall` | ForgeTypeId |
| `ForgeTypeId RoofCurveHeightOffset { get; }` | `ParameterTypeId.RoofCurveHeightOffset` | ForgeTypeId |
| `ForgeTypeId RoofCurveIsSlopeDefining { get; }` | `ParameterTypeId.RoofCurveIsSlopeDefining` | ForgeTypeId |
| `ForgeTypeId RoofEaveCutParam { get; }` | `ParameterTypeId.RoofEaveCutParam` | ForgeTypeId |
| `ForgeTypeId RoofFacesLocation { get; }` | `ParameterTypeId.RoofFacesLocation` | ForgeTypeId |
| `ForgeTypeId RoofLevelOffsetParam { get; }` | `ParameterTypeId.RoofLevelOffsetParam` | ForgeTypeId |
| `ForgeTypeId RoofRafterOrTrussParam { get; }` | `ParameterTypeId.RoofRafterOrTrussParam` | ForgeTypeId |
| `ForgeTypeId RoofSlope { get; }` | `ParameterTypeId.RoofSlope` | ForgeTypeId |
| `ForgeTypeId RoofStructureIdParam { get; }` | `ParameterTypeId.RoofStructureIdParam` | ForgeTypeId |
| `ForgeTypeId RoofUptoLevelOffsetParam { get; }` | `ParameterTypeId.RoofUptoLevelOffsetParam` | ForgeTypeId |
| `ForgeTypeId RoofUptoLevelParam { get; }` | `ParameterTypeId.RoofUptoLevelParam` | ForgeTypeId |
| `ForgeTypeId RoomActualExhaustAirflowParam { get; }` | `ParameterTypeId.RoomActualExhaustAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomActualLightingLoadParam { get; }` | `ParameterTypeId.RoomActualLightingLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomActualLightingLoadPerAreaParam { get; }` | `ParameterTypeId.RoomActualLightingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomActualPowerLoadParam { get; }` | `ParameterTypeId.RoomActualPowerLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomActualPowerLoadPerAreaParam { get; }` | `ParameterTypeId.RoomActualPowerLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomActualReturnAirflowParam { get; }` | `ParameterTypeId.RoomActualReturnAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomActualSupplyAirflowParam { get; }` | `ParameterTypeId.RoomActualSupplyAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomAirChangesPerHourParam { get; }` | `ParameterTypeId.RoomAirChangesPerHourParam` | ForgeTypeId |
| `ForgeTypeId RoomArea { get; }` | `ParameterTypeId.RoomArea` | ForgeTypeId |
| `ForgeTypeId RoomAreaPerPersonParam { get; }` | `ParameterTypeId.RoomAreaPerPersonParam` | ForgeTypeId |
| `ForgeTypeId RoomBaseHeatLoadOnParam { get; }` | `ParameterTypeId.RoomBaseHeatLoadOnParam` | ForgeTypeId |
| `ForgeTypeId RoomBaseLightingLoadOnParam { get; }` | `ParameterTypeId.RoomBaseLightingLoadOnParam` | ForgeTypeId |
| `ForgeTypeId RoomBasePowerLoadOnParam { get; }` | `ParameterTypeId.RoomBasePowerLoadOnParam` | ForgeTypeId |
| `ForgeTypeId RoomBaseReturnAirflowOnParam { get; }` | `ParameterTypeId.RoomBaseReturnAirflowOnParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculatedCoolingLoadParam { get; }` | `ParameterTypeId.RoomCalculatedCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculatedCoolingLoadPerAreaParam { get; }` | `ParameterTypeId.RoomCalculatedCoolingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculatedHeatingLoadParam { get; }` | `ParameterTypeId.RoomCalculatedHeatingLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculatedHeatingLoadPerAreaParam { get; }` | `ParameterTypeId.RoomCalculatedHeatingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculatedSupplyAirflowParam { get; }` | `ParameterTypeId.RoomCalculatedSupplyAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculatedSupplyAirflowPerAreaParam { get; }` | `ParameterTypeId.RoomCalculatedSupplyAirflowPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomCalculationPoint { get; }` | `ParameterTypeId.RoomCalculationPoint` | ForgeTypeId |
| `ForgeTypeId RoomComputationHeight { get; }` | `ParameterTypeId.RoomComputationHeight` | ForgeTypeId |
| `ForgeTypeId RoomComputationMethod { get; }` | `ParameterTypeId.RoomComputationMethod` | ForgeTypeId |
| `ForgeTypeId RoomConditionTypeParam { get; }` | `ParameterTypeId.RoomConditionTypeParam` | ForgeTypeId |
| `ForgeTypeId RoomConstructionSetParam { get; }` | `ParameterTypeId.RoomConstructionSetParam` | ForgeTypeId |
| `ForgeTypeId RoomDepartment { get; }` | `ParameterTypeId.RoomDepartment` | ForgeTypeId |
| `ForgeTypeId RoomDesignCoolingLoadParam { get; }` | `ParameterTypeId.RoomDesignCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignExhaustAirflowParam { get; }` | `ParameterTypeId.RoomDesignExhaustAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignHeatingLoadParam { get; }` | `ParameterTypeId.RoomDesignHeatingLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignLightingLoadParam { get; }` | `ParameterTypeId.RoomDesignLightingLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignLightingLoadPerAreaParam { get; }` | `ParameterTypeId.RoomDesignLightingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignMechanicalLoadPerAreaParam { get; }` | `ParameterTypeId.RoomDesignMechanicalLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignOtherLoadPerAreaParam { get; }` | `ParameterTypeId.RoomDesignOtherLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignPowerLoadParam { get; }` | `ParameterTypeId.RoomDesignPowerLoadParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignPowerLoadPerAreaParam { get; }` | `ParameterTypeId.RoomDesignPowerLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignReturnAirflowParam { get; }` | `ParameterTypeId.RoomDesignReturnAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomDesignSupplyAirflowParam { get; }` | `ParameterTypeId.RoomDesignSupplyAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomEditElectricalLoadsParam { get; }` | `ParameterTypeId.RoomEditElectricalLoadsParam` | ForgeTypeId |
| `ForgeTypeId RoomEditPeopleLoadsParam { get; }` | `ParameterTypeId.RoomEditPeopleLoadsParam` | ForgeTypeId |
| `ForgeTypeId RoomFinishBase { get; }` | `ParameterTypeId.RoomFinishBase` | ForgeTypeId |
| `ForgeTypeId RoomFinishCeiling { get; }` | `ParameterTypeId.RoomFinishCeiling` | ForgeTypeId |
| `ForgeTypeId RoomFinishFloor { get; }` | `ParameterTypeId.RoomFinishFloor` | ForgeTypeId |
| `ForgeTypeId RoomFinishWall { get; }` | `ParameterTypeId.RoomFinishWall` | ForgeTypeId |
| `ForgeTypeId RoomHeight { get; }` | `ParameterTypeId.RoomHeight` | ForgeTypeId |
| `ForgeTypeId RoomLevelId { get; }` | `ParameterTypeId.RoomLevelId` | ForgeTypeId |
| `ForgeTypeId RoomLightingLoadUnitsParam { get; }` | `ParameterTypeId.RoomLightingLoadUnitsParam` | ForgeTypeId |
| `ForgeTypeId RoomLowerOffset { get; }` | `ParameterTypeId.RoomLowerOffset` | ForgeTypeId |
| `ForgeTypeId RoomName { get; }` | `ParameterTypeId.RoomName` | ForgeTypeId |
| `ForgeTypeId RoomNumber { get; }` | `ParameterTypeId.RoomNumber` | ForgeTypeId |
| `ForgeTypeId RoomNumberOfPeopleParam { get; }` | `ParameterTypeId.RoomNumberOfPeopleParam` | ForgeTypeId |
| `ForgeTypeId RoomOccupancy { get; }` | `ParameterTypeId.RoomOccupancy` | ForgeTypeId |
| `ForgeTypeId RoomOccupancyUnitParam { get; }` | `ParameterTypeId.RoomOccupancyUnitParam` | ForgeTypeId |
| `ForgeTypeId RoomOutdoorAirflowParam { get; }` | `ParameterTypeId.RoomOutdoorAirflowParam` | ForgeTypeId |
| `ForgeTypeId RoomOutdoorAirflowStandardParam { get; }` | `ParameterTypeId.RoomOutdoorAirflowStandardParam` | ForgeTypeId |
| `ForgeTypeId RoomOutdoorAirInfoParam { get; }` | `ParameterTypeId.RoomOutdoorAirInfoParam` | ForgeTypeId |
| `ForgeTypeId RoomOutdoorAirPerAreaParam { get; }` | `ParameterTypeId.RoomOutdoorAirPerAreaParam` | ForgeTypeId |
| `ForgeTypeId RoomOutdoorAirPerPersonParam { get; }` | `ParameterTypeId.RoomOutdoorAirPerPersonParam` | ForgeTypeId |
| `ForgeTypeId RoomPeopleLatentHeatGainPerPersonParam { get; }` | `ParameterTypeId.RoomPeopleLatentHeatGainPerPersonParam` | ForgeTypeId |
| `ForgeTypeId RoomPeopleSensibleHeatGainPerPersonParam { get; }` | `ParameterTypeId.RoomPeopleSensibleHeatGainPerPersonParam` | ForgeTypeId |
| `ForgeTypeId RoomPeopleTotalHeatGainPerPersonParam { get; }` | `ParameterTypeId.RoomPeopleTotalHeatGainPerPersonParam` | ForgeTypeId |
| `ForgeTypeId RoomPerimeter { get; }` | `ParameterTypeId.RoomPerimeter` | ForgeTypeId |
| `ForgeTypeId RoomPhase { get; }` | `ParameterTypeId.RoomPhase` | ForgeTypeId |
| `ForgeTypeId RoomPhaseId { get; }` | `ParameterTypeId.RoomPhaseId` | ForgeTypeId |
| `ForgeTypeId RoomPlenumLightingParam { get; }` | `ParameterTypeId.RoomPlenumLightingParam` | ForgeTypeId |
| `ForgeTypeId RoomPowerLoadUnitsParam { get; }` | `ParameterTypeId.RoomPowerLoadUnitsParam` | ForgeTypeId |
| `ForgeTypeId RoomSpaceTypeParam { get; }` | `ParameterTypeId.RoomSpaceTypeParam` | ForgeTypeId |
| `ForgeTypeId RoomTagOrientationParam { get; }` | `ParameterTypeId.RoomTagOrientationParam` | ForgeTypeId |
| `ForgeTypeId RoomUpperLevel { get; }` | `ParameterTypeId.RoomUpperLevel` | ForgeTypeId |
| `ForgeTypeId RoomUpperOffset { get; }` | `ParameterTypeId.RoomUpperOffset` | ForgeTypeId |
| `ForgeTypeId RoomVolume { get; }` | `ParameterTypeId.RoomVolume` | ForgeTypeId |
| `ForgeTypeId RouteAnalysisSettingsParam { get; }` | `ParameterTypeId.RouteAnalysisSettingsParam` | ForgeTypeId |
| `ForgeTypeId RoutingPreferenceParam { get; }` | `ParameterTypeId.RoutingPreferenceParam` | ForgeTypeId |
| `ForgeTypeId RvtHostLevel { get; }` | `ParameterTypeId.RvtHostLevel` | ForgeTypeId |
| `ForgeTypeId RvtLevelOffset { get; }` | `ParameterTypeId.RvtLevelOffset` | ForgeTypeId |
| `ForgeTypeId RvtLinkFileNameWithoutExt { get; }` | `ParameterTypeId.RvtLinkFileNameWithoutExt` | ForgeTypeId |
| `ForgeTypeId RvtLinkInstanceName { get; }` | `ParameterTypeId.RvtLinkInstanceName` | ForgeTypeId |
| `ForgeTypeId RvtLinkInstanceProjectInformation { get; }` | `ParameterTypeId.RvtLinkInstanceProjectInformation` | ForgeTypeId |
| `ForgeTypeId RvtLinkPhaseMap { get; }` | `ParameterTypeId.RvtLinkPhaseMap` | ForgeTypeId |
| `ForgeTypeId RvtLinkReferenceType { get; }` | `ParameterTypeId.RvtLinkReferenceType` | ForgeTypeId |
| `ForgeTypeId RvtSourceLevel { get; }` | `ParameterTypeId.RvtSourceLevel` | ForgeTypeId |
| `ForgeTypeId ScaleFactorParam { get; }` | `ParameterTypeId.ScaleFactorParam` | ForgeTypeId |
| `ForgeTypeId ScheduleBaseLevelOffsetParam { get; }` | `ParameterTypeId.ScheduleBaseLevelOffsetParam` | ForgeTypeId |
| `ForgeTypeId ScheduleBaseLevelParam { get; }` | `ParameterTypeId.ScheduleBaseLevelParam` | ForgeTypeId |
| `ForgeTypeId ScheduleCategory { get; }` | `ParameterTypeId.ScheduleCategory` | ForgeTypeId |
| `ForgeTypeId ScheduleEmbeddedParam { get; }` | `ParameterTypeId.ScheduleEmbeddedParam` | ForgeTypeId |
| `ForgeTypeId ScheduleFieldsParam { get; }` | `ParameterTypeId.ScheduleFieldsParam` | ForgeTypeId |
| `ForgeTypeId ScheduleFilterParam { get; }` | `ParameterTypeId.ScheduleFilterParam` | ForgeTypeId |
| `ForgeTypeId ScheduleFormatParam { get; }` | `ParameterTypeId.ScheduleFormatParam` | ForgeTypeId |
| `ForgeTypeId ScheduleGroupParam { get; }` | `ParameterTypeId.ScheduleGroupParam` | ForgeTypeId |
| `ForgeTypeId ScheduleLevelParam { get; }` | `ParameterTypeId.ScheduleLevelParam` | ForgeTypeId |
| `ForgeTypeId ScheduleResizeRows { get; }` | `ParameterTypeId.ScheduleResizeRows` | ForgeTypeId |
| `ForgeTypeId ScheduleRotationOnSheet { get; }` | `ParameterTypeId.ScheduleRotationOnSheet` | ForgeTypeId |
| `ForgeTypeId ScheduleRowHeightInput { get; }` | `ParameterTypeId.ScheduleRowHeightInput` | ForgeTypeId |
| `ForgeTypeId ScheduleSheetAppearanceParam { get; }` | `ParameterTypeId.ScheduleSheetAppearanceParam` | ForgeTypeId |
| `ForgeTypeId ScheduleTopLevelOffsetParam { get; }` | `ParameterTypeId.ScheduleTopLevelOffsetParam` | ForgeTypeId |
| `ForgeTypeId ScheduleTopLevelParam { get; }` | `ParameterTypeId.ScheduleTopLevelParam` | ForgeTypeId |
| `ForgeTypeId ScheduleTypeForBrowser { get; }` | `ParameterTypeId.ScheduleTypeForBrowser` | ForgeTypeId |
| `ForgeTypeId SectionAttrHeadTag { get; }` | `ParameterTypeId.SectionAttrHeadTag` | ForgeTypeId |
| `ForgeTypeId SectionAttrTailLength { get; }` | `ParameterTypeId.SectionAttrTailLength` | ForgeTypeId |
| `ForgeTypeId SectionAttrTailTag { get; }` | `ParameterTypeId.SectionAttrTailTag` | ForgeTypeId |
| `ForgeTypeId SectionAttrTailWidth { get; }` | `ParameterTypeId.SectionAttrTailWidth` | ForgeTypeId |
| `ForgeTypeId SectionBrokenDisplayStyle { get; }` | `ParameterTypeId.SectionBrokenDisplayStyle` | ForgeTypeId |
| `ForgeTypeId SectionCoarserScalePulldownImperial { get; }` | `ParameterTypeId.SectionCoarserScalePulldownImperial` | ForgeTypeId |
| `ForgeTypeId SectionCoarserScalePulldownMetric { get; }` | `ParameterTypeId.SectionCoarserScalePulldownMetric` | ForgeTypeId |
| `ForgeTypeId SectionParentViewName { get; }` | `ParameterTypeId.SectionParentViewName` | ForgeTypeId |
| `ForgeTypeId SectionShowInOneViewOnly { get; }` | `ParameterTypeId.SectionShowInOneViewOnly` | ForgeTypeId |
| `ForgeTypeId SectionTag { get; }` | `ParameterTypeId.SectionTag` | ForgeTypeId |
| `ForgeTypeId SeekItemId { get; }` | `ParameterTypeId.SeekItemId` | ForgeTypeId |
| `ForgeTypeId SelectionEditableOnly { get; }` | `ParameterTypeId.SelectionEditableOnly` | ForgeTypeId |
| `ForgeTypeId SheetApprovedBy { get; }` | `ParameterTypeId.SheetApprovedBy` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyAssemblyCode { get; }` | `ParameterTypeId.SheetAssemblyAssemblyCode` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyAssemblyDescription { get; }` | `ParameterTypeId.SheetAssemblyAssemblyDescription` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyCost { get; }` | `ParameterTypeId.SheetAssemblyCost` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyDescription { get; }` | `ParameterTypeId.SheetAssemblyDescription` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyKeynote { get; }` | `ParameterTypeId.SheetAssemblyKeynote` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyManufacturer { get; }` | `ParameterTypeId.SheetAssemblyManufacturer` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyModel { get; }` | `ParameterTypeId.SheetAssemblyModel` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyName { get; }` | `ParameterTypeId.SheetAssemblyName` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyTypeComments { get; }` | `ParameterTypeId.SheetAssemblyTypeComments` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyTypeMark { get; }` | `ParameterTypeId.SheetAssemblyTypeMark` | ForgeTypeId |
| `ForgeTypeId SheetAssemblyUrl { get; }` | `ParameterTypeId.SheetAssemblyUrl` | ForgeTypeId |
| `ForgeTypeId SheetCheckedBy { get; }` | `ParameterTypeId.SheetCheckedBy` | ForgeTypeId |
| `ForgeTypeId SheetCollection { get; }` | `ParameterTypeId.SheetCollection` | ForgeTypeId |
| `ForgeTypeId SheetCollectionName { get; }` | `ParameterTypeId.SheetCollectionName` | ForgeTypeId |
| `ForgeTypeId SheetCurrentRevision { get; }` | `ParameterTypeId.SheetCurrentRevision` | ForgeTypeId |
| `ForgeTypeId SheetCurrentRevisionDate { get; }` | `ParameterTypeId.SheetCurrentRevisionDate` | ForgeTypeId |
| `ForgeTypeId SheetCurrentRevisionDescription { get; }` | `ParameterTypeId.SheetCurrentRevisionDescription` | ForgeTypeId |
| `ForgeTypeId SheetCurrentRevisionIssued { get; }` | `ParameterTypeId.SheetCurrentRevisionIssued` | ForgeTypeId |
| `ForgeTypeId SheetCurrentRevisionIssuedBy { get; }` | `ParameterTypeId.SheetCurrentRevisionIssuedBy` | ForgeTypeId |
| `ForgeTypeId SheetCurrentRevisionIssuedTo { get; }` | `ParameterTypeId.SheetCurrentRevisionIssuedTo` | ForgeTypeId |
| `ForgeTypeId SheetDate { get; }` | `ParameterTypeId.SheetDate` | ForgeTypeId |
| `ForgeTypeId SheetDesignedBy { get; }` | `ParameterTypeId.SheetDesignedBy` | ForgeTypeId |
| `ForgeTypeId SheetDrawnBy { get; }` | `ParameterTypeId.SheetDrawnBy` | ForgeTypeId |
| `ForgeTypeId SheetFilePath { get; }` | `ParameterTypeId.SheetFilePath` | ForgeTypeId |
| `ForgeTypeId SheetGuideGrid { get; }` | `ParameterTypeId.SheetGuideGrid` | ForgeTypeId |
| `ForgeTypeId SheetHeight { get; }` | `ParameterTypeId.SheetHeight` | ForgeTypeId |
| `ForgeTypeId SheetIssueDate { get; }` | `ParameterTypeId.SheetIssueDate` | ForgeTypeId |
| `ForgeTypeId SheetKeyNumber { get; }` | `ParameterTypeId.SheetKeyNumber` | ForgeTypeId |
| `ForgeTypeId SheetName { get; }` | `ParameterTypeId.SheetName` | ForgeTypeId |
| `ForgeTypeId SheetNumber { get; }` | `ParameterTypeId.SheetNumber` | ForgeTypeId |
| `ForgeTypeId SheetRevisionsOnSheet { get; }` | `ParameterTypeId.SheetRevisionsOnSheet` | ForgeTypeId |
| `ForgeTypeId SheetScale { get; }` | `ParameterTypeId.SheetScale` | ForgeTypeId |
| `ForgeTypeId SheetScheduled { get; }` | `ParameterTypeId.SheetScheduled` | ForgeTypeId |
| `ForgeTypeId SheetWidth { get; }` | `ParameterTypeId.SheetWidth` | ForgeTypeId |
| `ForgeTypeId ShowArrowheadToCutMark { get; }` | `ParameterTypeId.ShowArrowheadToCutMark` | ForgeTypeId |
| `ForgeTypeId ShowIconParam { get; }` | `ParameterTypeId.ShowIconParam` | ForgeTypeId |
| `ForgeTypeId ShowTitle { get; }` | `ParameterTypeId.ShowTitle` | ForgeTypeId |
| `ForgeTypeId SketchGridSpacingParam { get; }` | `ParameterTypeId.SketchGridSpacingParam` | ForgeTypeId |
| `ForgeTypeId SketchPlaneParam { get; }` | `ParameterTypeId.SketchPlaneParam` | ForgeTypeId |
| `ForgeTypeId SlabEdgeMaterialParam { get; }` | `ParameterTypeId.SlabEdgeMaterialParam` | ForgeTypeId |
| `ForgeTypeId SlabEdgeProfileParam { get; }` | `ParameterTypeId.SlabEdgeProfileParam` | ForgeTypeId |
| `ForgeTypeId SlantedColumnBaseCutStyle { get; }` | `ParameterTypeId.SlantedColumnBaseCutStyle` | ForgeTypeId |
| `ForgeTypeId SlantedColumnBaseExtension { get; }` | `ParameterTypeId.SlantedColumnBaseExtension` | ForgeTypeId |
| `ForgeTypeId SlantedColumnGeometryTreatmentBase { get; }` | `ParameterTypeId.SlantedColumnGeometryTreatmentBase` | ForgeTypeId |
| `ForgeTypeId SlantedColumnGeometryTreatmentTop { get; }` | `ParameterTypeId.SlantedColumnGeometryTreatmentTop` | ForgeTypeId |
| `ForgeTypeId SlantedColumnTopCutStyle { get; }` | `ParameterTypeId.SlantedColumnTopCutStyle` | ForgeTypeId |
| `ForgeTypeId SlantedColumnTopExtension { get; }` | `ParameterTypeId.SlantedColumnTopExtension` | ForgeTypeId |
| `ForgeTypeId SlantedColumnTypeParam { get; }` | `ParameterTypeId.SlantedColumnTypeParam` | ForgeTypeId |
| `ForgeTypeId SlopeArrowLevelEnd { get; }` | `ParameterTypeId.SlopeArrowLevelEnd` | ForgeTypeId |
| `ForgeTypeId SlopeArrowLevelStart { get; }` | `ParameterTypeId.SlopeArrowLevelStart` | ForgeTypeId |
| `ForgeTypeId SlopeEndHeight { get; }` | `ParameterTypeId.SlopeEndHeight` | ForgeTypeId |
| `ForgeTypeId SlopeStartHeight { get; }` | `ParameterTypeId.SlopeStartHeight` | ForgeTypeId |
| `ForgeTypeId SpaceAirChangesPerHour { get; }` | `ParameterTypeId.SpaceAirChangesPerHour` | ForgeTypeId |
| `ForgeTypeId SpaceAirflowPerAreaParam { get; }` | `ParameterTypeId.SpaceAirflowPerAreaParam` | ForgeTypeId |
| `ForgeTypeId SpaceArea { get; }` | `ParameterTypeId.SpaceArea` | ForgeTypeId |
| `ForgeTypeId SpaceAreaPerPersonParam { get; }` | `ParameterTypeId.SpaceAreaPerPersonParam` | ForgeTypeId |
| `ForgeTypeId SpaceAssocRoomName { get; }` | `ParameterTypeId.SpaceAssocRoomName` | ForgeTypeId |
| `ForgeTypeId SpaceAssocRoomNumber { get; }` | `ParameterTypeId.SpaceAssocRoomNumber` | ForgeTypeId |
| `ForgeTypeId SpaceCarpetingParam { get; }` | `ParameterTypeId.SpaceCarpetingParam` | ForgeTypeId |
| `ForgeTypeId SpaceComposednameParam { get; }` | `ParameterTypeId.SpaceComposednameParam` | ForgeTypeId |
| `ForgeTypeId SpaceConditionType { get; }` | `ParameterTypeId.SpaceConditionType` | ForgeTypeId |
| `ForgeTypeId SpaceCoolingSetPoint { get; }` | `ParameterTypeId.SpaceCoolingSetPoint` | ForgeTypeId |
| `ForgeTypeId SpaceDehumidificationSetPoint { get; }` | `ParameterTypeId.SpaceDehumidificationSetPoint` | ForgeTypeId |
| `ForgeTypeId SpaceElecEquipmentRadiantPercentageParam { get; }` | `ParameterTypeId.SpaceElecEquipmentRadiantPercentageParam` | ForgeTypeId |
| `ForgeTypeId SpaceHeatingSetPoint { get; }` | `ParameterTypeId.SpaceHeatingSetPoint` | ForgeTypeId |
| `ForgeTypeId SpaceHumidificationSetPoint { get; }` | `ParameterTypeId.SpaceHumidificationSetPoint` | ForgeTypeId |
| `ForgeTypeId SpaceInfiltrationAirflow { get; }` | `ParameterTypeId.SpaceInfiltrationAirflow` | ForgeTypeId |
| `ForgeTypeId SpaceInfiltrationAirflowPerArea { get; }` | `ParameterTypeId.SpaceInfiltrationAirflowPerArea` | ForgeTypeId |
| `ForgeTypeId SpaceInfiltrationParam { get; }` | `ParameterTypeId.SpaceInfiltrationParam` | ForgeTypeId |
| `ForgeTypeId SpaceIsOccupiable { get; }` | `ParameterTypeId.SpaceIsOccupiable` | ForgeTypeId |
| `ForgeTypeId SpaceIsPlenum { get; }` | `ParameterTypeId.SpaceIsPlenum` | ForgeTypeId |
| `ForgeTypeId SpaceLightingLoadParam { get; }` | `ParameterTypeId.SpaceLightingLoadParam` | ForgeTypeId |
| `ForgeTypeId SpaceLightingLoadPerAreaParam { get; }` | `ParameterTypeId.SpaceLightingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId SpaceLightingScheduleParam { get; }` | `ParameterTypeId.SpaceLightingScheduleParam` | ForgeTypeId |
| `ForgeTypeId SpaceNameParam { get; }` | `ParameterTypeId.SpaceNameParam` | ForgeTypeId |
| `ForgeTypeId SpaceNumberOfPeople { get; }` | `ParameterTypeId.SpaceNumberOfPeople` | ForgeTypeId |
| `ForgeTypeId SpaceNumberParam { get; }` | `ParameterTypeId.SpaceNumberParam` | ForgeTypeId |
| `ForgeTypeId SpaceOccupancyScheduleParam { get; }` | `ParameterTypeId.SpaceOccupancyScheduleParam` | ForgeTypeId |
| `ForgeTypeId SpaceOutdoorAirflow { get; }` | `ParameterTypeId.SpaceOutdoorAirflow` | ForgeTypeId |
| `ForgeTypeId SpaceOutdoorAirflowPerArea { get; }` | `ParameterTypeId.SpaceOutdoorAirflowPerArea` | ForgeTypeId |
| `ForgeTypeId SpaceOutdoorAirflowPerPerson { get; }` | `ParameterTypeId.SpaceOutdoorAirflowPerPerson` | ForgeTypeId |
| `ForgeTypeId SpacePeopleActivityLevelParam { get; }` | `ParameterTypeId.SpacePeopleActivityLevelParam` | ForgeTypeId |
| `ForgeTypeId SpacePeopleLatentHeatGainPerPersonParam { get; }` | `ParameterTypeId.SpacePeopleLatentHeatGainPerPersonParam` | ForgeTypeId |
| `ForgeTypeId SpacePeopleLoadParam { get; }` | `ParameterTypeId.SpacePeopleLoadParam` | ForgeTypeId |
| `ForgeTypeId SpacePeopleSensibleHeatGainPerPersonParam { get; }` | `ParameterTypeId.SpacePeopleSensibleHeatGainPerPersonParam` | ForgeTypeId |
| `ForgeTypeId SpacePowerLoadParam { get; }` | `ParameterTypeId.SpacePowerLoadParam` | ForgeTypeId |
| `ForgeTypeId SpacePowerLoadPerAreaParam { get; }` | `ParameterTypeId.SpacePowerLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId SpacePowerScheduleParam { get; }` | `ParameterTypeId.SpacePowerScheduleParam` | ForgeTypeId |
| `ForgeTypeId SpaceReferenceLevelParam { get; }` | `ParameterTypeId.SpaceReferenceLevelParam` | ForgeTypeId |
| `ForgeTypeId SpaceTypeGbxml { get; }` | `ParameterTypeId.SpaceTypeGbxml` | ForgeTypeId |
| `ForgeTypeId SpaceVolume { get; }` | `ParameterTypeId.SpaceVolume` | ForgeTypeId |
| `ForgeTypeId SpaceZoneName { get; }` | `ParameterTypeId.SpaceZoneName` | ForgeTypeId |
| `ForgeTypeId SpacingAppend { get; }` | `ParameterTypeId.SpacingAppend` | ForgeTypeId |
| `ForgeTypeId SpacingJustification { get; }` | `ParameterTypeId.SpacingJustification` | ForgeTypeId |
| `ForgeTypeId SpacingJustificationHoriz { get; }` | `ParameterTypeId.SpacingJustificationHoriz` | ForgeTypeId |
| `ForgeTypeId SpacingJustificationn1 { get; }` | `ParameterTypeId.SpacingJustificationn1` | ForgeTypeId |
| `ForgeTypeId SpacingJustificationn2 { get; }` | `ParameterTypeId.SpacingJustificationn2` | ForgeTypeId |
| `ForgeTypeId SpacingJustificationU { get; }` | `ParameterTypeId.SpacingJustificationU` | ForgeTypeId |
| `ForgeTypeId SpacingJustificationV { get; }` | `ParameterTypeId.SpacingJustificationV` | ForgeTypeId |
| `ForgeTypeId SpacingJustificationVert { get; }` | `ParameterTypeId.SpacingJustificationVert` | ForgeTypeId |
| `ForgeTypeId SpacingLayout { get; }` | `ParameterTypeId.SpacingLayout` | ForgeTypeId |
| `ForgeTypeId SpacingLayoutHoriz { get; }` | `ParameterTypeId.SpacingLayoutHoriz` | ForgeTypeId |
| `ForgeTypeId SpacingLayoutn1 { get; }` | `ParameterTypeId.SpacingLayoutn1` | ForgeTypeId |
| `ForgeTypeId SpacingLayoutn2 { get; }` | `ParameterTypeId.SpacingLayoutn2` | ForgeTypeId |
| `ForgeTypeId SpacingLayoutU { get; }` | `ParameterTypeId.SpacingLayoutU` | ForgeTypeId |
| `ForgeTypeId SpacingLayoutV { get; }` | `ParameterTypeId.SpacingLayoutV` | ForgeTypeId |
| `ForgeTypeId SpacingLayoutVert { get; }` | `ParameterTypeId.SpacingLayoutVert` | ForgeTypeId |
| `ForgeTypeId SpacingLength { get; }` | `ParameterTypeId.SpacingLength` | ForgeTypeId |
| `ForgeTypeId SpacingLengthHoriz { get; }` | `ParameterTypeId.SpacingLengthHoriz` | ForgeTypeId |
| `ForgeTypeId SpacingLengthn1 { get; }` | `ParameterTypeId.SpacingLengthn1` | ForgeTypeId |
| `ForgeTypeId SpacingLengthn2 { get; }` | `ParameterTypeId.SpacingLengthn2` | ForgeTypeId |
| `ForgeTypeId SpacingLengthU { get; }` | `ParameterTypeId.SpacingLengthU` | ForgeTypeId |
| `ForgeTypeId SpacingLengthV { get; }` | `ParameterTypeId.SpacingLengthV` | ForgeTypeId |
| `ForgeTypeId SpacingLengthVert { get; }` | `ParameterTypeId.SpacingLengthVert` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisions { get; }` | `ParameterTypeId.SpacingNumDivisions` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisionsHoriz { get; }` | `ParameterTypeId.SpacingNumDivisionsHoriz` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisionsn1 { get; }` | `ParameterTypeId.SpacingNumDivisionsn1` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisionsn2 { get; }` | `ParameterTypeId.SpacingNumDivisionsn2` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisionsU { get; }` | `ParameterTypeId.SpacingNumDivisionsU` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisionsV { get; }` | `ParameterTypeId.SpacingNumDivisionsV` | ForgeTypeId |
| `ForgeTypeId SpacingNumDivisionsVert { get; }` | `ParameterTypeId.SpacingNumDivisionsVert` | ForgeTypeId |
| `ForgeTypeId SpanDirInstParamAngle { get; }` | `ParameterTypeId.SpanDirInstParamAngle` | ForgeTypeId |
| `ForgeTypeId SpanDirSymParamBottom { get; }` | `ParameterTypeId.SpanDirSymParamBottom` | ForgeTypeId |
| `ForgeTypeId SpanDirSymParamLeft { get; }` | `ParameterTypeId.SpanDirSymParamLeft` | ForgeTypeId |
| `ForgeTypeId SpanDirSymParamRight { get; }` | `ParameterTypeId.SpanDirSymParamRight` | ForgeTypeId |
| `ForgeTypeId SpanDirSymParamTop { get; }` | `ParameterTypeId.SpanDirSymParamTop` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrCurrentName { get; }` | `ParameterTypeId.SpatialFieldMgrCurrentName` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrDescription { get; }` | `ParameterTypeId.SpatialFieldMgrDescription` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendHeight { get; }` | `ParameterTypeId.SpatialFieldMgrLegendHeight` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendHorOriginGap { get; }` | `ParameterTypeId.SpatialFieldMgrLegendHorOriginGap` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendShowConfigName { get; }` | `ParameterTypeId.SpatialFieldMgrLegendShowConfigName` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendShowDescription { get; }` | `ParameterTypeId.SpatialFieldMgrLegendShowDescription` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendTextType { get; }` | `ParameterTypeId.SpatialFieldMgrLegendTextType` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendVertOriginGap { get; }` | `ParameterTypeId.SpatialFieldMgrLegendVertOriginGap` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrLegendWidth { get; }` | `ParameterTypeId.SpatialFieldMgrLegendWidth` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrRange { get; }` | `ParameterTypeId.SpatialFieldMgrRange` | ForgeTypeId |
| `ForgeTypeId SpatialFieldMgrResultsVisibility { get; }` | `ParameterTypeId.SpatialFieldMgrResultsVisibility` | ForgeTypeId |
| `ForgeTypeId SpecifySlopeOrOffset { get; }` | `ParameterTypeId.SpecifySlopeOrOffset` | ForgeTypeId |
| `ForgeTypeId SpliceByRulesMaxLength { get; }` | `ParameterTypeId.SpliceByRulesMaxLength` | ForgeTypeId |
| `ForgeTypeId SpliceByRulesMinLength { get; }` | `ParameterTypeId.SpliceByRulesMinLength` | ForgeTypeId |
| `ForgeTypeId SpliceByRulesRunout { get; }` | `ParameterTypeId.SpliceByRulesRunout` | ForgeTypeId |
| `ForgeTypeId SpliceLapLengthAtEnd { get; }` | `ParameterTypeId.SpliceLapLengthAtEnd` | ForgeTypeId |
| `ForgeTypeId SpliceLapLengthAtStart { get; }` | `ParameterTypeId.SpliceLapLengthAtStart` | ForgeTypeId |
| `ForgeTypeId SpliceTypeAtEnd { get; }` | `ParameterTypeId.SpliceTypeAtEnd` | ForgeTypeId |
| `ForgeTypeId SpliceTypeAtStart { get; }` | `ParameterTypeId.SpliceTypeAtStart` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateBase { get; }` | `ParameterTypeId.SpotCoordinateBase` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateBottomPrefix { get; }` | `ParameterTypeId.SpotCoordinateBottomPrefix` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateBottomSuffix { get; }` | `ParameterTypeId.SpotCoordinateBottomSuffix` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateElevationPrefix { get; }` | `ParameterTypeId.SpotCoordinateElevationPrefix` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateElevationSuffix { get; }` | `ParameterTypeId.SpotCoordinateElevationSuffix` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateIncludeElevation { get; }` | `ParameterTypeId.SpotCoordinateIncludeElevation` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateTopPrefix { get; }` | `ParameterTypeId.SpotCoordinateTopPrefix` | ForgeTypeId |
| `ForgeTypeId SpotCoordinateTopSuffix { get; }` | `ParameterTypeId.SpotCoordinateTopSuffix` | ForgeTypeId |
| `ForgeTypeId SpotDimLeader { get; }` | `ParameterTypeId.SpotDimLeader` | ForgeTypeId |
| `ForgeTypeId SpotDimLeaderLine { get; }` | `ParameterTypeId.SpotDimLeaderLine` | ForgeTypeId |
| `ForgeTypeId SpotDimStyleSlopeUnits { get; }` | `ParameterTypeId.SpotDimStyleSlopeUnits` | ForgeTypeId |
| `ForgeTypeId SpotDimStyleSlopeUnitsAlt { get; }` | `ParameterTypeId.SpotDimStyleSlopeUnitsAlt` | ForgeTypeId |
| `ForgeTypeId SpotElevBase { get; }` | `ParameterTypeId.SpotElevBase` | ForgeTypeId |
| `ForgeTypeId SpotElevBendLeader { get; }` | `ParameterTypeId.SpotElevBendLeader` | ForgeTypeId |
| `ForgeTypeId SpotElevBotValue { get; }` | `ParameterTypeId.SpotElevBotValue` | ForgeTypeId |
| `ForgeTypeId SpotElevDisplayElevations { get; }` | `ParameterTypeId.SpotElevDisplayElevations` | ForgeTypeId |
| `ForgeTypeId SpotElevFlipTextVert { get; }` | `ParameterTypeId.SpotElevFlipTextVert` | ForgeTypeId |
| `ForgeTypeId SpotElevIndBottom { get; }` | `ParameterTypeId.SpotElevIndBottom` | ForgeTypeId |
| `ForgeTypeId SpotElevIndElevation { get; }` | `ParameterTypeId.SpotElevIndElevation` | ForgeTypeId |
| `ForgeTypeId SpotElevIndEw { get; }` | `ParameterTypeId.SpotElevIndEw` | ForgeTypeId |
| `ForgeTypeId SpotElevIndNs { get; }` | `ParameterTypeId.SpotElevIndNs` | ForgeTypeId |
| `ForgeTypeId SpotElevIndTop { get; }` | `ParameterTypeId.SpotElevIndTop` | ForgeTypeId |
| `ForgeTypeId SpotElevIndType { get; }` | `ParameterTypeId.SpotElevIndType` | ForgeTypeId |
| `ForgeTypeId SpotElevIndTypeBottom { get; }` | `ParameterTypeId.SpotElevIndTypeBottom` | ForgeTypeId |
| `ForgeTypeId SpotElevIndTypeElevation { get; }` | `ParameterTypeId.SpotElevIndTypeElevation` | ForgeTypeId |
| `ForgeTypeId SpotElevIndTypeTop { get; }` | `ParameterTypeId.SpotElevIndTypeTop` | ForgeTypeId |
| `ForgeTypeId SpotElevLeaderArrowhead { get; }` | `ParameterTypeId.SpotElevLeaderArrowhead` | ForgeTypeId |
| `ForgeTypeId SpotElevLinePen { get; }` | `ParameterTypeId.SpotElevLinePen` | ForgeTypeId |
| `ForgeTypeId SpotElevLowerPrefix { get; }` | `ParameterTypeId.SpotElevLowerPrefix` | ForgeTypeId |
| `ForgeTypeId SpotElevLowerSuffix { get; }` | `ParameterTypeId.SpotElevLowerSuffix` | ForgeTypeId |
| `ForgeTypeId SpotElevLowerValue { get; }` | `ParameterTypeId.SpotElevLowerValue` | ForgeTypeId |
| `ForgeTypeId SpotElevRelativeBase { get; }` | `ParameterTypeId.SpotElevRelativeBase` | ForgeTypeId |
| `ForgeTypeId SpotElevRotateWithComponent { get; }` | `ParameterTypeId.SpotElevRotateWithComponent` | ForgeTypeId |
| `ForgeTypeId SpotElevSingleOrUpperPrefix { get; }` | `ParameterTypeId.SpotElevSingleOrUpperPrefix` | ForgeTypeId |
| `ForgeTypeId SpotElevSingleOrUpperSuffix { get; }` | `ParameterTypeId.SpotElevSingleOrUpperSuffix` | ForgeTypeId |
| `ForgeTypeId SpotElevSingleOrUpperValue { get; }` | `ParameterTypeId.SpotElevSingleOrUpperValue` | ForgeTypeId |
| `ForgeTypeId SpotElevSymbol { get; }` | `ParameterTypeId.SpotElevSymbol` | ForgeTypeId |
| `ForgeTypeId SpotElevTextHorizOffset { get; }` | `ParameterTypeId.SpotElevTextHorizOffset` | ForgeTypeId |
| `ForgeTypeId SpotElevTextLocation { get; }` | `ParameterTypeId.SpotElevTextLocation` | ForgeTypeId |
| `ForgeTypeId SpotElevTextOrientation { get; }` | `ParameterTypeId.SpotElevTextOrientation` | ForgeTypeId |
| `ForgeTypeId SpotElevTickMarkPen { get; }` | `ParameterTypeId.SpotElevTickMarkPen` | ForgeTypeId |
| `ForgeTypeId SpotElevTopValue { get; }` | `ParameterTypeId.SpotElevTopValue` | ForgeTypeId |
| `ForgeTypeId SpotSlopeLeaderLength { get; }` | `ParameterTypeId.SpotSlopeLeaderLength` | ForgeTypeId |
| `ForgeTypeId SpotSlopeOffsetFromReference { get; }` | `ParameterTypeId.SpotSlopeOffsetFromReference` | ForgeTypeId |
| `ForgeTypeId SpotSlopePrefix { get; }` | `ParameterTypeId.SpotSlopePrefix` | ForgeTypeId |
| `ForgeTypeId SpotSlopeSlopeDirection { get; }` | `ParameterTypeId.SpotSlopeSlopeDirection` | ForgeTypeId |
| `ForgeTypeId SpotSlopeSlopeRepresentation { get; }` | `ParameterTypeId.SpotSlopeSlopeRepresentation` | ForgeTypeId |
| `ForgeTypeId SpotSlopeSuffix { get; }` | `ParameterTypeId.SpotSlopeSuffix` | ForgeTypeId |
| `ForgeTypeId SpotTextFromLeader { get; }` | `ParameterTypeId.SpotTextFromLeader` | ForgeTypeId |
| `ForgeTypeId SsePointBasetypeEnum { get; }` | `ParameterTypeId.SsePointBasetypeEnum` | ForgeTypeId |
| `ForgeTypeId SsePointElevation { get; }` | `ParameterTypeId.SsePointElevation` | ForgeTypeId |
| `ForgeTypeId SsePointElevationBaseType { get; }` | `ParameterTypeId.SsePointElevationBaseType` | ForgeTypeId |
| `ForgeTypeId SsePointOffsetFromSnaps { get; }` | `ParameterTypeId.SsePointOffsetFromSnaps` | ForgeTypeId |
| `ForgeTypeId SsePointOffsetFromSurface { get; }` | `ParameterTypeId.SsePointOffsetFromSurface` | ForgeTypeId |
| `ForgeTypeId StairsActualNumberOfRisers { get; }` | `ParameterTypeId.StairsActualNumberOfRisers` | ForgeTypeId |
| `ForgeTypeId StairsActualNumRisers { get; }` | `ParameterTypeId.StairsActualNumRisers` | ForgeTypeId |
| `ForgeTypeId StairsActualRiserHeight { get; }` | `ParameterTypeId.StairsActualRiserHeight` | ForgeTypeId |
| `ForgeTypeId StairsActualTreadDepth { get; }` | `ParameterTypeId.StairsActualTreadDepth` | ForgeTypeId |
| `ForgeTypeId StairsAttrBodyMaterial { get; }` | `ParameterTypeId.StairsAttrBodyMaterial` | ForgeTypeId |
| `ForgeTypeId StairsAttrBreakSymInCutline { get; }` | `ParameterTypeId.StairsAttrBreakSymInCutline` | ForgeTypeId |
| `ForgeTypeId StairsAttrCalcEnabled { get; }` | `ParameterTypeId.StairsAttrCalcEnabled` | ForgeTypeId |
| `ForgeTypeId StairsAttrCalcMax { get; }` | `ParameterTypeId.StairsAttrCalcMax` | ForgeTypeId |
| `ForgeTypeId StairsAttrCalcMin { get; }` | `ParameterTypeId.StairsAttrCalcMin` | ForgeTypeId |
| `ForgeTypeId StairsAttrEqResult { get; }` | `ParameterTypeId.StairsAttrEqResult` | ForgeTypeId |
| `ForgeTypeId StairsAttrFirstRiser { get; }` | `ParameterTypeId.StairsAttrFirstRiser` | ForgeTypeId |
| `ForgeTypeId StairsAttrLandingCarriage { get; }` | `ParameterTypeId.StairsAttrLandingCarriage` | ForgeTypeId |
| `ForgeTypeId StairsAttrLandingsOverlapping { get; }` | `ParameterTypeId.StairsAttrLandingsOverlapping` | ForgeTypeId |
| `ForgeTypeId StairsAttrLastRiser { get; }` | `ParameterTypeId.StairsAttrLastRiser` | ForgeTypeId |
| `ForgeTypeId StairsAttrLeftSideStringer { get; }` | `ParameterTypeId.StairsAttrLeftSideStringer` | ForgeTypeId |
| `ForgeTypeId StairsAttrMaxRiserHeight { get; }` | `ParameterTypeId.StairsAttrMaxRiserHeight` | ForgeTypeId |
| `ForgeTypeId StairsAttrMinimumTreadDepth { get; }` | `ParameterTypeId.StairsAttrMinimumTreadDepth` | ForgeTypeId |
| `ForgeTypeId StairsAttrMonolithicStairs { get; }` | `ParameterTypeId.StairsAttrMonolithicStairs` | ForgeTypeId |
| `ForgeTypeId StairsAttrNosingLength { get; }` | `ParameterTypeId.StairsAttrNosingLength` | ForgeTypeId |
| `ForgeTypeId StairsAttrNosingPlacement { get; }` | `ParameterTypeId.StairsAttrNosingPlacement` | ForgeTypeId |
| `ForgeTypeId StairsAttrNumMidStringers { get; }` | `ParameterTypeId.StairsAttrNumMidStringers` | ForgeTypeId |
| `ForgeTypeId StairsAttrRightSideStringer { get; }` | `ParameterTypeId.StairsAttrRightSideStringer` | ForgeTypeId |
| `ForgeTypeId StairsAttrRiserAngle { get; }` | `ParameterTypeId.StairsAttrRiserAngle` | ForgeTypeId |
| `ForgeTypeId StairsAttrRiserMaterial { get; }` | `ParameterTypeId.StairsAttrRiserMaterial` | ForgeTypeId |
| `ForgeTypeId StairsAttrRiserMult { get; }` | `ParameterTypeId.StairsAttrRiserMult` | ForgeTypeId |
| `ForgeTypeId StairsAttrRisersPresent { get; }` | `ParameterTypeId.StairsAttrRisersPresent` | ForgeTypeId |
| `ForgeTypeId StairsAttrRiserThickness { get; }` | `ParameterTypeId.StairsAttrRiserThickness` | ForgeTypeId |
| `ForgeTypeId StairsAttrRiserTreadConnect { get; }` | `ParameterTypeId.StairsAttrRiserTreadConnect` | ForgeTypeId |
| `ForgeTypeId StairsAttrRiserType { get; }` | `ParameterTypeId.StairsAttrRiserType` | ForgeTypeId |
| `ForgeTypeId StairsAttrSideStringerTypeParam { get; }` | `ParameterTypeId.StairsAttrSideStringerTypeParam` | ForgeTypeId |
| `ForgeTypeId StairsAttrStairCalculator { get; }` | `ParameterTypeId.StairsAttrStairCalculator` | ForgeTypeId |
| `ForgeTypeId StairsAttrStairsBottom { get; }` | `ParameterTypeId.StairsAttrStairsBottom` | ForgeTypeId |
| `ForgeTypeId StairsAttrStairsCutOffset { get; }` | `ParameterTypeId.StairsAttrStairsCutOffset` | ForgeTypeId |
| `ForgeTypeId StairsAttrStringerCarriage { get; }` | `ParameterTypeId.StairsAttrStringerCarriage` | ForgeTypeId |
| `ForgeTypeId StairsAttrStringerHeight { get; }` | `ParameterTypeId.StairsAttrStringerHeight` | ForgeTypeId |
| `ForgeTypeId StairsAttrStringerMaterial { get; }` | `ParameterTypeId.StairsAttrStringerMaterial` | ForgeTypeId |
| `ForgeTypeId StairsAttrStringerOffset { get; }` | `ParameterTypeId.StairsAttrStringerOffset` | ForgeTypeId |
| `ForgeTypeId StairsAttrStringerThickness { get; }` | `ParameterTypeId.StairsAttrStringerThickness` | ForgeTypeId |
| `ForgeTypeId StairsAttrTextFont { get; }` | `ParameterTypeId.StairsAttrTextFont` | ForgeTypeId |
| `ForgeTypeId StairsAttrTextSize { get; }` | `ParameterTypeId.StairsAttrTextSize` | ForgeTypeId |
| `ForgeTypeId StairsAttrTreadFrontProfile { get; }` | `ParameterTypeId.StairsAttrTreadFrontProfile` | ForgeTypeId |
| `ForgeTypeId StairsAttrTreadMaterial { get; }` | `ParameterTypeId.StairsAttrTreadMaterial` | ForgeTypeId |
| `ForgeTypeId StairsAttrTreadMult { get; }` | `ParameterTypeId.StairsAttrTreadMult` | ForgeTypeId |
| `ForgeTypeId StairsAttrTreadThickness { get; }` | `ParameterTypeId.StairsAttrTreadThickness` | ForgeTypeId |
| `ForgeTypeId StairsAttrTreadWidth { get; }` | `ParameterTypeId.StairsAttrTreadWidth` | ForgeTypeId |
| `ForgeTypeId StairsAttrTrimTop { get; }` | `ParameterTypeId.StairsAttrTrimTop` | ForgeTypeId |
| `ForgeTypeId StairsBaseLevel { get; }` | `ParameterTypeId.StairsBaseLevel` | ForgeTypeId |
| `ForgeTypeId StairsBaseLevelParam { get; }` | `ParameterTypeId.StairsBaseLevelParam` | ForgeTypeId |
| `ForgeTypeId StairsBaseOffset { get; }` | `ParameterTypeId.StairsBaseOffset` | ForgeTypeId |
| `ForgeTypeId StairsCurveType { get; }` | `ParameterTypeId.StairsCurveType` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowAnnotationCutMark { get; }` | `ParameterTypeId.StairsDbgShowAnnotationCutMark` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowBoundary2d { get; }` | `ParameterTypeId.StairsDbgShowBoundary2d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowBoundary3d { get; }` | `ParameterTypeId.StairsDbgShowBoundary3d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowLandingBoundary { get; }` | `ParameterTypeId.StairsDbgShowLandingBoundary` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowLandingFaces { get; }` | `ParameterTypeId.StairsDbgShowLandingFaces` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowLandingPath { get; }` | `ParameterTypeId.StairsDbgShowLandingPath` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowLeftRunBoundary2d { get; }` | `ParameterTypeId.StairsDbgShowLeftRunBoundary2d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowLeftRunBoundary3d { get; }` | `ParameterTypeId.StairsDbgShowLeftRunBoundary3d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowMonolithicSupportCorseGeom { get; }` | `ParameterTypeId.StairsDbgShowMonolithicSupportCorseGeom` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowMonolithicSupportGeom { get; }` | `ParameterTypeId.StairsDbgShowMonolithicSupportGeom` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRightRunBoundary2d { get; }` | `ParameterTypeId.StairsDbgShowRightRunBoundary2d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRightRunBoundary3d { get; }` | `ParameterTypeId.StairsDbgShowRightRunBoundary3d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunCorseGeom { get; }` | `ParameterTypeId.StairsDbgShowRunCorseGeom` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunGeom { get; }` | `ParameterTypeId.StairsDbgShowRunGeom` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunNosing { get; }` | `ParameterTypeId.StairsDbgShowRunNosing` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunOutlineForPlan { get; }` | `ParameterTypeId.StairsDbgShowRunOutlineForPlan` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunPath2d { get; }` | `ParameterTypeId.StairsDbgShowRunPath2d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunPath3d { get; }` | `ParameterTypeId.StairsDbgShowRunPath3d` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowRunRiser { get; }` | `ParameterTypeId.StairsDbgShowRunRiser` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowSupportPath { get; }` | `ParameterTypeId.StairsDbgShowSupportPath` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowTreadFaces { get; }` | `ParameterTypeId.StairsDbgShowTreadFaces` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowTriserCorseGeom { get; }` | `ParameterTypeId.StairsDbgShowTriserCorseGeom` | ForgeTypeId |
| `ForgeTypeId StairsDbgShowTriserGeom { get; }` | `ParameterTypeId.StairsDbgShowTriserGeom` | ForgeTypeId |
| `ForgeTypeId StairsDesiredNumberOfRisers { get; }` | `ParameterTypeId.StairsDesiredNumberOfRisers` | ForgeTypeId |
| `ForgeTypeId StairsDesiredNumRisers { get; }` | `ParameterTypeId.StairsDesiredNumRisers` | ForgeTypeId |
| `ForgeTypeId StairsDownText { get; }` | `ParameterTypeId.StairsDownText` | ForgeTypeId |
| `ForgeTypeId StairsEnableCalculationRuleChecking { get; }` | `ParameterTypeId.StairsEnableCalculationRuleChecking` | ForgeTypeId |
| `ForgeTypeId StairsInstAlwaysUp { get; }` | `ParameterTypeId.StairsInstAlwaysUp` | ForgeTypeId |
| `ForgeTypeId StairsInstDownArrowOn { get; }` | `ParameterTypeId.StairsInstDownArrowOn` | ForgeTypeId |
| `ForgeTypeId StairsInstDownLabelOn { get; }` | `ParameterTypeId.StairsInstDownLabelOn` | ForgeTypeId |
| `ForgeTypeId StairsInstDownLabelText { get; }` | `ParameterTypeId.StairsInstDownLabelText` | ForgeTypeId |
| `ForgeTypeId StairsInstUpArrowOn { get; }` | `ParameterTypeId.StairsInstUpArrowOn` | ForgeTypeId |
| `ForgeTypeId StairsInstUpLabelOn { get; }` | `ParameterTypeId.StairsInstUpLabelOn` | ForgeTypeId |
| `ForgeTypeId StairsInstUpLabelText { get; }` | `ParameterTypeId.StairsInstUpLabelText` | ForgeTypeId |
| `ForgeTypeId StairsLandingBaseElevation { get; }` | `ParameterTypeId.StairsLandingBaseElevation` | ForgeTypeId |
| `ForgeTypeId StairsLandingOverridden { get; }` | `ParameterTypeId.StairsLandingOverridden` | ForgeTypeId |
| `ForgeTypeId StairsLandingStructural { get; }` | `ParameterTypeId.StairsLandingStructural` | ForgeTypeId |
| `ForgeTypeId StairsLandingThickness { get; }` | `ParameterTypeId.StairsLandingThickness` | ForgeTypeId |
| `ForgeTypeId StairsLandingtypeHasMonolithicSupport { get; }` | `ParameterTypeId.StairsLandingtypeHasMonolithicSupport` | ForgeTypeId |
| `ForgeTypeId StairsLandingtypeLandingMaterial { get; }` | `ParameterTypeId.StairsLandingtypeLandingMaterial` | ForgeTypeId |
| `ForgeTypeId StairsLandingtypeStructure { get; }` | `ParameterTypeId.StairsLandingtypeStructure` | ForgeTypeId |
| `ForgeTypeId StairsLandingtypeThickness { get; }` | `ParameterTypeId.StairsLandingtypeThickness` | ForgeTypeId |
| `ForgeTypeId StairsLandingtypeTreadriserType { get; }` | `ParameterTypeId.StairsLandingtypeTreadriserType` | ForgeTypeId |
| `ForgeTypeId StairsLandingtypeUseSameTriserAsRun { get; }` | `ParameterTypeId.StairsLandingtypeUseSameTriserAsRun` | ForgeTypeId |
| `ForgeTypeId StairsMinAutomaticLandingDepth { get; }` | `ParameterTypeId.StairsMinAutomaticLandingDepth` | ForgeTypeId |
| `ForgeTypeId StairsMultistoryTopLevelParam { get; }` | `ParameterTypeId.StairsMultistoryTopLevelParam` | ForgeTypeId |
| `ForgeTypeId StairsMultistoryUpToLevel { get; }` | `ParameterTypeId.StairsMultistoryUpToLevel` | ForgeTypeId |
| `ForgeTypeId StairsPathFullStepArrow { get; }` | `ParameterTypeId.StairsPathFullStepArrow` | ForgeTypeId |
| `ForgeTypeId StairsPathStartExtension { get; }` | `ParameterTypeId.StairsPathStartExtension` | ForgeTypeId |
| `ForgeTypeId StairsPathStartFromRiser { get; }` | `ParameterTypeId.StairsPathStartFromRiser` | ForgeTypeId |
| `ForgeTypeId StairsRailingAngledConnection { get; }` | `ParameterTypeId.StairsRailingAngledConnection` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterBottomAngle { get; }` | `ParameterTypeId.StairsRailingBalusterBottomAngle` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterFamily { get; }` | `ParameterTypeId.StairsRailingBalusterFamily` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterHeight { get; }` | `ParameterTypeId.StairsRailingBalusterHeight` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterIsPost { get; }` | `ParameterTypeId.StairsRailingBalusterIsPost` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterLength { get; }` | `ParameterTypeId.StairsRailingBalusterLength` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterOffset { get; }` | `ParameterTypeId.StairsRailingBalusterOffset` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterPlacement { get; }` | `ParameterTypeId.StairsRailingBalusterPlacement` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterShape { get; }` | `ParameterTypeId.StairsRailingBalusterShape` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterSlopeAngle { get; }` | `ParameterTypeId.StairsRailingBalusterSlopeAngle` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterSpacing { get; }` | `ParameterTypeId.StairsRailingBalusterSpacing` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterSpacingType { get; }` | `ParameterTypeId.StairsRailingBalusterSpacingType` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalustersPerTread { get; }` | `ParameterTypeId.StairsRailingBalustersPerTread` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterTopAngle { get; }` | `ParameterTypeId.StairsRailingBalusterTopAngle` | ForgeTypeId |
| `ForgeTypeId StairsRailingBalusterWidth { get; }` | `ParameterTypeId.StairsRailingBalusterWidth` | ForgeTypeId |
| `ForgeTypeId StairsRailingBaseLevelParam { get; }` | `ParameterTypeId.StairsRailingBaseLevelParam` | ForgeTypeId |
| `ForgeTypeId StairsRailingConnection { get; }` | `ParameterTypeId.StairsRailingConnection` | ForgeTypeId |
| `ForgeTypeId StairsRailingHeight { get; }` | `ParameterTypeId.StairsRailingHeight` | ForgeTypeId |
| `ForgeTypeId StairsRailingHeightOffset { get; }` | `ParameterTypeId.StairsRailingHeightOffset` | ForgeTypeId |
| `ForgeTypeId StairsRailingHeightShiftType { get; }` | `ParameterTypeId.StairsRailingHeightShiftType` | ForgeTypeId |
| `ForgeTypeId StairsRailingHeightShiftVal { get; }` | `ParameterTypeId.StairsRailingHeightShiftVal` | ForgeTypeId |
| `ForgeTypeId StairsRailingPlacementOffset { get; }` | `ParameterTypeId.StairsRailingPlacementOffset` | ForgeTypeId |
| `ForgeTypeId StairsRailingRailHeight { get; }` | `ParameterTypeId.StairsRailingRailHeight` | ForgeTypeId |
| `ForgeTypeId StairsRailingRailName { get; }` | `ParameterTypeId.StairsRailingRailName` | ForgeTypeId |
| `ForgeTypeId StairsRailingRailOffset { get; }` | `ParameterTypeId.StairsRailingRailOffset` | ForgeTypeId |
| `ForgeTypeId StairsRailingRailStructure { get; }` | `ParameterTypeId.StairsRailingRailStructure` | ForgeTypeId |
| `ForgeTypeId StairsRailingShape { get; }` | `ParameterTypeId.StairsRailingShape` | ForgeTypeId |
| `ForgeTypeId StairsRailingTangentConnection { get; }` | `ParameterTypeId.StairsRailingTangentConnection` | ForgeTypeId |
| `ForgeTypeId StairsRailingThickness { get; }` | `ParameterTypeId.StairsRailingThickness` | ForgeTypeId |
| `ForgeTypeId StairsRailingWidth { get; }` | `ParameterTypeId.StairsRailingWidth` | ForgeTypeId |
| `ForgeTypeId StairsRunActualNumberOfRisers { get; }` | `ParameterTypeId.StairsRunActualNumberOfRisers` | ForgeTypeId |
| `ForgeTypeId StairsRunActualNumberOfTreads { get; }` | `ParameterTypeId.StairsRunActualNumberOfTreads` | ForgeTypeId |
| `ForgeTypeId StairsRunActualRiserHeight { get; }` | `ParameterTypeId.StairsRunActualRiserHeight` | ForgeTypeId |
| `ForgeTypeId StairsRunActualRunWidth { get; }` | `ParameterTypeId.StairsRunActualRunWidth` | ForgeTypeId |
| `ForgeTypeId StairsRunActualTreadDepth { get; }` | `ParameterTypeId.StairsRunActualTreadDepth` | ForgeTypeId |
| `ForgeTypeId StairsRunBeginWithRiser { get; }` | `ParameterTypeId.StairsRunBeginWithRiser` | ForgeTypeId |
| `ForgeTypeId StairsRunBottomElevation { get; }` | `ParameterTypeId.StairsRunBottomElevation` | ForgeTypeId |
| `ForgeTypeId StairsRunCcw { get; }` | `ParameterTypeId.StairsRunCcw` | ForgeTypeId |
| `ForgeTypeId StairsRunCenterMarkVisible { get; }` | `ParameterTypeId.StairsRunCenterMarkVisible` | ForgeTypeId |
| `ForgeTypeId StairsRunCreateAutoLanding { get; }` | `ParameterTypeId.StairsRunCreateAutoLanding` | ForgeTypeId |
| `ForgeTypeId StairsRunEndWithRiser { get; }` | `ParameterTypeId.StairsRunEndWithRiser` | ForgeTypeId |
| `ForgeTypeId StairsRunExtendBelowRiserBase { get; }` | `ParameterTypeId.StairsRunExtendBelowRiserBase` | ForgeTypeId |
| `ForgeTypeId StairsRunExtendBelowTreadBase { get; }` | `ParameterTypeId.StairsRunExtendBelowTreadBase` | ForgeTypeId |
| `ForgeTypeId StairsRunHeight { get; }` | `ParameterTypeId.StairsRunHeight` | ForgeTypeId |
| `ForgeTypeId StairsRunLocationpathJustfication { get; }` | `ParameterTypeId.StairsRunLocationpathJustfication` | ForgeTypeId |
| `ForgeTypeId StairsRunOverridden { get; }` | `ParameterTypeId.StairsRunOverridden` | ForgeTypeId |
| `ForgeTypeId StairsRunStructural { get; }` | `ParameterTypeId.StairsRunStructural` | ForgeTypeId |
| `ForgeTypeId StairsRunTopElevation { get; }` | `ParameterTypeId.StairsRunTopElevation` | ForgeTypeId |
| `ForgeTypeId StairsRuntypeHasMonolithicSupport { get; }` | `ParameterTypeId.StairsRuntypeHasMonolithicSupport` | ForgeTypeId |
| `ForgeTypeId StairsRuntypeRunMaterial { get; }` | `ParameterTypeId.StairsRuntypeRunMaterial` | ForgeTypeId |
| `ForgeTypeId StairsRuntypeStructuralDepth { get; }` | `ParameterTypeId.StairsRuntypeStructuralDepth` | ForgeTypeId |
| `ForgeTypeId StairsRuntypeStructure { get; }` | `ParameterTypeId.StairsRuntypeStructure` | ForgeTypeId |
| `ForgeTypeId StairsRuntypeTotalDepth { get; }` | `ParameterTypeId.StairsRuntypeTotalDepth` | ForgeTypeId |
| `ForgeTypeId StairsRuntypeUndersideSurfaceType { get; }` | `ParameterTypeId.StairsRuntypeUndersideSurfaceType` | ForgeTypeId |
| `ForgeTypeId StairsRunWidthMeasurement { get; }` | `ParameterTypeId.StairsRunWidthMeasurement` | ForgeTypeId |
| `ForgeTypeId StairsRunWinderBeginWithStraight { get; }` | `ParameterTypeId.StairsRunWinderBeginWithStraight` | ForgeTypeId |
| `ForgeTypeId StairsRunWinderEndWithStraight { get; }` | `ParameterTypeId.StairsRunWinderEndWithStraight` | ForgeTypeId |
| `ForgeTypeId StairsShowDownText { get; }` | `ParameterTypeId.StairsShowDownText` | ForgeTypeId |
| `ForgeTypeId StairsShowUpText { get; }` | `ParameterTypeId.StairsShowUpText` | ForgeTypeId |
| `ForgeTypeId StairsStairsHeight { get; }` | `ParameterTypeId.StairsStairsHeight` | ForgeTypeId |
| `ForgeTypeId StairsStringersPresent { get; }` | `ParameterTypeId.StairsStringersPresent` | ForgeTypeId |
| `ForgeTypeId StairsSupportHorizontalOffset { get; }` | `ParameterTypeId.StairsSupportHorizontalOffset` | ForgeTypeId |
| `ForgeTypeId StairsSupportLandingsupportType { get; }` | `ParameterTypeId.StairsSupportLandingsupportType` | ForgeTypeId |
| `ForgeTypeId StairsSupportLowerEndCut { get; }` | `ParameterTypeId.StairsSupportLowerEndCut` | ForgeTypeId |
| `ForgeTypeId StairsSupportOverridden { get; }` | `ParameterTypeId.StairsSupportOverridden` | ForgeTypeId |
| `ForgeTypeId StairsSupportTrimSupportUpper { get; }` | `ParameterTypeId.StairsSupportTrimSupportUpper` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeFlipSectionProfile { get; }` | `ParameterTypeId.StairsSupporttypeFlipSectionProfile` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeMaterial { get; }` | `ParameterTypeId.StairsSupporttypeMaterial` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeSectionProfile { get; }` | `ParameterTypeId.StairsSupporttypeSectionProfile` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeStructuralDepth { get; }` | `ParameterTypeId.StairsSupporttypeStructuralDepth` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeStructuralDepthOnLanding { get; }` | `ParameterTypeId.StairsSupporttypeStructuralDepthOnLanding` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeStructuralDepthOnRun { get; }` | `ParameterTypeId.StairsSupporttypeStructuralDepthOnRun` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeTopsideSurface { get; }` | `ParameterTypeId.StairsSupporttypeTopsideSurface` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeTotalDepth { get; }` | `ParameterTypeId.StairsSupporttypeTotalDepth` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeUndersideSurface { get; }` | `ParameterTypeId.StairsSupporttypeUndersideSurface` | ForgeTypeId |
| `ForgeTypeId StairsSupporttypeWidth { get; }` | `ParameterTypeId.StairsSupporttypeWidth` | ForgeTypeId |
| `ForgeTypeId StairsSupportUpperEndCut { get; }` | `ParameterTypeId.StairsSupportUpperEndCut` | ForgeTypeId |
| `ForgeTypeId StairsSupportVerticalOffset { get; }` | `ParameterTypeId.StairsSupportVerticalOffset` | ForgeTypeId |
| `ForgeTypeId StairsTextOrientation { get; }` | `ParameterTypeId.StairsTextOrientation` | ForgeTypeId |
| `ForgeTypeId StairsTextType { get; }` | `ParameterTypeId.StairsTextType` | ForgeTypeId |
| `ForgeTypeId StairsTopLevel { get; }` | `ParameterTypeId.StairsTopLevel` | ForgeTypeId |
| `ForgeTypeId StairsTopLevelParam { get; }` | `ParameterTypeId.StairsTopLevelParam` | ForgeTypeId |
| `ForgeTypeId StairsTopOffset { get; }` | `ParameterTypeId.StairsTopOffset` | ForgeTypeId |
| `ForgeTypeId StairsTotalNumberOfRisers { get; }` | `ParameterTypeId.StairsTotalNumberOfRisers` | ForgeTypeId |
| `ForgeTypeId StairsTotalNumberOfTreads { get; }` | `ParameterTypeId.StairsTotalNumberOfTreads` | ForgeTypeId |
| `ForgeTypeId StairsTriserIsTypeOverridden { get; }` | `ParameterTypeId.StairsTriserIsTypeOverridden` | ForgeTypeId |
| `ForgeTypeId StairsTriserNumberBaseIndex { get; }` | `ParameterTypeId.StairsTriserNumberBaseIndex` | ForgeTypeId |
| `ForgeTypeId StairsTriserRiserMark { get; }` | `ParameterTypeId.StairsTriserRiserMark` | ForgeTypeId |
| `ForgeTypeId StairsTriserRiserNumber { get; }` | `ParameterTypeId.StairsTriserRiserNumber` | ForgeTypeId |
| `ForgeTypeId StairsTriserTreadMark { get; }` | `ParameterTypeId.StairsTriserTreadMark` | ForgeTypeId |
| `ForgeTypeId StairsTriserTreadNumber { get; }` | `ParameterTypeId.StairsTriserTreadNumber` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeBackNosing { get; }` | `ParameterTypeId.StairsTrisertypeBackNosing` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeFrontNosing { get; }` | `ParameterTypeId.StairsTrisertypeFrontNosing` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeLeftNosing { get; }` | `ParameterTypeId.StairsTrisertypeLeftNosing` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeNosingLength { get; }` | `ParameterTypeId.StairsTrisertypeNosingLength` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeNosingPlacement { get; }` | `ParameterTypeId.StairsTrisertypeNosingPlacement` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeNosingProfile { get; }` | `ParameterTypeId.StairsTrisertypeNosingProfile` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRightNosing { get; }` | `ParameterTypeId.StairsTrisertypeRightNosing` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiser { get; }` | `ParameterTypeId.StairsTrisertypeRiser` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiserIsSlanted { get; }` | `ParameterTypeId.StairsTrisertypeRiserIsSlanted` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiserMaterial { get; }` | `ParameterTypeId.StairsTrisertypeRiserMaterial` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiserProfile { get; }` | `ParameterTypeId.StairsTrisertypeRiserProfile` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiserStyle { get; }` | `ParameterTypeId.StairsTrisertypeRiserStyle` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiserThickness { get; }` | `ParameterTypeId.StairsTrisertypeRiserThickness` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeRiserTreadConnection { get; }` | `ParameterTypeId.StairsTrisertypeRiserTreadConnection` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeTread { get; }` | `ParameterTypeId.StairsTrisertypeTread` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeTreadMaterial { get; }` | `ParameterTypeId.StairsTrisertypeTreadMaterial` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeTreadProfile { get; }` | `ParameterTypeId.StairsTrisertypeTreadProfile` | ForgeTypeId |
| `ForgeTypeId StairsTrisertypeTreadThickness { get; }` | `ParameterTypeId.StairsTrisertypeTreadThickness` | ForgeTypeId |
| `ForgeTypeId StairstypeCalcRuleMaxResult { get; }` | `ParameterTypeId.StairstypeCalcRuleMaxResult` | ForgeTypeId |
| `ForgeTypeId StairstypeCalcRuleMinResult { get; }` | `ParameterTypeId.StairstypeCalcRuleMinResult` | ForgeTypeId |
| `ForgeTypeId StairstypeCalcRuleRiserMultiplier { get; }` | `ParameterTypeId.StairstypeCalcRuleRiserMultiplier` | ForgeTypeId |
| `ForgeTypeId StairstypeCalcRuleTargetResult { get; }` | `ParameterTypeId.StairstypeCalcRuleTargetResult` | ForgeTypeId |
| `ForgeTypeId StairstypeCalcRuleTreadMultiplier { get; }` | `ParameterTypeId.StairstypeCalcRuleTreadMultiplier` | ForgeTypeId |
| `ForgeTypeId StairstypeCalculationRules { get; }` | `ParameterTypeId.StairstypeCalculationRules` | ForgeTypeId |
| `ForgeTypeId StairstypeConstructionMethod { get; }` | `ParameterTypeId.StairstypeConstructionMethod` | ForgeTypeId |
| `ForgeTypeId StairstypeCutmarkType { get; }` | `ParameterTypeId.StairstypeCutmarkType` | ForgeTypeId |
| `ForgeTypeId StairstypeGeomunjoinedEndCutStyle { get; }` | `ParameterTypeId.StairstypeGeomunjoinedEndCutStyle` | ForgeTypeId |
| `ForgeTypeId StairstypeHasIntermediateSupport { get; }` | `ParameterTypeId.StairstypeHasIntermediateSupport` | ForgeTypeId |
| `ForgeTypeId StairstypeHasLeftSupport { get; }` | `ParameterTypeId.StairstypeHasLeftSupport` | ForgeTypeId |
| `ForgeTypeId StairstypeHasRightSupport { get; }` | `ParameterTypeId.StairstypeHasRightSupport` | ForgeTypeId |
| `ForgeTypeId StairstypeIntermediateSupportType { get; }` | `ParameterTypeId.StairstypeIntermediateSupportType` | ForgeTypeId |
| `ForgeTypeId StairstypeIsAssembledStairs { get; }` | `ParameterTypeId.StairstypeIsAssembledStairs` | ForgeTypeId |
| `ForgeTypeId StairstypeLandingType { get; }` | `ParameterTypeId.StairstypeLandingType` | ForgeTypeId |
| `ForgeTypeId StairstypeLeftSideSupportType { get; }` | `ParameterTypeId.StairstypeLeftSideSupportType` | ForgeTypeId |
| `ForgeTypeId StairstypeLeftSupportLateralOffset { get; }` | `ParameterTypeId.StairstypeLeftSupportLateralOffset` | ForgeTypeId |
| `ForgeTypeId StairstypeMaximumRiserHeight { get; }` | `ParameterTypeId.StairstypeMaximumRiserHeight` | ForgeTypeId |
| `ForgeTypeId StairstypeMinimumRunWidth { get; }` | `ParameterTypeId.StairstypeMinimumRunWidth` | ForgeTypeId |
| `ForgeTypeId StairstypeMinimumTreadDepth { get; }` | `ParameterTypeId.StairstypeMinimumTreadDepth` | ForgeTypeId |
| `ForgeTypeId StairstypeMinimumTreadWidthInsideBoundary { get; }` | `ParameterTypeId.StairstypeMinimumTreadWidthInsideBoundary` | ForgeTypeId |
| `ForgeTypeId StairstypeNotchCustomWidth { get; }` | `ParameterTypeId.StairstypeNotchCustomWidth` | ForgeTypeId |
| `ForgeTypeId StairstypeNotchExtension { get; }` | `ParameterTypeId.StairstypeNotchExtension` | ForgeTypeId |
| `ForgeTypeId StairstypeNotchHorizontalGap { get; }` | `ParameterTypeId.StairstypeNotchHorizontalGap` | ForgeTypeId |
| `ForgeTypeId StairstypeNotchThickness { get; }` | `ParameterTypeId.StairstypeNotchThickness` | ForgeTypeId |
| `ForgeTypeId StairstypeNotchVerticalGap { get; }` | `ParameterTypeId.StairstypeNotchVerticalGap` | ForgeTypeId |
| `ForgeTypeId StairstypeNotchWidth { get; }` | `ParameterTypeId.StairstypeNotchWidth` | ForgeTypeId |
| `ForgeTypeId StairstypeNumberOfIntermediateSupports { get; }` | `ParameterTypeId.StairstypeNumberOfIntermediateSupports` | ForgeTypeId |
| `ForgeTypeId StairstypeRightSideSupportType { get; }` | `ParameterTypeId.StairstypeRightSideSupportType` | ForgeTypeId |
| `ForgeTypeId StairstypeRightSupportLateralOffset { get; }` | `ParameterTypeId.StairstypeRightSupportLateralOffset` | ForgeTypeId |
| `ForgeTypeId StairstypeRunType { get; }` | `ParameterTypeId.StairstypeRunType` | ForgeTypeId |
| `ForgeTypeId StairstypeShowCutline { get; }` | `ParameterTypeId.StairstypeShowCutline` | ForgeTypeId |
| `ForgeTypeId StairstypeShowStairPath { get; }` | `ParameterTypeId.StairstypeShowStairPath` | ForgeTypeId |
| `ForgeTypeId StairstypeShowUpdown { get; }` | `ParameterTypeId.StairstypeShowUpdown` | ForgeTypeId |
| `ForgeTypeId StairstypeWinderStepFrontMeasurement { get; }` | `ParameterTypeId.StairstypeWinderStepFrontMeasurement` | ForgeTypeId |
| `ForgeTypeId StairsUpText { get; }` | `ParameterTypeId.StairsUpText` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternFilletInsideCorner { get; }` | `ParameterTypeId.StairsWinderpatternFilletInsideCorner` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternMinimumWidthCorner { get; }` | `ParameterTypeId.StairsWinderpatternMinimumWidthCorner` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternMinimumWidthInsideWalkline { get; }` | `ParameterTypeId.StairsWinderpatternMinimumWidthInsideWalkline` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtBegin { get; }` | `ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtBegin` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtEnd { get; }` | `ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtEnd` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternRadiusInterior { get; }` | `ParameterTypeId.StairsWinderpatternRadiusInterior` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternStairPathOffset { get; }` | `ParameterTypeId.StairsWinderpatternStairPathOffset` | ForgeTypeId |
| `ForgeTypeId StairsWinderpatternWinderStyle { get; }` | `ParameterTypeId.StairsWinderpatternWinderStyle` | ForgeTypeId |
| `ForgeTypeId StartExtension { get; }` | `ParameterTypeId.StartExtension` | ForgeTypeId |
| `ForgeTypeId StartJoinCutback { get; }` | `ParameterTypeId.StartJoinCutback` | ForgeTypeId |
| `ForgeTypeId StartSymbolType { get; }` | `ParameterTypeId.StartSymbolType` | ForgeTypeId |
| `ForgeTypeId StartYJustification { get; }` | `ParameterTypeId.StartYJustification` | ForgeTypeId |
| `ForgeTypeId StartYOffsetValue { get; }` | `ParameterTypeId.StartYOffsetValue` | ForgeTypeId |
| `ForgeTypeId StartZJustification { get; }` | `ParameterTypeId.StartZJustification` | ForgeTypeId |
| `ForgeTypeId StartZOffsetValue { get; }` | `ParameterTypeId.StartZOffsetValue` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorAssembly { get; }` | `ParameterTypeId.SteelElemAnchorAssembly` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorDiameter { get; }` | `ParameterTypeId.SteelElemAnchorDiameter` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorGrade { get; }` | `ParameterTypeId.SteelElemAnchorGrade` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorLength { get; }` | `ParameterTypeId.SteelElemAnchorLength` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorOrientation { get; }` | `ParameterTypeId.SteelElemAnchorOrientation` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorStandard { get; }` | `ParameterTypeId.SteelElemAnchorStandard` | ForgeTypeId |
| `ForgeTypeId SteelElemAnchorTotalWeight { get; }` | `ParameterTypeId.SteelElemAnchorTotalWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltAssembly { get; }` | `ParameterTypeId.SteelElemBoltAssembly` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltCoating { get; }` | `ParameterTypeId.SteelElemBoltCoating` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltDiameter { get; }` | `ParameterTypeId.SteelElemBoltDiameter` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltFinishCalculationAtGap { get; }` | `ParameterTypeId.SteelElemBoltFinishCalculationAtGap` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltGrade { get; }` | `ParameterTypeId.SteelElemBoltGrade` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltGripLength { get; }` | `ParameterTypeId.SteelElemBoltGripLength` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltGripLengthIncrease { get; }` | `ParameterTypeId.SteelElemBoltGripLengthIncrease` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltInverted { get; }` | `ParameterTypeId.SteelElemBoltInverted` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltLength { get; }` | `ParameterTypeId.SteelElemBoltLength` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltLocation { get; }` | `ParameterTypeId.SteelElemBoltLocation` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltStandard { get; }` | `ParameterTypeId.SteelElemBoltStandard` | ForgeTypeId |
| `ForgeTypeId SteelElemBoltTotalWeight { get; }` | `ParameterTypeId.SteelElemBoltTotalWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemCoating { get; }` | `ParameterTypeId.SteelElemCoating` | ForgeTypeId |
| `ForgeTypeId SteelElemContourGapWidth { get; }` | `ParameterTypeId.SteelElemContourGapWidth` | ForgeTypeId |
| `ForgeTypeId SteelElemContourSide1dist { get; }` | `ParameterTypeId.SteelElemContourSide1dist` | ForgeTypeId |
| `ForgeTypeId SteelElemContourSide2dist { get; }` | `ParameterTypeId.SteelElemContourSide2dist` | ForgeTypeId |
| `ForgeTypeId SteelElemCopeAroundAxis { get; }` | `ParameterTypeId.SteelElemCopeAroundAxis` | ForgeTypeId |
| `ForgeTypeId SteelElemCopeAxisAngle { get; }` | `ParameterTypeId.SteelElemCopeAxisAngle` | ForgeTypeId |
| `ForgeTypeId SteelElemCopeDistanceAxis { get; }` | `ParameterTypeId.SteelElemCopeDistanceAxis` | ForgeTypeId |
| `ForgeTypeId SteelElemCopeWidthx { get; }` | `ParameterTypeId.SteelElemCopeWidthx` | ForgeTypeId |
| `ForgeTypeId SteelElemCopeXAngle { get; }` | `ParameterTypeId.SteelElemCopeXAngle` | ForgeTypeId |
| `ForgeTypeId SteelElemCopeZAngle { get; }` | `ParameterTypeId.SteelElemCopeZAngle` | ForgeTypeId |
| `ForgeTypeId SteelElemCutLength { get; }` | `ParameterTypeId.SteelElemCutLength` | ForgeTypeId |
| `ForgeTypeId SteelElemCutType { get; }` | `ParameterTypeId.SteelElemCutType` | ForgeTypeId |
| `ForgeTypeId SteelElemExactWeight { get; }` | `ParameterTypeId.SteelElemExactWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleAlpha { get; }` | `ParameterTypeId.SteelElemHoleAlpha` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleAngle { get; }` | `ParameterTypeId.SteelElemHoleAngle` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleBackTaperThread { get; }` | `ParameterTypeId.SteelElemHoleBackTaperThread` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleDefinition { get; }` | `ParameterTypeId.SteelElemHoleDefinition` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleDepth { get; }` | `ParameterTypeId.SteelElemHoleDepth` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleDepthOfBoltHead { get; }` | `ParameterTypeId.SteelElemHoleDepthOfBoltHead` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleDiameter { get; }` | `ParameterTypeId.SteelElemHoleDiameter` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleHeadDiameter { get; }` | `ParameterTypeId.SteelElemHoleHeadDiameter` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleSlotDirection { get; }` | `ParameterTypeId.SteelElemHoleSlotDirection` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleSlotLength { get; }` | `ParameterTypeId.SteelElemHoleSlotLength` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleTapping { get; }` | `ParameterTypeId.SteelElemHoleTapping` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleTappingHole { get; }` | `ParameterTypeId.SteelElemHoleTappingHole` | ForgeTypeId |
| `ForgeTypeId SteelElemHoleType { get; }` | `ParameterTypeId.SteelElemHoleType` | ForgeTypeId |
| `ForgeTypeId SteelElemMark { get; }` | `ParameterTypeId.SteelElemMark` | ForgeTypeId |
| `ForgeTypeId SteelElemPaintArea { get; }` | `ParameterTypeId.SteelElemPaintArea` | ForgeTypeId |
| `ForgeTypeId SteelElemParamBoringout { get; }` | `ParameterTypeId.SteelElemParamBoringout` | ForgeTypeId |
| `ForgeTypeId SteelElemParamRadius { get; }` | `ParameterTypeId.SteelElemParamRadius` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternEdgeDistanceX { get; }` | `ParameterTypeId.SteelElemPatternEdgeDistanceX` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternEdgeDistanceY { get; }` | `ParameterTypeId.SteelElemPatternEdgeDistanceY` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternIntermediateDistanceX { get; }` | `ParameterTypeId.SteelElemPatternIntermediateDistanceX` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternIntermediateDistanceY { get; }` | `ParameterTypeId.SteelElemPatternIntermediateDistanceY` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternNumber { get; }` | `ParameterTypeId.SteelElemPatternNumber` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternNumberX { get; }` | `ParameterTypeId.SteelElemPatternNumberX` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternNumberY { get; }` | `ParameterTypeId.SteelElemPatternNumberY` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternRadius { get; }` | `ParameterTypeId.SteelElemPatternRadius` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternTotalLength { get; }` | `ParameterTypeId.SteelElemPatternTotalLength` | ForgeTypeId |
| `ForgeTypeId SteelElemPatternTotalWidth { get; }` | `ParameterTypeId.SteelElemPatternTotalWidth` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateArea { get; }` | `ParameterTypeId.SteelElemPlateArea` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateExactWeight { get; }` | `ParameterTypeId.SteelElemPlateExactWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateJustification { get; }` | `ParameterTypeId.SteelElemPlateJustification` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateLength { get; }` | `ParameterTypeId.SteelElemPlateLength` | ForgeTypeId |
| `ForgeTypeId SteelElemPlatePaintArea { get; }` | `ParameterTypeId.SteelElemPlatePaintArea` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateShortenAngle { get; }` | `ParameterTypeId.SteelElemPlateShortenAngle` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateShortenCutstraight { get; }` | `ParameterTypeId.SteelElemPlateShortenCutstraight` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateShortenSuction { get; }` | `ParameterTypeId.SteelElemPlateShortenSuction` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateThickness { get; }` | `ParameterTypeId.SteelElemPlateThickness` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateType { get; }` | `ParameterTypeId.SteelElemPlateType` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateVolume { get; }` | `ParameterTypeId.SteelElemPlateVolume` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateWeight { get; }` | `ParameterTypeId.SteelElemPlateWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemPlateWidth { get; }` | `ParameterTypeId.SteelElemPlateWidth` | ForgeTypeId |
| `ForgeTypeId SteelElemProfileLength { get; }` | `ParameterTypeId.SteelElemProfileLength` | ForgeTypeId |
| `ForgeTypeId SteelElemProfileType { get; }` | `ParameterTypeId.SteelElemProfileType` | ForgeTypeId |
| `ForgeTypeId SteelElemProfileVolume { get; }` | `ParameterTypeId.SteelElemProfileVolume` | ForgeTypeId |
| `ForgeTypeId SteelElemShearstudDiameter { get; }` | `ParameterTypeId.SteelElemShearstudDiameter` | ForgeTypeId |
| `ForgeTypeId SteelElemShearstudGrade { get; }` | `ParameterTypeId.SteelElemShearstudGrade` | ForgeTypeId |
| `ForgeTypeId SteelElemShearstudLength { get; }` | `ParameterTypeId.SteelElemShearstudLength` | ForgeTypeId |
| `ForgeTypeId SteelElemShearstudStandard { get; }` | `ParameterTypeId.SteelElemShearstudStandard` | ForgeTypeId |
| `ForgeTypeId SteelElemShearstudTotalWeight { get; }` | `ParameterTypeId.SteelElemShearstudTotalWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemShortenAngley { get; }` | `ParameterTypeId.SteelElemShortenAngley` | ForgeTypeId |
| `ForgeTypeId SteelElemShortenAnglez { get; }` | `ParameterTypeId.SteelElemShortenAnglez` | ForgeTypeId |
| `ForgeTypeId SteelElemShortenReflength { get; }` | `ParameterTypeId.SteelElemShortenReflength` | ForgeTypeId |
| `ForgeTypeId SteelElemSinglePartMark { get; }` | `ParameterTypeId.SteelElemSinglePartMark` | ForgeTypeId |
| `ForgeTypeId SteelElemWeight { get; }` | `ParameterTypeId.SteelElemWeight` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldContinuous { get; }` | `ParameterTypeId.SteelElemWeldContinuous` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleEffectivethroat { get; }` | `ParameterTypeId.SteelElemWeldDoubleEffectivethroat` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoublePrepdepth { get; }` | `ParameterTypeId.SteelElemWeldDoublePrepdepth` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleRootopening { get; }` | `ParameterTypeId.SteelElemWeldDoubleRootopening` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleSurfaceshape { get; }` | `ParameterTypeId.SteelElemWeldDoubleSurfaceshape` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleText { get; }` | `ParameterTypeId.SteelElemWeldDoubleText` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleThickness { get; }` | `ParameterTypeId.SteelElemWeldDoubleThickness` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleType { get; }` | `ParameterTypeId.SteelElemWeldDoubleType` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldDoubleWeldprep { get; }` | `ParameterTypeId.SteelElemWeldDoubleWeldprep` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldLength { get; }` | `ParameterTypeId.SteelElemWeldLength` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldLocation { get; }` | `ParameterTypeId.SteelElemWeldLocation` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainEffectivethroat { get; }` | `ParameterTypeId.SteelElemWeldMainEffectivethroat` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainPrepdepth { get; }` | `ParameterTypeId.SteelElemWeldMainPrepdepth` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainRootopening { get; }` | `ParameterTypeId.SteelElemWeldMainRootopening` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainSurfaceshape { get; }` | `ParameterTypeId.SteelElemWeldMainSurfaceshape` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainText { get; }` | `ParameterTypeId.SteelElemWeldMainText` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainThickness { get; }` | `ParameterTypeId.SteelElemWeldMainThickness` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainType { get; }` | `ParameterTypeId.SteelElemWeldMainType` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldMainWeldprep { get; }` | `ParameterTypeId.SteelElemWeldMainWeldprep` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldPitch { get; }` | `ParameterTypeId.SteelElemWeldPitch` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldPrefix { get; }` | `ParameterTypeId.SteelElemWeldPrefix` | ForgeTypeId |
| `ForgeTypeId SteelElemWeldTextModule { get; }` | `ParameterTypeId.SteelElemWeldTextModule` | ForgeTypeId |
| `ForgeTypeId SteelElemXDistance { get; }` | `ParameterTypeId.SteelElemXDistance` | ForgeTypeId |
| `ForgeTypeId SteelElemYDistance { get; }` | `ParameterTypeId.SteelElemYDistance` | ForgeTypeId |
| `ForgeTypeId SteelElemZclipType { get; }` | `ParameterTypeId.SteelElemZclipType` | ForgeTypeId |
| `ForgeTypeId StiffenerClassification { get; }` | `ParameterTypeId.StiffenerClassification` | ForgeTypeId |
| `ForgeTypeId StructConnectionApplyTo { get; }` | `ParameterTypeId.StructConnectionApplyTo` | ForgeTypeId |
| `ForgeTypeId StructConnectionBeamEnd { get; }` | `ParameterTypeId.StructConnectionBeamEnd` | ForgeTypeId |
| `ForgeTypeId StructConnectionBeamStart { get; }` | `ParameterTypeId.StructConnectionBeamStart` | ForgeTypeId |
| `ForgeTypeId StructConnectionColumnBase { get; }` | `ParameterTypeId.StructConnectionColumnBase` | ForgeTypeId |
| `ForgeTypeId StructConnectionColumnTop { get; }` | `ParameterTypeId.StructConnectionColumnTop` | ForgeTypeId |
| `ForgeTypeId StructConnectionCutback { get; }` | `ParameterTypeId.StructConnectionCutback` | ForgeTypeId |
| `ForgeTypeId StructConnectionTypeName { get; }` | `ParameterTypeId.StructConnectionTypeName` | ForgeTypeId |
| `ForgeTypeId StructFramJoinStatus { get; }` | `ParameterTypeId.StructFramJoinStatus` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalBeamHorizontalProjectionPlane { get; }` | `ParameterTypeId.StructuralAnalyticalBeamHorizontalProjectionPlane` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalBeamRigidLink { get; }` | `ParameterTypeId.StructuralAnalyticalBeamRigidLink` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalColumnHorizontalProjectionPlane { get; }` | `ParameterTypeId.StructuralAnalyticalColumnHorizontalProjectionPlane` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalColumnRigidLink { get; }` | `ParameterTypeId.StructuralAnalyticalColumnRigidLink` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalHardPoints { get; }` | `ParameterTypeId.StructuralAnalyticalHardPoints` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalModel { get; }` | `ParameterTypeId.StructuralAnalyticalModel` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalProjectFloorPlane { get; }` | `ParameterTypeId.StructuralAnalyticalProjectFloorPlane` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalProjectMemberPlane { get; }` | `ParameterTypeId.StructuralAnalyticalProjectMemberPlane` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalProjectMemberPlaneColumnBottom { get; }` | `ParameterTypeId.StructuralAnalyticalProjectMemberPlaneColumnBottom` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalProjectMemberPlaneColumnTop { get; }` | `ParameterTypeId.StructuralAnalyticalProjectMemberPlaneColumnTop` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalTessDeviation { get; }` | `ParameterTypeId.StructuralAnalyticalTessDeviation` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyticalTessellate { get; }` | `ParameterTypeId.StructuralAnalyticalTessellate` | ForgeTypeId |
| `ForgeTypeId StructuralAnalyzesAs { get; }` | `ParameterTypeId.StructuralAnalyzesAs` | ForgeTypeId |
| `ForgeTypeId StructuralAssetParam { get; }` | `ParameterTypeId.StructuralAssetParam` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentBaseDistance { get; }` | `ParameterTypeId.StructuralAttachmentBaseDistance` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentBaseRatio { get; }` | `ParameterTypeId.StructuralAttachmentBaseRatio` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentBaseReferencedend { get; }` | `ParameterTypeId.StructuralAttachmentBaseReferencedend` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentBaseType { get; }` | `ParameterTypeId.StructuralAttachmentBaseType` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentEndLevelReference { get; }` | `ParameterTypeId.StructuralAttachmentEndLevelReference` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentEndRefelementEnd { get; }` | `ParameterTypeId.StructuralAttachmentEndRefelementEnd` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentEndType { get; }` | `ParameterTypeId.StructuralAttachmentEndType` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentEndValueDistance { get; }` | `ParameterTypeId.StructuralAttachmentEndValueDistance` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentEndValueElevation { get; }` | `ParameterTypeId.StructuralAttachmentEndValueElevation` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentEndValueRatio { get; }` | `ParameterTypeId.StructuralAttachmentEndValueRatio` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentStartLevelReference { get; }` | `ParameterTypeId.StructuralAttachmentStartLevelReference` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentStartRefelementEnd { get; }` | `ParameterTypeId.StructuralAttachmentStartRefelementEnd` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentStartType { get; }` | `ParameterTypeId.StructuralAttachmentStartType` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentStartValueDistance { get; }` | `ParameterTypeId.StructuralAttachmentStartValueDistance` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentStartValueElevation { get; }` | `ParameterTypeId.StructuralAttachmentStartValueElevation` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentStartValueRatio { get; }` | `ParameterTypeId.StructuralAttachmentStartValueRatio` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentTopDistance { get; }` | `ParameterTypeId.StructuralAttachmentTopDistance` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentTopRatio { get; }` | `ParameterTypeId.StructuralAttachmentTopRatio` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentTopReferencedend { get; }` | `ParameterTypeId.StructuralAttachmentTopReferencedend` | ForgeTypeId |
| `ForgeTypeId StructuralAttachmentTopType { get; }` | `ParameterTypeId.StructuralAttachmentTopType` | ForgeTypeId |
| `ForgeTypeId StructuralBeamCutbackForColumn { get; }` | `ParameterTypeId.StructuralBeamCutbackForColumn` | ForgeTypeId |
| `ForgeTypeId StructuralBeamEnd0Elevation { get; }` | `ParameterTypeId.StructuralBeamEnd0Elevation` | ForgeTypeId |
| `ForgeTypeId StructuralBeamEnd1Elevation { get; }` | `ParameterTypeId.StructuralBeamEnd1Elevation` | ForgeTypeId |
| `ForgeTypeId StructuralBeamEndAttachmentDistance { get; }` | `ParameterTypeId.StructuralBeamEndAttachmentDistance` | ForgeTypeId |
| `ForgeTypeId StructuralBeamEndAttachmentRefcolumnEnd { get; }` | `ParameterTypeId.StructuralBeamEndAttachmentRefcolumnEnd` | ForgeTypeId |
| `ForgeTypeId StructuralBeamEndAttachmentType { get; }` | `ParameterTypeId.StructuralBeamEndAttachmentType` | ForgeTypeId |
| `ForgeTypeId StructuralBeamEndSupport { get; }` | `ParameterTypeId.StructuralBeamEndSupport` | ForgeTypeId |
| `ForgeTypeId StructuralBeamOrientation { get; }` | `ParameterTypeId.StructuralBeamOrientation` | ForgeTypeId |
| `ForgeTypeId StructuralBeamStartAttachmentDistance { get; }` | `ParameterTypeId.StructuralBeamStartAttachmentDistance` | ForgeTypeId |
| `ForgeTypeId StructuralBeamStartAttachmentRefcolumnEnd { get; }` | `ParameterTypeId.StructuralBeamStartAttachmentRefcolumnEnd` | ForgeTypeId |
| `ForgeTypeId StructuralBeamStartAttachmentType { get; }` | `ParameterTypeId.StructuralBeamStartAttachmentType` | ForgeTypeId |
| `ForgeTypeId StructuralBeamStartSupport { get; }` | `ParameterTypeId.StructuralBeamStartSupport` | ForgeTypeId |
| `ForgeTypeId StructuralBendDirAngle { get; }` | `ParameterTypeId.StructuralBendDirAngle` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseFx { get; }` | `ParameterTypeId.StructuralBottomReleaseFx` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseFy { get; }` | `ParameterTypeId.StructuralBottomReleaseFy` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseFz { get; }` | `ParameterTypeId.StructuralBottomReleaseFz` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseMx { get; }` | `ParameterTypeId.StructuralBottomReleaseMx` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseMy { get; }` | `ParameterTypeId.StructuralBottomReleaseMy` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseMz { get; }` | `ParameterTypeId.StructuralBottomReleaseMz` | ForgeTypeId |
| `ForgeTypeId StructuralBottomReleaseType { get; }` | `ParameterTypeId.StructuralBottomReleaseType` | ForgeTypeId |
| `ForgeTypeId StructuralBraceRepresentation { get; }` | `ParameterTypeId.StructuralBraceRepresentation` | ForgeTypeId |
| `ForgeTypeId StructuralCamber { get; }` | `ParameterTypeId.StructuralCamber` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionApprovalStatus { get; }` | `ParameterTypeId.StructuralConnectionApprovalStatus` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionCodeCheckingStatus { get; }` | `ParameterTypeId.StructuralConnectionCodeCheckingStatus` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionEditRangesOfApplicability { get; }` | `ParameterTypeId.StructuralConnectionEditRangesOfApplicability` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionEditType { get; }` | `ParameterTypeId.StructuralConnectionEditType` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionInputElements { get; }` | `ParameterTypeId.StructuralConnectionInputElements` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionModifyConnectionParameters { get; }` | `ParameterTypeId.StructuralConnectionModifyConnectionParameters` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionNobleStatus { get; }` | `ParameterTypeId.StructuralConnectionNobleStatus` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionOverrideType { get; }` | `ParameterTypeId.StructuralConnectionOverrideType` | ForgeTypeId |
| `ForgeTypeId StructuralConnectionSymbol { get; }` | `ParameterTypeId.StructuralConnectionSymbol` | ForgeTypeId |
| `ForgeTypeId StructuralCopingDistance { get; }` | `ParameterTypeId.StructuralCopingDistance` | ForgeTypeId |
| `ForgeTypeId StructuralDisplayInHiddenViews { get; }` | `ParameterTypeId.StructuralDisplayInHiddenViews` | ForgeTypeId |
| `ForgeTypeId StructuralDisplayInHiddenViewsColumn { get; }` | `ParameterTypeId.StructuralDisplayInHiddenViewsColumn` | ForgeTypeId |
| `ForgeTypeId StructuralDisplayInHiddenViewsFraming { get; }` | `ParameterTypeId.StructuralDisplayInHiddenViewsFraming` | ForgeTypeId |
| `ForgeTypeId StructuralElevationAtBottom { get; }` | `ParameterTypeId.StructuralElevationAtBottom` | ForgeTypeId |
| `ForgeTypeId StructuralElevationAtBottomCore { get; }` | `ParameterTypeId.StructuralElevationAtBottomCore` | ForgeTypeId |
| `ForgeTypeId StructuralElevationAtBottomSurvey { get; }` | `ParameterTypeId.StructuralElevationAtBottomSurvey` | ForgeTypeId |
| `ForgeTypeId StructuralElevationAtTop { get; }` | `ParameterTypeId.StructuralElevationAtTop` | ForgeTypeId |
| `ForgeTypeId StructuralElevationAtTopCore { get; }` | `ParameterTypeId.StructuralElevationAtTopCore` | ForgeTypeId |
| `ForgeTypeId StructuralElevationAtTopSurvey { get; }` | `ParameterTypeId.StructuralElevationAtTopSurvey` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseFx { get; }` | `ParameterTypeId.StructuralEndReleaseFx` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseFy { get; }` | `ParameterTypeId.StructuralEndReleaseFy` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseFz { get; }` | `ParameterTypeId.StructuralEndReleaseFz` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseMx { get; }` | `ParameterTypeId.StructuralEndReleaseMx` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseMy { get; }` | `ParameterTypeId.StructuralEndReleaseMy` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseMz { get; }` | `ParameterTypeId.StructuralEndReleaseMz` | ForgeTypeId |
| `ForgeTypeId StructuralEndReleaseType { get; }` | `ParameterTypeId.StructuralEndReleaseType` | ForgeTypeId |
| `ForgeTypeId StructuralFamilyCodeName { get; }` | `ParameterTypeId.StructuralFamilyCodeName` | ForgeTypeId |
| `ForgeTypeId StructuralFamilyNameKey { get; }` | `ParameterTypeId.StructuralFamilyNameKey` | ForgeTypeId |
| `ForgeTypeId StructuralFloorAnalyzesAs { get; }` | `ParameterTypeId.StructuralFloorAnalyzesAs` | ForgeTypeId |
| `ForgeTypeId StructuralFloorCoreThickness { get; }` | `ParameterTypeId.StructuralFloorCoreThickness` | ForgeTypeId |
| `ForgeTypeId StructuralFoundationLength { get; }` | `ParameterTypeId.StructuralFoundationLength` | ForgeTypeId |
| `ForgeTypeId StructuralFoundationThickness { get; }` | `ParameterTypeId.StructuralFoundationThickness` | ForgeTypeId |
| `ForgeTypeId StructuralFoundationWidth { get; }` | `ParameterTypeId.StructuralFoundationWidth` | ForgeTypeId |
| `ForgeTypeId StructuralFrameCutLength { get; }` | `ParameterTypeId.StructuralFrameCutLength` | ForgeTypeId |
| `ForgeTypeId StructuralMaterialParam { get; }` | `ParameterTypeId.StructuralMaterialParam` | ForgeTypeId |
| `ForgeTypeId StructuralMaterialType { get; }` | `ParameterTypeId.StructuralMaterialType` | ForgeTypeId |
| `ForgeTypeId StructuralMemberForces { get; }` | `ParameterTypeId.StructuralMemberForces` | ForgeTypeId |
| `ForgeTypeId StructuralNumberOfStuds { get; }` | `ParameterTypeId.StructuralNumberOfStuds` | ForgeTypeId |
| `ForgeTypeId StructuralReferenceLevelElevation { get; }` | `ParameterTypeId.StructuralReferenceLevelElevation` | ForgeTypeId |
| `ForgeTypeId StructuralSectionArea { get; }` | `ParameterTypeId.StructuralSectionArea` | ForgeTypeId |
| `ForgeTypeId StructuralSectionBottomCutHeight { get; }` | `ParameterTypeId.StructuralSectionBottomCutHeight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionBottomCutWidth { get; }` | `ParameterTypeId.StructuralSectionBottomCutWidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCantileverHeight { get; }` | `ParameterTypeId.StructuralSectionCantileverHeight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCantileverLength { get; }` | `ParameterTypeId.StructuralSectionCantileverLength` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonAlpha { get; }` | `ParameterTypeId.StructuralSectionCommonAlpha` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonCentroidHoriz { get; }` | `ParameterTypeId.StructuralSectionCommonCentroidHoriz` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonCentroidVertical { get; }` | `ParameterTypeId.StructuralSectionCommonCentroidVertical` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonDiameter { get; }` | `ParameterTypeId.StructuralSectionCommonDiameter` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonElasticModulusStrongAxis { get; }` | `ParameterTypeId.StructuralSectionCommonElasticModulusStrongAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonElasticModulusWeakAxis { get; }` | `ParameterTypeId.StructuralSectionCommonElasticModulusWeakAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonHeight { get; }` | `ParameterTypeId.StructuralSectionCommonHeight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonMomentOfInertiaStrongAxis { get; }` | `ParameterTypeId.StructuralSectionCommonMomentOfInertiaStrongAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonMomentOfInertiaWeakAxis { get; }` | `ParameterTypeId.StructuralSectionCommonMomentOfInertiaWeakAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonNominalWeight { get; }` | `ParameterTypeId.StructuralSectionCommonNominalWeight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonPerimeter { get; }` | `ParameterTypeId.StructuralSectionCommonPerimeter` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonPlasticModulusStrongAxis { get; }` | `ParameterTypeId.StructuralSectionCommonPlasticModulusStrongAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonPlasticModulusWeakAxis { get; }` | `ParameterTypeId.StructuralSectionCommonPlasticModulusWeakAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonShearAreaStrongAxis { get; }` | `ParameterTypeId.StructuralSectionCommonShearAreaStrongAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonShearAreaWeakAxis { get; }` | `ParameterTypeId.StructuralSectionCommonShearAreaWeakAxis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonTorsionalModulus { get; }` | `ParameterTypeId.StructuralSectionCommonTorsionalModulus` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonTorsionalMomentOfInertia { get; }` | `ParameterTypeId.StructuralSectionCommonTorsionalMomentOfInertia` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonWarpingConstant { get; }` | `ParameterTypeId.StructuralSectionCommonWarpingConstant` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCommonWidth { get; }` | `ParameterTypeId.StructuralSectionCommonWidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionCprofileFoldLength { get; }` | `ParameterTypeId.StructuralSectionCprofileFoldLength` | ForgeTypeId |
| `ForgeTypeId StructuralSectionHssInnerfillet { get; }` | `ParameterTypeId.StructuralSectionHssInnerfillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionHssOuterfillet { get; }` | `ParameterTypeId.StructuralSectionHssOuterfillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeBoltDiameter { get; }` | `ParameterTypeId.StructuralSectionIshapeBoltDiameter` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeBoltSpacing { get; }` | `ParameterTypeId.StructuralSectionIshapeBoltSpacing` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeBoltSpacingBetweenRows { get; }` | `ParameterTypeId.StructuralSectionIshapeBoltSpacingBetweenRows` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeBoltSpacingTwoRows { get; }` | `ParameterTypeId.StructuralSectionIshapeBoltSpacingTwoRows` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeBoltSpacingWeb { get; }` | `ParameterTypeId.StructuralSectionIshapeBoltSpacingWeb` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeClearWebHeight { get; }` | `ParameterTypeId.StructuralSectionIshapeClearWebHeight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeFlangefillet { get; }` | `ParameterTypeId.StructuralSectionIshapeFlangefillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeFlangethickness { get; }` | `ParameterTypeId.StructuralSectionIshapeFlangethickness` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeFlangethicknessLocation { get; }` | `ParameterTypeId.StructuralSectionIshapeFlangethicknessLocation` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeFlangeToeOfFillet { get; }` | `ParameterTypeId.StructuralSectionIshapeFlangeToeOfFillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeWebfillet { get; }` | `ParameterTypeId.StructuralSectionIshapeWebfillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeWebheight { get; }` | `ParameterTypeId.StructuralSectionIshapeWebheight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeWebthickness { get; }` | `ParameterTypeId.StructuralSectionIshapeWebthickness` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeWebthicknessLocation { get; }` | `ParameterTypeId.StructuralSectionIshapeWebthicknessLocation` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIshapeWebToeOfFillet { get; }` | `ParameterTypeId.StructuralSectionIshapeWebToeOfFillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIweldedBottomflangethickness { get; }` | `ParameterTypeId.StructuralSectionIweldedBottomflangethickness` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIweldedBottomflangewidth { get; }` | `ParameterTypeId.StructuralSectionIweldedBottomflangewidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIweldedTopflangethickness { get; }` | `ParameterTypeId.StructuralSectionIweldedTopflangethickness` | ForgeTypeId |
| `ForgeTypeId StructuralSectionIweldedTopflangewidth { get; }` | `ParameterTypeId.StructuralSectionIweldedTopflangewidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionLangleBoltDiameterLongerFlange { get; }` | `ParameterTypeId.StructuralSectionLangleBoltDiameterLongerFlange` | ForgeTypeId |
| `ForgeTypeId StructuralSectionLangleBoltDiameterShorterFlange { get; }` | `ParameterTypeId.StructuralSectionLangleBoltDiameterShorterFlange` | ForgeTypeId |
| `ForgeTypeId StructuralSectionLangleBoltSpacing1LongerFlange { get; }` | `ParameterTypeId.StructuralSectionLangleBoltSpacing1LongerFlange` | ForgeTypeId |
| `ForgeTypeId StructuralSectionLangleBoltSpacing2LongerFlange { get; }` | `ParameterTypeId.StructuralSectionLangleBoltSpacing2LongerFlange` | ForgeTypeId |
| `ForgeTypeId StructuralSectionLangleBoltSpacingShorterFlange { get; }` | `ParameterTypeId.StructuralSectionLangleBoltSpacingShorterFlange` | ForgeTypeId |
| `ForgeTypeId StructuralSectionLprofileLipLength { get; }` | `ParameterTypeId.StructuralSectionLprofileLipLength` | ForgeTypeId |
| `ForgeTypeId StructuralSectionNameKey { get; }` | `ParameterTypeId.StructuralSectionNameKey` | ForgeTypeId |
| `ForgeTypeId StructuralSectionPipestandardWalldesignthickness { get; }` | `ParameterTypeId.StructuralSectionPipestandardWalldesignthickness` | ForgeTypeId |
| `ForgeTypeId StructuralSectionPipestandardWallnominalthickness { get; }` | `ParameterTypeId.StructuralSectionPipestandardWallnominalthickness` | ForgeTypeId |
| `ForgeTypeId StructuralSectionShape { get; }` | `ParameterTypeId.StructuralSectionShape` | ForgeTypeId |
| `ForgeTypeId StructuralSectionSigmaProfileBendWidth { get; }` | `ParameterTypeId.StructuralSectionSigmaProfileBendWidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionSigmaProfileMiddleBendWidth { get; }` | `ParameterTypeId.StructuralSectionSigmaProfileMiddleBendWidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionSigmaProfileTopBendWidth { get; }` | `ParameterTypeId.StructuralSectionSigmaProfileTopBendWidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionSlopedFlangeAngle { get; }` | `ParameterTypeId.StructuralSectionSlopedFlangeAngle` | ForgeTypeId |
| `ForgeTypeId StructuralSectionSlopedWebAngle { get; }` | `ParameterTypeId.StructuralSectionSlopedWebAngle` | ForgeTypeId |
| `ForgeTypeId StructuralSectionTopCutHeight { get; }` | `ParameterTypeId.StructuralSectionTopCutHeight` | ForgeTypeId |
| `ForgeTypeId StructuralSectionTopCutWidth { get; }` | `ParameterTypeId.StructuralSectionTopCutWidth` | ForgeTypeId |
| `ForgeTypeId StructuralSectionTopWebFillet { get; }` | `ParameterTypeId.StructuralSectionTopWebFillet` | ForgeTypeId |
| `ForgeTypeId StructuralSectionZprofileBottomFlangeLength { get; }` | `ParameterTypeId.StructuralSectionZprofileBottomFlangeLength` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseFx { get; }` | `ParameterTypeId.StructuralStartReleaseFx` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseFy { get; }` | `ParameterTypeId.StructuralStartReleaseFy` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseFz { get; }` | `ParameterTypeId.StructuralStartReleaseFz` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseMx { get; }` | `ParameterTypeId.StructuralStartReleaseMx` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseMy { get; }` | `ParameterTypeId.StructuralStartReleaseMy` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseMz { get; }` | `ParameterTypeId.StructuralStartReleaseMz` | ForgeTypeId |
| `ForgeTypeId StructuralStartReleaseType { get; }` | `ParameterTypeId.StructuralStartReleaseType` | ForgeTypeId |
| `ForgeTypeId StructuralStickSymbolLocation { get; }` | `ParameterTypeId.StructuralStickSymbolLocation` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseFx { get; }` | `ParameterTypeId.StructuralTopReleaseFx` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseFy { get; }` | `ParameterTypeId.StructuralTopReleaseFy` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseFz { get; }` | `ParameterTypeId.StructuralTopReleaseFz` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseMx { get; }` | `ParameterTypeId.StructuralTopReleaseMx` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseMy { get; }` | `ParameterTypeId.StructuralTopReleaseMy` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseMz { get; }` | `ParameterTypeId.StructuralTopReleaseMz` | ForgeTypeId |
| `ForgeTypeId StructuralTopReleaseType { get; }` | `ParameterTypeId.StructuralTopReleaseType` | ForgeTypeId |
| `ForgeTypeId StructuralWallBottomProjectionPlane { get; }` | `ParameterTypeId.StructuralWallBottomProjectionPlane` | ForgeTypeId |
| `ForgeTypeId StructuralWallProjectionSurface { get; }` | `ParameterTypeId.StructuralWallProjectionSurface` | ForgeTypeId |
| `ForgeTypeId StructuralWallTopProjectionPlane { get; }` | `ParameterTypeId.StructuralWallTopProjectionPlane` | ForgeTypeId |
| `ForgeTypeId SupportHandClearance { get; }` | `ParameterTypeId.SupportHandClearance` | ForgeTypeId |
| `ForgeTypeId SupportHeight { get; }` | `ParameterTypeId.SupportHeight` | ForgeTypeId |
| `ForgeTypeId SurfaceArea { get; }` | `ParameterTypeId.SurfaceArea` | ForgeTypeId |
| `ForgeTypeId SurfaceName { get; }` | `ParameterTypeId.SurfaceName` | ForgeTypeId |
| `ForgeTypeId SurfacePatternIdParam { get; }` | `ParameterTypeId.SurfacePatternIdParam` | ForgeTypeId |
| `ForgeTypeId SurfacePerimeter { get; }` | `ParameterTypeId.SurfacePerimeter` | ForgeTypeId |
| `ForgeTypeId SweepBaseFloorSubcategoryId { get; }` | `ParameterTypeId.SweepBaseFloorSubcategoryId` | ForgeTypeId |
| `ForgeTypeId SweepBaseOffset { get; }` | `ParameterTypeId.SweepBaseOffset` | ForgeTypeId |
| `ForgeTypeId SweepBaseRoofSubcategoryId { get; }` | `ParameterTypeId.SweepBaseRoofSubcategoryId` | ForgeTypeId |
| `ForgeTypeId SweepBaseVertOffset { get; }` | `ParameterTypeId.SweepBaseVertOffset` | ForgeTypeId |
| `ForgeTypeId SweepMaxSegAngle { get; }` | `ParameterTypeId.SweepMaxSegAngle` | ForgeTypeId |
| `ForgeTypeId SweepTrajSegmented { get; }` | `ParameterTypeId.SweepTrajSegmented` | ForgeTypeId |
| `ForgeTypeId SymbolFamilyAndTypeNamesParam { get; }` | `ParameterTypeId.SymbolFamilyAndTypeNamesParam` | ForgeTypeId |
| `ForgeTypeId SymbolFamilyNameParam { get; }` | `ParameterTypeId.SymbolFamilyNameParam` | ForgeTypeId |
| `ForgeTypeId SymbolIdParam { get; }` | `ParameterTypeId.SymbolIdParam` | ForgeTypeId |
| `ForgeTypeId SymbolNameParam { get; }` | `ParameterTypeId.SymbolNameParam` | ForgeTypeId |
| `ForgeTypeId SystemEquipmentSets { get; }` | `ParameterTypeId.SystemEquipmentSets` | ForgeTypeId |
| `ForgeTypeId SystemsAnalysisReportFolder { get; }` | `ParameterTypeId.SystemsAnalysisReportFolder` | ForgeTypeId |
| `ForgeTypeId SystemsAnalysisReportStyle { get; }` | `ParameterTypeId.SystemsAnalysisReportStyle` | ForgeTypeId |
| `ForgeTypeId SystemZoneLevelId { get; }` | `ParameterTypeId.SystemZoneLevelId` | ForgeTypeId |
| `ForgeTypeId TagAngleParam { get; }` | `ParameterTypeId.TagAngleParam` | ForgeTypeId |
| `ForgeTypeId TagElementCount { get; }` | `ParameterTypeId.TagElementCount` | ForgeTypeId |
| `ForgeTypeId TagElevationBase { get; }` | `ParameterTypeId.TagElevationBase` | ForgeTypeId |
| `ForgeTypeId TagHeadAlignment { get; }` | `ParameterTypeId.TagHeadAlignment` | ForgeTypeId |
| `ForgeTypeId TagHeadPosition { get; }` | `ParameterTypeId.TagHeadPosition` | ForgeTypeId |
| `ForgeTypeId TagLeaderType { get; }` | `ParameterTypeId.TagLeaderType` | ForgeTypeId |
| `ForgeTypeId TagNoBreakParamStrings { get; }` | `ParameterTypeId.TagNoBreakParamStrings` | ForgeTypeId |
| `ForgeTypeId TagOnPlacementUi { get; }` | `ParameterTypeId.TagOnPlacementUi` | ForgeTypeId |
| `ForgeTypeId TagOrientationBehavior { get; }` | `ParameterTypeId.TagOrientationBehavior` | ForgeTypeId |
| `ForgeTypeId TagOrientationParam { get; }` | `ParameterTypeId.TagOrientationParam` | ForgeTypeId |
| `ForgeTypeId TagSampleText { get; }` | `ParameterTypeId.TagSampleText` | ForgeTypeId |
| `ForgeTypeId TagTag { get; }` | `ParameterTypeId.TagTag` | ForgeTypeId |
| `ForgeTypeId TemplateName { get; }` | `ParameterTypeId.TemplateName` | ForgeTypeId |
| `ForgeTypeId TerminationExtensionLength { get; }` | `ParameterTypeId.TerminationExtensionLength` | ForgeTypeId |
| `ForgeTypeId TextAlignHorz { get; }` | `ParameterTypeId.TextAlignHorz` | ForgeTypeId |
| `ForgeTypeId TextAlignment { get; }` | `ParameterTypeId.TextAlignment` | ForgeTypeId |
| `ForgeTypeId TextAlignVert { get; }` | `ParameterTypeId.TextAlignVert` | ForgeTypeId |
| `ForgeTypeId TextBackground { get; }` | `ParameterTypeId.TextBackground` | ForgeTypeId |
| `ForgeTypeId TextBoxVisibility { get; }` | `ParameterTypeId.TextBoxVisibility` | ForgeTypeId |
| `ForgeTypeId TextColor { get; }` | `ParameterTypeId.TextColor` | ForgeTypeId |
| `ForgeTypeId TextDistToLine { get; }` | `ParameterTypeId.TextDistToLine` | ForgeTypeId |
| `ForgeTypeId TextFont { get; }` | `ParameterTypeId.TextFont` | ForgeTypeId |
| `ForgeTypeId TextPosition { get; }` | `ParameterTypeId.TextPosition` | ForgeTypeId |
| `ForgeTypeId TextSize { get; }` | `ParameterTypeId.TextSize` | ForgeTypeId |
| `ForgeTypeId TextStyleBold { get; }` | `ParameterTypeId.TextStyleBold` | ForgeTypeId |
| `ForgeTypeId TextStyleFont { get; }` | `ParameterTypeId.TextStyleFont` | ForgeTypeId |
| `ForgeTypeId TextStyleItalic { get; }` | `ParameterTypeId.TextStyleItalic` | ForgeTypeId |
| `ForgeTypeId TextStyleSize { get; }` | `ParameterTypeId.TextStyleSize` | ForgeTypeId |
| `ForgeTypeId TextStyleUnderline { get; }` | `ParameterTypeId.TextStyleUnderline` | ForgeTypeId |
| `ForgeTypeId TextTabSize { get; }` | `ParameterTypeId.TextTabSize` | ForgeTypeId |
| `ForgeTypeId TextText { get; }` | `ParameterTypeId.TextText` | ForgeTypeId |
| `ForgeTypeId TextWidthScale { get; }` | `ParameterTypeId.TextWidthScale` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialConductivity { get; }` | `ParameterTypeId.ThermalMaterialConductivity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialDensity { get; }` | `ParameterTypeId.ThermalMaterialDensity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialDescription { get; }` | `ParameterTypeId.ThermalMaterialDescription` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialName { get; }` | `ParameterTypeId.ThermalMaterialName` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamCompressibility { get; }` | `ParameterTypeId.ThermalMaterialParamCompressibility` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamElectricalResistivity { get; }` | `ParameterTypeId.ThermalMaterialParamElectricalResistivity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamEmissivity { get; }` | `ParameterTypeId.ThermalMaterialParamEmissivity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamGasViscosity { get; }` | `ParameterTypeId.ThermalMaterialParamGasViscosity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamLiquidViscosity { get; }` | `ParameterTypeId.ThermalMaterialParamLiquidViscosity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamPermeability { get; }` | `ParameterTypeId.ThermalMaterialParamPermeability` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamPorosity { get; }` | `ParameterTypeId.ThermalMaterialParamPorosity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamReflectivity { get; }` | `ParameterTypeId.ThermalMaterialParamReflectivity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamSpecificHeatOfVaporization { get; }` | `ParameterTypeId.ThermalMaterialParamSpecificHeatOfVaporization` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamTransmitsLight { get; }` | `ParameterTypeId.ThermalMaterialParamTransmitsLight` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialParamVaporPressure { get; }` | `ParameterTypeId.ThermalMaterialParamVaporPressure` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialSpecificHeatCapacity { get; }` | `ParameterTypeId.ThermalMaterialSpecificHeatCapacity` | ForgeTypeId |
| `ForgeTypeId ThermalMaterialThickness { get; }` | `ParameterTypeId.ThermalMaterialThickness` | ForgeTypeId |
| `ForgeTypeId TickMarkPen { get; }` | `ParameterTypeId.TickMarkPen` | ForgeTypeId |
| `ForgeTypeId TilePatternFamrefComponentExtents { get; }` | `ParameterTypeId.TilePatternFamrefComponentExtents` | ForgeTypeId |
| `ForgeTypeId TilePatternGridCellsX { get; }` | `ParameterTypeId.TilePatternGridCellsX` | ForgeTypeId |
| `ForgeTypeId TilePatternGridCellsY { get; }` | `ParameterTypeId.TilePatternGridCellsY` | ForgeTypeId |
| `ForgeTypeId TilePatternGridUnitX { get; }` | `ParameterTypeId.TilePatternGridUnitX` | ForgeTypeId |
| `ForgeTypeId TilePatternGridUnitY { get; }` | `ParameterTypeId.TilePatternGridUnitY` | ForgeTypeId |
| `ForgeTypeId Tilt { get; }` | `ParameterTypeId.Tilt` | ForgeTypeId |
| `ForgeTypeId TitleFont { get; }` | `ParameterTypeId.TitleFont` | ForgeTypeId |
| `ForgeTypeId TitleSize { get; }` | `ParameterTypeId.TitleSize` | ForgeTypeId |
| `ForgeTypeId TitleStyleBold { get; }` | `ParameterTypeId.TitleStyleBold` | ForgeTypeId |
| `ForgeTypeId TitleStyleItalic { get; }` | `ParameterTypeId.TitleStyleItalic` | ForgeTypeId |
| `ForgeTypeId TitleStyleUnderline { get; }` | `ParameterTypeId.TitleStyleUnderline` | ForgeTypeId |
| `ForgeTypeId TopographyLinkName { get; }` | `ParameterTypeId.TopographyLinkName` | ForgeTypeId |
| `ForgeTypeId TopographyLinkPath { get; }` | `ParameterTypeId.TopographyLinkPath` | ForgeTypeId |
| `ForgeTypeId ToposolidAttrThicknessParam { get; }` | `ParameterTypeId.ToposolidAttrThicknessParam` | ForgeTypeId |
| `ForgeTypeId ToposolidContourDisplaySettingsIdParam { get; }` | `ParameterTypeId.ToposolidContourDisplaySettingsIdParam` | ForgeTypeId |
| `ForgeTypeId ToposolidContourSubcategoryId { get; }` | `ParameterTypeId.ToposolidContourSubcategoryId` | ForgeTypeId |
| `ForgeTypeId ToposolidElevationAtBottom { get; }` | `ParameterTypeId.ToposolidElevationAtBottom` | ForgeTypeId |
| `ForgeTypeId ToposolidElevationAtTop { get; }` | `ParameterTypeId.ToposolidElevationAtTop` | ForgeTypeId |
| `ForgeTypeId ToposolidFacesLocation { get; }` | `ParameterTypeId.ToposolidFacesLocation` | ForgeTypeId |
| `ForgeTypeId ToposolidFunctionParam { get; }` | `ParameterTypeId.ToposolidFunctionParam` | ForgeTypeId |
| `ForgeTypeId ToposolidHeightabovelevelParam { get; }` | `ParameterTypeId.ToposolidHeightabovelevelParam` | ForgeTypeId |
| `ForgeTypeId ToposolidInheritContours { get; }` | `ParameterTypeId.ToposolidInheritContours` | ForgeTypeId |
| `ForgeTypeId ToposolidStructureIdParam { get; }` | `ParameterTypeId.ToposolidStructureIdParam` | ForgeTypeId |
| `ForgeTypeId ToposolidSubdivideHeight { get; }` | `ParameterTypeId.ToposolidSubdivideHeight` | ForgeTypeId |
| `ForgeTypeId ToposolidSubdivideMaterial { get; }` | `ParameterTypeId.ToposolidSubdivideMaterial` | ForgeTypeId |
| `ForgeTypeId ToposolidTypeDefaultThicknessParam { get; }` | `ParameterTypeId.ToposolidTypeDefaultThicknessParam` | ForgeTypeId |
| `ForgeTypeId ToposurfaceContourSubcategoryId { get; }` | `ParameterTypeId.ToposurfaceContourSubcategoryId` | ForgeTypeId |
| `ForgeTypeId TotalExcavationVolume { get; }` | `ParameterTypeId.TotalExcavationVolume` | ForgeTypeId |
| `ForgeTypeId TrapMullWidth { get; }` | `ParameterTypeId.TrapMullWidth` | ForgeTypeId |
| `ForgeTypeId TrussBearingChordTopBottomParam { get; }` | `ParameterTypeId.TrussBearingChordTopBottomParam` | ForgeTypeId |
| `ForgeTypeId TrussElementAngleParam { get; }` | `ParameterTypeId.TrussElementAngleParam` | ForgeTypeId |
| `ForgeTypeId TrussElementBearingJustParam { get; }` | `ParameterTypeId.TrussElementBearingJustParam` | ForgeTypeId |
| `ForgeTypeId TrussElementClassParam { get; }` | `ParameterTypeId.TrussElementClassParam` | ForgeTypeId |
| `ForgeTypeId TrussElementCreateBottomParam { get; }` | `ParameterTypeId.TrussElementCreateBottomParam` | ForgeTypeId |
| `ForgeTypeId TrussElementCreateTopParam { get; }` | `ParameterTypeId.TrussElementCreateTopParam` | ForgeTypeId |
| `ForgeTypeId TrussElementEnd0Elevation { get; }` | `ParameterTypeId.TrussElementEnd0Elevation` | ForgeTypeId |
| `ForgeTypeId TrussElementEnd1Elevation { get; }` | `ParameterTypeId.TrussElementEnd1Elevation` | ForgeTypeId |
| `ForgeTypeId TrussElementReferenceLevelParam { get; }` | `ParameterTypeId.TrussElementReferenceLevelParam` | ForgeTypeId |
| `ForgeTypeId TrussElementRotateChordsWithTruss { get; }` | `ParameterTypeId.TrussElementRotateChordsWithTruss` | ForgeTypeId |
| `ForgeTypeId TrussElementSpanParam { get; }` | `ParameterTypeId.TrussElementSpanParam` | ForgeTypeId |
| `ForgeTypeId TrussElementStickJustParam { get; }` | `ParameterTypeId.TrussElementStickJustParam` | ForgeTypeId |
| `ForgeTypeId TrussElementTagNewMembersView { get; }` | `ParameterTypeId.TrussElementTagNewMembersView` | ForgeTypeId |
| `ForgeTypeId TrussFamilyBottomChordAngleParam { get; }` | `ParameterTypeId.TrussFamilyBottomChordAngleParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyBottomChordEndReleaseType { get; }` | `ParameterTypeId.TrussFamilyBottomChordEndReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyBottomChordStartReleaseType { get; }` | `ParameterTypeId.TrussFamilyBottomChordStartReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyBottomChordStructuralTypesParam { get; }` | `ParameterTypeId.TrussFamilyBottomChordStructuralTypesParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyBottomChordVerticalProjectionParam { get; }` | `ParameterTypeId.TrussFamilyBottomChordVerticalProjectionParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyDiagWebAngleParam { get; }` | `ParameterTypeId.TrussFamilyDiagWebAngleParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyDiagWebEndReleaseType { get; }` | `ParameterTypeId.TrussFamilyDiagWebEndReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyDiagWebStartReleaseType { get; }` | `ParameterTypeId.TrussFamilyDiagWebStartReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyDiagWebStructuralTypesParam { get; }` | `ParameterTypeId.TrussFamilyDiagWebStructuralTypesParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTopChordAngleParam { get; }` | `ParameterTypeId.TrussFamilyTopChordAngleParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTopChordEndReleaseType { get; }` | `ParameterTypeId.TrussFamilyTopChordEndReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTopChordStartReleaseType { get; }` | `ParameterTypeId.TrussFamilyTopChordStartReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTopChordStructuralTypesParam { get; }` | `ParameterTypeId.TrussFamilyTopChordStructuralTypesParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTopChordVerticalProjectionParam { get; }` | `ParameterTypeId.TrussFamilyTopChordVerticalProjectionParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTransformationParam { get; }` | `ParameterTypeId.TrussFamilyTransformationParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyVertWebAngleParam { get; }` | `ParameterTypeId.TrussFamilyVertWebAngleParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyVertWebEndReleaseType { get; }` | `ParameterTypeId.TrussFamilyVertWebEndReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyVertWebStartReleaseType { get; }` | `ParameterTypeId.TrussFamilyVertWebStartReleaseType` | ForgeTypeId |
| `ForgeTypeId TrussFamilyVertWebStructuralTypesParam { get; }` | `ParameterTypeId.TrussFamilyVertWebStructuralTypesParam` | ForgeTypeId |
| `ForgeTypeId TrussFamilyWebsHaveSymbolicCutbackParam { get; }` | `ParameterTypeId.TrussFamilyWebsHaveSymbolicCutbackParam` | ForgeTypeId |
| `ForgeTypeId TrussHeight { get; }` | `ParameterTypeId.TrussHeight` | ForgeTypeId |
| `ForgeTypeId TrussLength { get; }` | `ParameterTypeId.TrussLength` | ForgeTypeId |
| `ForgeTypeId TrussNonBearingOffsetParam { get; }` | `ParameterTypeId.TrussNonBearingOffsetParam` | ForgeTypeId |
| `ForgeTypeId TypeWallClosure { get; }` | `ParameterTypeId.TypeWallClosure` | ForgeTypeId |
| `ForgeTypeId UniformatCode { get; }` | `ParameterTypeId.UniformatCode` | ForgeTypeId |
| `ForgeTypeId UniformatDescription { get; }` | `ParameterTypeId.UniformatDescription` | ForgeTypeId |
| `ForgeTypeId Use3dSnapping { get; }` | `ParameterTypeId.Use3dSnapping` | ForgeTypeId |
| `ForgeTypeId UsingMultiple { get; }` | `ParameterTypeId.UsingMultiple` | ForgeTypeId |
| `ForgeTypeId ViewAnalysisDisplayStyle { get; }` | `ParameterTypeId.ViewAnalysisDisplayStyle` | ForgeTypeId |
| `ForgeTypeId ViewAnalysisResultsVisibility { get; }` | `ParameterTypeId.ViewAnalysisResultsVisibility` | ForgeTypeId |
| `ForgeTypeId ViewAssociatedAssemblyInstanceId { get; }` | `ParameterTypeId.ViewAssociatedAssemblyInstanceId` | ForgeTypeId |
| `ForgeTypeId ViewBackClipping { get; }` | `ParameterTypeId.ViewBackClipping` | ForgeTypeId |
| `ForgeTypeId ViewCameraOrientation { get; }` | `ParameterTypeId.ViewCameraOrientation` | ForgeTypeId |
| `ForgeTypeId ViewCameraPosition { get; }` | `ParameterTypeId.ViewCameraPosition` | ForgeTypeId |
| `ForgeTypeId ViewCleanJoins { get; }` | `ParameterTypeId.ViewCleanJoins` | ForgeTypeId |
| `ForgeTypeId ViewDependency { get; }` | `ParameterTypeId.ViewDependency` | ForgeTypeId |
| `ForgeTypeId ViewDepth { get; }` | `ParameterTypeId.ViewDepth` | ForgeTypeId |
| `ForgeTypeId ViewDescription { get; }` | `ParameterTypeId.ViewDescription` | ForgeTypeId |
| `ForgeTypeId ViewDesignOptionsConfig { get; }` | `ParameterTypeId.ViewDesignOptionsConfig` | ForgeTypeId |
| `ForgeTypeId ViewDetailLevel { get; }` | `ParameterTypeId.ViewDetailLevel` | ForgeTypeId |
| `ForgeTypeId ViewDiscipline { get; }` | `ParameterTypeId.ViewDiscipline` | ForgeTypeId |
| `ForgeTypeId Viewer3dRenderSettings { get; }` | `ParameterTypeId.Viewer3dRenderSettings` | ForgeTypeId |
| `ForgeTypeId ViewerAnnotationCropActive { get; }` | `ParameterTypeId.ViewerAnnotationCropActive` | ForgeTypeId |
| `ForgeTypeId ViewerBoundActiveBottom { get; }` | `ParameterTypeId.ViewerBoundActiveBottom` | ForgeTypeId |
| `ForgeTypeId ViewerBoundActiveFar { get; }` | `ParameterTypeId.ViewerBoundActiveFar` | ForgeTypeId |
| `ForgeTypeId ViewerBoundActiveLeft { get; }` | `ParameterTypeId.ViewerBoundActiveLeft` | ForgeTypeId |
| `ForgeTypeId ViewerBoundActiveNear { get; }` | `ParameterTypeId.ViewerBoundActiveNear` | ForgeTypeId |
| `ForgeTypeId ViewerBoundActiveRight { get; }` | `ParameterTypeId.ViewerBoundActiveRight` | ForgeTypeId |
| `ForgeTypeId ViewerBoundActiveTop { get; }` | `ParameterTypeId.ViewerBoundActiveTop` | ForgeTypeId |
| `ForgeTypeId ViewerBoundFarClipping { get; }` | `ParameterTypeId.ViewerBoundFarClipping` | ForgeTypeId |
| `ForgeTypeId ViewerBoundOffsetBottom { get; }` | `ParameterTypeId.ViewerBoundOffsetBottom` | ForgeTypeId |
| `ForgeTypeId ViewerBoundOffsetFar { get; }` | `ParameterTypeId.ViewerBoundOffsetFar` | ForgeTypeId |
| `ForgeTypeId ViewerBoundOffsetLeft { get; }` | `ParameterTypeId.ViewerBoundOffsetLeft` | ForgeTypeId |
| `ForgeTypeId ViewerBoundOffsetNear { get; }` | `ParameterTypeId.ViewerBoundOffsetNear` | ForgeTypeId |
| `ForgeTypeId ViewerBoundOffsetRight { get; }` | `ParameterTypeId.ViewerBoundOffsetRight` | ForgeTypeId |
| `ForgeTypeId ViewerBoundOffsetTop { get; }` | `ParameterTypeId.ViewerBoundOffsetTop` | ForgeTypeId |
| `ForgeTypeId ViewerCropRegion { get; }` | `ParameterTypeId.ViewerCropRegion` | ForgeTypeId |
| `ForgeTypeId ViewerCropRegionDisabled { get; }` | `ParameterTypeId.ViewerCropRegionDisabled` | ForgeTypeId |
| `ForgeTypeId ViewerCropRegionVisible { get; }` | `ParameterTypeId.ViewerCropRegionVisible` | ForgeTypeId |
| `ForgeTypeId ViewerDetailNumber { get; }` | `ParameterTypeId.ViewerDetailNumber` | ForgeTypeId |
| `ForgeTypeId ViewerEyeElevation { get; }` | `ParameterTypeId.ViewerEyeElevation` | ForgeTypeId |
| `ForgeTypeId ViewerIsReference { get; }` | `ParameterTypeId.ViewerIsReference` | ForgeTypeId |
| `ForgeTypeId ViewerModelClipBoxActive { get; }` | `ParameterTypeId.ViewerModelClipBoxActive` | ForgeTypeId |
| `ForgeTypeId ViewerOptionVisibility { get; }` | `ParameterTypeId.ViewerOptionVisibility` | ForgeTypeId |
| `ForgeTypeId ViewerPerspective { get; }` | `ParameterTypeId.ViewerPerspective` | ForgeTypeId |
| `ForgeTypeId ViewerReferenceLabel { get; }` | `ParameterTypeId.ViewerReferenceLabel` | ForgeTypeId |
| `ForgeTypeId ViewerReferenceLabelText { get; }` | `ParameterTypeId.ViewerReferenceLabelText` | ForgeTypeId |
| `ForgeTypeId ViewerSheetCollection { get; }` | `ParameterTypeId.ViewerSheetCollection` | ForgeTypeId |
| `ForgeTypeId ViewerSheetName { get; }` | `ParameterTypeId.ViewerSheetName` | ForgeTypeId |
| `ForgeTypeId ViewerSheetNumber { get; }` | `ParameterTypeId.ViewerSheetNumber` | ForgeTypeId |
| `ForgeTypeId ViewerShowUncropped { get; }` | `ParameterTypeId.ViewerShowUncropped` | ForgeTypeId |
| `ForgeTypeId ViewerTargetElevation { get; }` | `ParameterTypeId.ViewerTargetElevation` | ForgeTypeId |
| `ForgeTypeId ViewerVolumeOfInterestCrop { get; }` | `ParameterTypeId.ViewerVolumeOfInterestCrop` | ForgeTypeId |
| `ForgeTypeId ViewFamily { get; }` | `ParameterTypeId.ViewFamily` | ForgeTypeId |
| `ForgeTypeId ViewFamilyAndTypeSchedules { get; }` | `ParameterTypeId.ViewFamilyAndTypeSchedules` | ForgeTypeId |
| `ForgeTypeId ViewFamilySchedules { get; }` | `ParameterTypeId.ViewFamilySchedules` | ForgeTypeId |
| `ForgeTypeId ViewFixedSketchPlane { get; }` | `ParameterTypeId.ViewFixedSketchPlane` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedBottomLevel { get; }` | `ParameterTypeId.ViewGraphSchedBottomLevel` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedGridAppearance { get; }` | `ParameterTypeId.ViewGraphSchedGridAppearance` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedGroupSimilar { get; }` | `ParameterTypeId.ViewGraphSchedGroupSimilar` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedHiddenLevels { get; }` | `ParameterTypeId.ViewGraphSchedHiddenLevels` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedLevelRelativeBaseType { get; }` | `ParameterTypeId.ViewGraphSchedLevelRelativeBaseType` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedLocationsHigh { get; }` | `ParameterTypeId.ViewGraphSchedLocationsHigh` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedLocationsLow { get; }` | `ParameterTypeId.ViewGraphSchedLocationsLow` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedMaterialTypes { get; }` | `ParameterTypeId.ViewGraphSchedMaterialTypes` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedNumberColumns { get; }` | `ParameterTypeId.ViewGraphSchedNumberColumns` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedOffGrid { get; }` | `ParameterTypeId.ViewGraphSchedOffGrid` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedRowsCount { get; }` | `ParameterTypeId.ViewGraphSchedRowsCount` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedRowsFrom { get; }` | `ParameterTypeId.ViewGraphSchedRowsFrom` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedTextAppearance { get; }` | `ParameterTypeId.ViewGraphSchedTextAppearance` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedTitle { get; }` | `ParameterTypeId.ViewGraphSchedTitle` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedTopLevel { get; }` | `ParameterTypeId.ViewGraphSchedTopLevel` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedTotalColumns { get; }` | `ParameterTypeId.ViewGraphSchedTotalColumns` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedTotalRows { get; }` | `ParameterTypeId.ViewGraphSchedTotalRows` | ForgeTypeId |
| `ForgeTypeId ViewGraphSchedUnitsFormat { get; }` | `ParameterTypeId.ViewGraphSchedUnitsFormat` | ForgeTypeId |
| `ForgeTypeId ViewGraphSunPath { get; }` | `ParameterTypeId.ViewGraphSunPath` | ForgeTypeId |
| `ForgeTypeId ViewGraphSunPathSize { get; }` | `ParameterTypeId.ViewGraphSunPathSize` | ForgeTypeId |
| `ForgeTypeId ViewModelDisplayMode { get; }` | `ParameterTypeId.ViewModelDisplayMode` | ForgeTypeId |
| `ForgeTypeId ViewName { get; }` | `ParameterTypeId.ViewName` | ForgeTypeId |
| `ForgeTypeId ViewPartsVisibility { get; }` | `ParameterTypeId.ViewPartsVisibility` | ForgeTypeId |
| `ForgeTypeId ViewPhase { get; }` | `ParameterTypeId.ViewPhase` | ForgeTypeId |
| `ForgeTypeId ViewPhaseFilter { get; }` | `ParameterTypeId.ViewPhaseFilter` | ForgeTypeId |
| `ForgeTypeId ViewportAttrLabelTag { get; }` | `ParameterTypeId.ViewportAttrLabelTag` | ForgeTypeId |
| `ForgeTypeId ViewportAttrOrientationOnSheet { get; }` | `ParameterTypeId.ViewportAttrOrientationOnSheet` | ForgeTypeId |
| `ForgeTypeId ViewportAttrPreserveTitlePosition { get; }` | `ParameterTypeId.ViewportAttrPreserveTitlePosition` | ForgeTypeId |
| `ForgeTypeId ViewportAttrShowBox { get; }` | `ParameterTypeId.ViewportAttrShowBox` | ForgeTypeId |
| `ForgeTypeId ViewportAttrShowExtensionLine { get; }` | `ParameterTypeId.ViewportAttrShowExtensionLine` | ForgeTypeId |
| `ForgeTypeId ViewportAttrShowLabel { get; }` | `ParameterTypeId.ViewportAttrShowLabel` | ForgeTypeId |
| `ForgeTypeId ViewportDetailNumber { get; }` | `ParameterTypeId.ViewportDetailNumber` | ForgeTypeId |
| `ForgeTypeId ViewportPositioning { get; }` | `ParameterTypeId.ViewportPositioning` | ForgeTypeId |
| `ForgeTypeId ViewportScale { get; }` | `ParameterTypeId.ViewportScale` | ForgeTypeId |
| `ForgeTypeId ViewportSheetCollection { get; }` | `ParameterTypeId.ViewportSheetCollection` | ForgeTypeId |
| `ForgeTypeId ViewportSheetName { get; }` | `ParameterTypeId.ViewportSheetName` | ForgeTypeId |
| `ForgeTypeId ViewportSheetNumber { get; }` | `ParameterTypeId.ViewportSheetNumber` | ForgeTypeId |
| `ForgeTypeId ViewportView { get; }` | `ParameterTypeId.ViewportView` | ForgeTypeId |
| `ForgeTypeId ViewportViewName { get; }` | `ParameterTypeId.ViewportViewName` | ForgeTypeId |
| `ForgeTypeId ViewReferencingDetail { get; }` | `ParameterTypeId.ViewReferencingDetail` | ForgeTypeId |
| `ForgeTypeId ViewReferencingSheet { get; }` | `ParameterTypeId.ViewReferencingSheet` | ForgeTypeId |
| `ForgeTypeId ViewReferencingSheetCollection { get; }` | `ParameterTypeId.ViewReferencingSheetCollection` | ForgeTypeId |
| `ForgeTypeId ViewScale { get; }` | `ParameterTypeId.ViewScale` | ForgeTypeId |
| `ForgeTypeId ViewScaleCustomname { get; }` | `ParameterTypeId.ViewScaleCustomname` | ForgeTypeId |
| `ForgeTypeId ViewScaleHavename { get; }` | `ParameterTypeId.ViewScaleHavename` | ForgeTypeId |
| `ForgeTypeId ViewScalePulldownImperial { get; }` | `ParameterTypeId.ViewScalePulldownImperial` | ForgeTypeId |
| `ForgeTypeId ViewScalePulldownMetric { get; }` | `ParameterTypeId.ViewScalePulldownMetric` | ForgeTypeId |
| `ForgeTypeId ViewSchemaSettingForBuilding { get; }` | `ParameterTypeId.ViewSchemaSettingForBuilding` | ForgeTypeId |
| `ForgeTypeId ViewSchemaSettingForSystem { get; }` | `ParameterTypeId.ViewSchemaSettingForSystem` | ForgeTypeId |
| `ForgeTypeId ViewSchemaSettingForSystemTemplate { get; }` | `ParameterTypeId.ViewSchemaSettingForSystemTemplate` | ForgeTypeId |
| `ForgeTypeId ViewSheetViewportInfo { get; }` | `ParameterTypeId.ViewSheetViewportInfo` | ForgeTypeId |
| `ForgeTypeId ViewShowGrids { get; }` | `ParameterTypeId.ViewShowGrids` | ForgeTypeId |
| `ForgeTypeId ViewShowHiddenLines { get; }` | `ParameterTypeId.ViewShowHiddenLines` | ForgeTypeId |
| `ForgeTypeId ViewShowMassing { get; }` | `ParameterTypeId.ViewShowMassing` | ForgeTypeId |
| `ForgeTypeId ViewSlantedColumnSymbolOffset { get; }` | `ParameterTypeId.ViewSlantedColumnSymbolOffset` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyAnimationSpeedText { get; }` | `ParameterTypeId.ViewSolarstudyAnimationSpeedText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyAnimationSpeedValue { get; }` | `ParameterTypeId.ViewSolarstudyAnimationSpeedValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get; }` | `ParameterTypeId.ViewSolarstudyCurrentStudyTypeIndex` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyIsLightingStudyType { get; }` | `ParameterTypeId.ViewSolarstudyIsLightingStudyType` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyIsMultidayStudyType { get; }` | `ParameterTypeId.ViewSolarstudyIsMultidayStudyType` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyIsSingledayStudyType { get; }` | `ParameterTypeId.ViewSolarstudyIsSingledayStudyType` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyIsStillimageStudyType { get; }` | `ParameterTypeId.ViewSolarstudyIsStillimageStudyType` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyLightingAltitudeText { get; }` | `ParameterTypeId.ViewSolarstudyLightingAltitudeText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyLightingAltitudeValue { get; }` | `ParameterTypeId.ViewSolarstudyLightingAltitudeValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyLightingAzimuthText { get; }` | `ParameterTypeId.ViewSolarstudyLightingAzimuthText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyLightingAzimuthValue { get; }` | `ParameterTypeId.ViewSolarstudyLightingAzimuthValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyLightingPresetIndex { get; }` | `ParameterTypeId.ViewSolarstudyLightingPresetIndex` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyMultidayDatetimeText { get; }` | `ParameterTypeId.ViewSolarstudyMultidayDatetimeText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyMultidayFrameText { get; }` | `ParameterTypeId.ViewSolarstudyMultidayFrameText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyMultidayFrameValue { get; }` | `ParameterTypeId.ViewSolarstudyMultidayFrameValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyMultidayPresetIndex { get; }` | `ParameterTypeId.ViewSolarstudyMultidayPresetIndex` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyShadowsIntensityText { get; }` | `ParameterTypeId.ViewSolarstudyShadowsIntensityText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyShadowsIntensityValue { get; }` | `ParameterTypeId.ViewSolarstudyShadowsIntensityValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudySingledayDatetimeText { get; }` | `ParameterTypeId.ViewSolarstudySingledayDatetimeText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudySingledayFrameText { get; }` | `ParameterTypeId.ViewSolarstudySingledayFrameText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudySingledayFrameValue { get; }` | `ParameterTypeId.ViewSolarstudySingledayFrameValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudySingledayPresetIndex { get; }` | `ParameterTypeId.ViewSolarstudySingledayPresetIndex` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyStillDateText { get; }` | `ParameterTypeId.ViewSolarstudyStillDateText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyStillDateValue { get; }` | `ParameterTypeId.ViewSolarstudyStillDateValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyStillPresetIndex { get; }` | `ParameterTypeId.ViewSolarstudyStillPresetIndex` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyStillTimeText { get; }` | `ParameterTypeId.ViewSolarstudyStillTimeText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudyStillTimeValue { get; }` | `ParameterTypeId.ViewSolarstudyStillTimeValue` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudySunIntensityText { get; }` | `ParameterTypeId.ViewSolarstudySunIntensityText` | ForgeTypeId |
| `ForgeTypeId ViewSolarstudySunIntensityValue { get; }` | `ParameterTypeId.ViewSolarstudySunIntensityValue` | ForgeTypeId |
| `ForgeTypeId ViewTemplate { get; }` | `ParameterTypeId.ViewTemplate` | ForgeTypeId |
| `ForgeTypeId ViewTemplateForSchedule { get; }` | `ParameterTypeId.ViewTemplateForSchedule` | ForgeTypeId |
| `ForgeTypeId ViewType { get; }` | `ParameterTypeId.ViewType` | ForgeTypeId |
| `ForgeTypeId ViewTypeSchedules { get; }` | `ParameterTypeId.ViewTypeSchedules` | ForgeTypeId |
| `ForgeTypeId ViewUnderlayBottomId { get; }` | `ParameterTypeId.ViewUnderlayBottomId` | ForgeTypeId |
| `ForgeTypeId ViewUnderlayOrientation { get; }` | `ParameterTypeId.ViewUnderlayOrientation` | ForgeTypeId |
| `ForgeTypeId ViewUnderlayTopId { get; }` | `ParameterTypeId.ViewUnderlayTopId` | ForgeTypeId |
| `ForgeTypeId ViewVisibleCategories { get; }` | `ParameterTypeId.ViewVisibleCategories` | ForgeTypeId |
| `ForgeTypeId VisGraphicsAnalyticalModel { get; }` | `ParameterTypeId.VisGraphicsAnalyticalModel` | ForgeTypeId |
| `ForgeTypeId VisGraphicsAnnotation { get; }` | `ParameterTypeId.VisGraphicsAnnotation` | ForgeTypeId |
| `ForgeTypeId VisGraphicsCoordinationModel { get; }` | `ParameterTypeId.VisGraphicsCoordinationModel` | ForgeTypeId |
| `ForgeTypeId VisGraphicsDesignoptions { get; }` | `ParameterTypeId.VisGraphicsDesignoptions` | ForgeTypeId |
| `ForgeTypeId VisGraphicsFilters { get; }` | `ParameterTypeId.VisGraphicsFilters` | ForgeTypeId |
| `ForgeTypeId VisGraphicsImport { get; }` | `ParameterTypeId.VisGraphicsImport` | ForgeTypeId |
| `ForgeTypeId VisGraphicsModel { get; }` | `ParameterTypeId.VisGraphicsModel` | ForgeTypeId |
| `ForgeTypeId VisGraphicsPointClouds { get; }` | `ParameterTypeId.VisGraphicsPointClouds` | ForgeTypeId |
| `ForgeTypeId VisGraphicsRvtLinks { get; }` | `ParameterTypeId.VisGraphicsRvtLinks` | ForgeTypeId |
| `ForgeTypeId VisGraphicsWorksets { get; }` | `ParameterTypeId.VisGraphicsWorksets` | ForgeTypeId |
| `ForgeTypeId VoidCutsGeometry { get; }` | `ParameterTypeId.VoidCutsGeometry` | ForgeTypeId |
| `ForgeTypeId VolumeCut { get; }` | `ParameterTypeId.VolumeCut` | ForgeTypeId |
| `ForgeTypeId VolumeFill { get; }` | `ParameterTypeId.VolumeFill` | ForgeTypeId |
| `ForgeTypeId VolumeNet { get; }` | `ParameterTypeId.VolumeNet` | ForgeTypeId |
| `ForgeTypeId VolumeOfInterestHeight { get; }` | `ParameterTypeId.VolumeOfInterestHeight` | ForgeTypeId |
| `ForgeTypeId VolumeOfInterestName { get; }` | `ParameterTypeId.VolumeOfInterestName` | ForgeTypeId |
| `ForgeTypeId VolumeOfInterestViewsVisible { get; }` | `ParameterTypeId.VolumeOfInterestViewsVisible` | ForgeTypeId |
| `ForgeTypeId WalkthroughFramesCount { get; }` | `ParameterTypeId.WalkthroughFramesCount` | ForgeTypeId |
| `ForgeTypeId WallAlignKeyRefParam { get; }` | `ParameterTypeId.WallAlignKeyRefParam` | ForgeTypeId |
| `ForgeTypeId WallAttrDefheightParam { get; }` | `ParameterTypeId.WallAttrDefheightParam` | ForgeTypeId |
| `ForgeTypeId WallAttrHeightParam { get; }` | `ParameterTypeId.WallAttrHeightParam` | ForgeTypeId |
| `ForgeTypeId WallAttrRoomBounding { get; }` | `ParameterTypeId.WallAttrRoomBounding` | ForgeTypeId |
| `ForgeTypeId WallAttrWidthParam { get; }` | `ParameterTypeId.WallAttrWidthParam` | ForgeTypeId |
| `ForgeTypeId WallBaseConstraint { get; }` | `ParameterTypeId.WallBaseConstraint` | ForgeTypeId |
| `ForgeTypeId WallBaseHeightParam { get; }` | `ParameterTypeId.WallBaseHeightParam` | ForgeTypeId |
| `ForgeTypeId WallBaseOffset { get; }` | `ParameterTypeId.WallBaseOffset` | ForgeTypeId |
| `ForgeTypeId WallBottomExtensionDistParam { get; }` | `ParameterTypeId.WallBottomExtensionDistParam` | ForgeTypeId |
| `ForgeTypeId WallBottomIsAttached { get; }` | `ParameterTypeId.WallBottomIsAttached` | ForgeTypeId |
| `ForgeTypeId WallCrossSection { get; }` | `ParameterTypeId.WallCrossSection` | ForgeTypeId |
| `ForgeTypeId WallHeightType { get; }` | `ParameterTypeId.WallHeightType` | ForgeTypeId |
| `ForgeTypeId WallKeyRefParam { get; }` | `ParameterTypeId.WallKeyRefParam` | ForgeTypeId |
| `ForgeTypeId WallLocationLineOffsetParam { get; }` | `ParameterTypeId.WallLocationLineOffsetParam` | ForgeTypeId |
| `ForgeTypeId WallSingleSlantAngleFromVertical { get; }` | `ParameterTypeId.WallSingleSlantAngleFromVertical` | ForgeTypeId |
| `ForgeTypeId WallStructuralSignificant { get; }` | `ParameterTypeId.WallStructuralSignificant` | ForgeTypeId |
| `ForgeTypeId WallStructuralUsageParam { get; }` | `ParameterTypeId.WallStructuralUsageParam` | ForgeTypeId |
| `ForgeTypeId WallStructureIdParam { get; }` | `ParameterTypeId.WallStructureIdParam` | ForgeTypeId |
| `ForgeTypeId WallSweepCutByInsertsParam { get; }` | `ParameterTypeId.WallSweepCutByInsertsParam` | ForgeTypeId |
| `ForgeTypeId WallSweepCutsWallParam { get; }` | `ParameterTypeId.WallSweepCutsWallParam` | ForgeTypeId |
| `ForgeTypeId WallSweepDefaultSetbackParam { get; }` | `ParameterTypeId.WallSweepDefaultSetbackParam` | ForgeTypeId |
| `ForgeTypeId WallSweepLevelParam { get; }` | `ParameterTypeId.WallSweepLevelParam` | ForgeTypeId |
| `ForgeTypeId WallSweepOffsetParam { get; }` | `ParameterTypeId.WallSweepOffsetParam` | ForgeTypeId |
| `ForgeTypeId WallSweepOrientation { get; }` | `ParameterTypeId.WallSweepOrientation` | ForgeTypeId |
| `ForgeTypeId WallSweepProfileParam { get; }` | `ParameterTypeId.WallSweepProfileParam` | ForgeTypeId |
| `ForgeTypeId WallSweepWallOffsetParam { get; }` | `ParameterTypeId.WallSweepWallOffsetParam` | ForgeTypeId |
| `ForgeTypeId WallSweepWallSubcategoryId { get; }` | `ParameterTypeId.WallSweepWallSubcategoryId` | ForgeTypeId |
| `ForgeTypeId WallTaperedExteriorInwardAngle { get; }` | `ParameterTypeId.WallTaperedExteriorInwardAngle` | ForgeTypeId |
| `ForgeTypeId WallTaperedInteriorInwardAngle { get; }` | `ParameterTypeId.WallTaperedInteriorInwardAngle` | ForgeTypeId |
| `ForgeTypeId WallTaperedUseInstanceAngles { get; }` | `ParameterTypeId.WallTaperedUseInstanceAngles` | ForgeTypeId |
| `ForgeTypeId WallTaperedWidthAtBottom { get; }` | `ParameterTypeId.WallTaperedWidthAtBottom` | ForgeTypeId |
| `ForgeTypeId WallTaperedWidthAtTop { get; }` | `ParameterTypeId.WallTaperedWidthAtTop` | ForgeTypeId |
| `ForgeTypeId WallTopExtensionDistParam { get; }` | `ParameterTypeId.WallTopExtensionDistParam` | ForgeTypeId |
| `ForgeTypeId WallTopIsAttached { get; }` | `ParameterTypeId.WallTopIsAttached` | ForgeTypeId |
| `ForgeTypeId WallTopOffset { get; }` | `ParameterTypeId.WallTopOffset` | ForgeTypeId |
| `ForgeTypeId WallTypeDefaultTaperedExteriorInwardAngle { get; }` | `ParameterTypeId.WallTypeDefaultTaperedExteriorInwardAngle` | ForgeTypeId |
| `ForgeTypeId WallTypeDefaultTaperedInteriorInwardAngle { get; }` | `ParameterTypeId.WallTypeDefaultTaperedInteriorInwardAngle` | ForgeTypeId |
| `ForgeTypeId WallTypeWidthMeasuredAt { get; }` | `ParameterTypeId.WallTypeWidthMeasuredAt` | ForgeTypeId |
| `ForgeTypeId WallUserHeightParam { get; }` | `ParameterTypeId.WallUserHeightParam` | ForgeTypeId |
| `ForgeTypeId WindowTypeId { get; }` | `ParameterTypeId.WindowTypeId` | ForgeTypeId |
| `ForgeTypeId WindowtypeIsSchematic { get; }` | `ParameterTypeId.WindowtypeIsSchematic` | ForgeTypeId |
| `ForgeTypeId WindowTypeName { get; }` | `ParameterTypeId.WindowTypeName` | ForgeTypeId |
| `ForgeTypeId WitnsLineExtension { get; }` | `ParameterTypeId.WitnsLineExtension` | ForgeTypeId |
| `ForgeTypeId WitnsLineGapToElt { get; }` | `ParameterTypeId.WitnsLineGapToElt` | ForgeTypeId |
| `ForgeTypeId WitnsLineTickMark { get; }` | `ParameterTypeId.WitnsLineTickMark` | ForgeTypeId |
| `ForgeTypeId WrappingAtEndsParam { get; }` | `ParameterTypeId.WrappingAtEndsParam` | ForgeTypeId |
| `ForgeTypeId WrappingAtInsertsParam { get; }` | `ParameterTypeId.WrappingAtInsertsParam` | ForgeTypeId |
| `ForgeTypeId YJustification { get; }` | `ParameterTypeId.YJustification` | ForgeTypeId |
| `ForgeTypeId YOffsetValue { get; }` | `ParameterTypeId.YOffsetValue` | ForgeTypeId |
| `ForgeTypeId YzJustification { get; }` | `ParameterTypeId.YzJustification` | ForgeTypeId |
| `ForgeTypeId ZJustification { get; }` | `ParameterTypeId.ZJustification` | ForgeTypeId |
| `ForgeTypeId ZOffsetValue { get; }` | `ParameterTypeId.ZOffsetValue` | ForgeTypeId |
| `ForgeTypeId ZoneAirChangesPerHour { get; }` | `ParameterTypeId.ZoneAirChangesPerHour` | ForgeTypeId |
| `ForgeTypeId ZoneAirVolumeCalculationTypeParam { get; }` | `ParameterTypeId.ZoneAirVolumeCalculationTypeParam` | ForgeTypeId |
| `ForgeTypeId ZoneArea { get; }` | `ParameterTypeId.ZoneArea` | ForgeTypeId |
| `ForgeTypeId ZoneAreaGross { get; }` | `ParameterTypeId.ZoneAreaGross` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedAreaPerCoolingLoadParam { get; }` | `ParameterTypeId.ZoneCalculatedAreaPerCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedAreaPerHeatingLoadParam { get; }` | `ParameterTypeId.ZoneCalculatedAreaPerHeatingLoadParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedCoolingLoadParam { get; }` | `ParameterTypeId.ZoneCalculatedCoolingLoadParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedCoolingLoadPerAreaParam { get; }` | `ParameterTypeId.ZoneCalculatedCoolingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedHeatingLoadParam { get; }` | `ParameterTypeId.ZoneCalculatedHeatingLoadParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedHeatingLoadPerAreaParam { get; }` | `ParameterTypeId.ZoneCalculatedHeatingLoadPerAreaParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedHydronicCoolingflowParam { get; }` | `ParameterTypeId.ZoneCalculatedHydronicCoolingflowParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedHydronicHeatingflowParam { get; }` | `ParameterTypeId.ZoneCalculatedHydronicHeatingflowParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedSupplyAirflowParam { get; }` | `ParameterTypeId.ZoneCalculatedSupplyAirflowParam` | ForgeTypeId |
| `ForgeTypeId ZoneCalculatedSupplyAirflowPerAreaParam { get; }` | `ParameterTypeId.ZoneCalculatedSupplyAirflowPerAreaParam` | ForgeTypeId |
| `ForgeTypeId ZoneCoilBypassPercentageParam { get; }` | `ParameterTypeId.ZoneCoilBypassPercentageParam` | ForgeTypeId |
| `ForgeTypeId ZoneCoolingAirTemperatureParam { get; }` | `ParameterTypeId.ZoneCoolingAirTemperatureParam` | ForgeTypeId |
| `ForgeTypeId ZoneCoolingInformationParam { get; }` | `ParameterTypeId.ZoneCoolingInformationParam` | ForgeTypeId |
| `ForgeTypeId ZoneCoolingSetPointParam { get; }` | `ParameterTypeId.ZoneCoolingSetPointParam` | ForgeTypeId |
| `ForgeTypeId ZoneDehumidificationSetPointParam { get; }` | `ParameterTypeId.ZoneDehumidificationSetPointParam` | ForgeTypeId |
| `ForgeTypeId ZoneDesignCoolTemperature { get; }` | `ParameterTypeId.ZoneDesignCoolTemperature` | ForgeTypeId |
| `ForgeTypeId ZoneDesignHeatTemperature { get; }` | `ParameterTypeId.ZoneDesignHeatTemperature` | ForgeTypeId |
| `ForgeTypeId ZoneHeatingAirTemperatureParam { get; }` | `ParameterTypeId.ZoneHeatingAirTemperatureParam` | ForgeTypeId |
| `ForgeTypeId ZoneHeatingInformationParam { get; }` | `ParameterTypeId.ZoneHeatingInformationParam` | ForgeTypeId |
| `ForgeTypeId ZoneHeatingSetPointParam { get; }` | `ParameterTypeId.ZoneHeatingSetPointParam` | ForgeTypeId |
| `ForgeTypeId ZoneHumidificationSetPointParam { get; }` | `ParameterTypeId.ZoneHumidificationSetPointParam` | ForgeTypeId |
| `ForgeTypeId ZoneLevelId { get; }` | `ParameterTypeId.ZoneLevelId` | ForgeTypeId |
| `ForgeTypeId ZoneLevelOffset { get; }` | `ParameterTypeId.ZoneLevelOffset` | ForgeTypeId |
| `ForgeTypeId ZoneLevelOffsetTop { get; }` | `ParameterTypeId.ZoneLevelOffsetTop` | ForgeTypeId |
| `ForgeTypeId ZoneName { get; }` | `ParameterTypeId.ZoneName` | ForgeTypeId |
| `ForgeTypeId ZoneOaRatePerAchParam { get; }` | `ParameterTypeId.ZoneOaRatePerAchParam` | ForgeTypeId |
| `ForgeTypeId ZoneOutdoorAirInformationParam { get; }` | `ParameterTypeId.ZoneOutdoorAirInformationParam` | ForgeTypeId |
| `ForgeTypeId ZoneOutsideAirFlowPerArea { get; }` | `ParameterTypeId.ZoneOutsideAirFlowPerArea` | ForgeTypeId |
| `ForgeTypeId ZoneOutsideAirFlowPerPerson { get; }` | `ParameterTypeId.ZoneOutsideAirFlowPerPerson` | ForgeTypeId |
| `ForgeTypeId ZoneOutsideAirPerAreaParam { get; }` | `ParameterTypeId.ZoneOutsideAirPerAreaParam` | ForgeTypeId |
| `ForgeTypeId ZoneOutsideAirPerPersonParam { get; }` | `ParameterTypeId.ZoneOutsideAirPerPersonParam` | ForgeTypeId |
| `ForgeTypeId ZonePerimeter { get; }` | `ParameterTypeId.ZonePerimeter` | ForgeTypeId |
| `ForgeTypeId ZonePhase { get; }` | `ParameterTypeId.ZonePhase` | ForgeTypeId |
| `ForgeTypeId ZonePhaseId { get; }` | `ParameterTypeId.ZonePhaseId` | ForgeTypeId |
| `ForgeTypeId ZoneServiceTypeParam { get; }` | `ParameterTypeId.ZoneServiceTypeParam` | ForgeTypeId |
| `ForgeTypeId ZoneSpaceOutdoorAirOptionParam { get; }` | `ParameterTypeId.ZoneSpaceOutdoorAirOptionParam` | ForgeTypeId |
| `ForgeTypeId ZoneUseAirChangesPerHourParam { get; }` | `ParameterTypeId.ZoneUseAirChangesPerHourParam` | ForgeTypeId |
| `ForgeTypeId ZoneUseDehumidificationSetpointParam { get; }` | `ParameterTypeId.ZoneUseDehumidificationSetpointParam` | ForgeTypeId |
| `ForgeTypeId ZoneUseHumidificationSetpointParam { get; }` | `ParameterTypeId.ZoneUseHumidificationSetpointParam` | ForgeTypeId |
| `ForgeTypeId ZoneUseOutsideAirPerAreaParam { get; }` | `ParameterTypeId.ZoneUseOutsideAirPerAreaParam` | ForgeTypeId |
| `ForgeTypeId ZoneUseOutsideAirPerPersonParam { get; }` | `ParameterTypeId.ZoneUseOutsideAirPerPersonParam` | ForgeTypeId |
| `ForgeTypeId ZoneVolume { get; }` | `ParameterTypeId.ZoneVolume` | ForgeTypeId |
| `ForgeTypeId ZoneVolumeGross { get; }` | `ParameterTypeId.ZoneVolumeGross` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```